{
  "Discord_Title": "Discord",
  "Discord_Intro": "Lees de regels voordat je lid wordt van onze Discord-server (ze kunnen ook worden bekeken in {#rules-and-faq} als je eenmaal binnen bent):",
  "Discord_Rule1": "Houd je aan de regels van Discord en aan de onze: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Wees respectvol naar anderen. Wees niet onverdraagzaam, zet niet aan tot drama, gedraag je niet aanstootgevend, noem gebruikers/rollen niet herhaaldelijk en stuur geen DM's naar serverleden (inclusief personeel) zonder toestemming.",
  "Discord_Rule3": "Houd onderwerpen beperkt tot de daarvoor bestemde kanalen. Lees altijd de beschrijving als je niet helemaal zeker bent van het doel. Als een medewerker je vraagt om het gesprek te verplaatsen, doe dat dan.",
  "Discord_Rule4": "Het is niet toegestaan om content te verspreiden die op dit moment wordt verkocht of waarvan wordt verzocht om deze te verwijderen van Flashpoint.",
  "Discord_Rule5": "{Stuur nooit e-mails over Flashpoint zonder toestemming van het personeel, hoe goed je het ook vindt.} Niemand wil dat zijn kans om in contact te komen met een ontwikkelaar verloren gaat, daarom willen we ervoor zorgen dat dit niet gebeurt.",
  "Discord_Rule6": "Promotie van jezelf of gelieerde partijen door middel van Discord-uitnodigingen, YouTube-links, geld verdienen en dergelijke is verboden, tenzij het in de context van Flashpoint of digitaal archief is.",
  "Discord_Rule7": "NSFW-inhoud en -discussies moeten in {#nsfw-lounge} blijven (het bestaan van het kanaal alleen al zou meer dan genoeg moeten verklaren).",
  "Discord_Rule8": "Politieke discussies horen niet thuis op deze server. Ga ergens anders heen of bespreek het helemaal niet.",
  "Discord_Curation_Exception": "(Curaties - specifieke discussies over en opgenomen inhoud - zijn de enige uitzondering op regels 7 en 8)",
  "Discord_Sanctions": "Teamleden mogen gebruikers waarvan zij vinden dat ze deze regels overtreden waarschuwen/ stilzwijgen/schoppen/bannen op basis van de ernst van de overtreden regel. We moedigen medewerkers aan om luchtig te doen over de eerste keer of per ongeluk een regel overtreden, maar meerdere overtredingen zullen resulteren in zwaardere straffen.",
  "Discord_Agreed": "Ik heb de regels gelezen en ik wil meedoen aan de server!"
}