{
  "FAQ_Title": "Veel gestelde vragen (FAQ)",
  "FAQ_Question1": "Heette dit vroeger niet BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Ja - het project werkte met BlueMaxima in de naam tot zijn pensionering van het project in januari 2023.",
  "FAQ_Question2": "Welke besturingssystemen ondersteunen jullie?",
  "FAQ_Answer2": "Flashpoint ondersteunt Windows 8.1 en nieuwer (met uitzondering van Windows 8). MacOS- en Linux-versies zijn ook beschikbaar, maar deze vereisen extra stappen om te installeren en kunnen slechts een handvol van de populairste browsertechnologieën uitvoeren.",
  "FAQ_Question3": "Levert Flashpoint veiligheidsproblemen op?",
  "FAQ_Answer3": "Niet dat we weten. Onze hele applicatiesuite (minus Infinity's technologie voor het downloaden van spellen) kan geen verbinding maken met het open internet; alle registerwijzigingen die Flashpoint Secure Player aanbrengt, worden verwijderd zodra het spel wordt afgesloten; alle binnenkomende curaties worden doorgegeven aan een pc met competente en up-to-date antivirussoftware; en het belangrijkste is dat de launcher en alle onderdelen van Flashpoint {vrij en open-source zijn}. We hebben ons best gedaan om ervoor te zorgen dat de collectie zo veilig mogelijk is, maar ondanks onze inspanningen hebben bepaalde antivirussen zoals Avast en AVG de neiging om belangrijke onderdelen als gevaarlijk te detecteren. Als dit probleem zich bij jou voordoet, {lees dan deze pagina} voor instructies om het probleem op te lossen.",
  "FAQ_Question4": "Hoeveel spellen/animaties zijn er?",
  "FAQ_Answer4": "Flashpoint biedt momenteel meer dan {} spellen en {} animaties. Je kunt de collectie doorzoeken zonder Flashpoint te downloaden {here}.",
  "FAQ_Question5": "Voor welke browserplatforms is Flashpoint geschikt?",
  "FAQ_Answer5": "We bewaren spellen en animaties die draaien op elk platform dat staat vermeld op de {statistiekenpagina} van de Flashpoint Database.",
  "FAQ_Question6": "Waar zijn de Nitrome-spellen?",
  "FAQ_Answer6": "Nitrome heeft ons beleefd gevraagd om hun inhoud uit de collectie te verwijderen. Als je hun spellen wilt spelen, doe dat dan op hun {website}, en als Flash geen optie is, volg dan hun groeiende {HTML5-compatibele catalogus}. {Flashpoint keurt pesterijen over Nitrome's beslissing niet goed.}",
  "FAQ_Question7": "Hoe kan ik een spel/animatie aanvragen?",
  "FAQ_Answer7": "Je kunt een verzoek indienen door eerst {dit artikel} helemaal te lezen en dan de links onderaan te volgen.",
  "FAQ_Question8": "Kan ik zelf een spel/animatie toevoegen?",
  "FAQ_Answer8": "Ja! Volg de instructies in de {curation tutorial} om je curatorauditie op te zetten. Zodra deze is geaccepteerd, kun je zoveel curaties indienen als je wilt.",
  "FAQ_Question9": "Ik wil op een andere manier bijdragen (coderen, testen, enz.). Hoe kan ik helpen?",
  "FAQ_Answer9": "Word lid van onze {Discord server} voor meer details. Het meeste van ons werk en communicatie gebeurt daar.",
  "FAQ_Question10": "Is Flashpoint open source?",
  "FAQ_Answer10": "Ja...ongeveer. De bronnen voor onze op maat gemaakte technologie, zoals de launcher, zijn allemaal beschikbaar op onze {GitHub}. De broncodes voor de software die we in Flashpoint gebruiken zijn beschikbaar op hun respectievelijke websites (we passen de broncode van de software die we gebruiken niet aan). De binaries voor de webplugins zelf zijn niet open source, maar als dat wel zo was, zouden we hier niet zijn.",
  "FAQ_Question11": "Mag ik het logo gebruiken/is het beschikbaar onder Creative Commons?",
  "FAQ_Answer11": "Ja - het logo valt onder de {CC-BY 4.0} licentie. Voor naamsvermelding mag je optioneel Seirade en Flashpoint vermelden. Bronbestanden zijn te vinden {here}.",
  "FAQ_Question12": "Waar kan ik doneren aan het project?",
  "FAQ_Answer12": "Flashpoint Archive werkt als een non-profit collectief. U kunt meer informatie vinden over hoe u kunt doneren en waar uw geld naartoe gaat op onze {Open Collectief pagina}.",
  "FAQ_Question13": "Flashpoint werkt niet goed!",
  "FAQ_Answer13": "Volg de stappen voor probleemoplossing in de {manual}. Als je daarna nog steeds problemen hebt, vraag dan om hulp in onze Discord.",
  "FAQ_Question14": "Ik wil dat een spel/animatie om de een of andere reden uit Flashpoint wordt verwijderd.",
  "FAQ_Answer14": "Waarschuw ons via onze Discord of {direct per e-mail}. We zullen je waarschijnlijk proberen te overtuigen om ons je spel te laten houden omwille van de geschiedenis, maar we zijn niet onredelijk.",
  "FAQ_Question15": "Ik heb nog een vraag.",
  "FAQ_Answer15": "Raadpleeg onze {uitgebreide FAQ}. Als je vraag daar niet wordt beantwoord, ga dan naar onze Discord."
}
