{
  "News_Title": "Nieuws",
  "News_Para1": "Alle opmerkelijke gebeurtenissen in Flashpoint geschiedenis vanaf oktober 2019. Beweeg over de codename van een versie voor een verklaring van BlueMaxima, de projectstichter.",
  "News_Para2": "Een changelog met alle versie die vóór de overgang naar het componentgebaseerde systeem is vrijgegeven, kan {here} gevonden worden. Voor directe downloads naar oudere versies van Flashpoint Ultimate, zie respectievelijk BlueMaxima's en Dri0m's Internet Archive accounts {here} en {here}.",
  "News_Flashpoint_Started": "BlueMaxima's Flashpoint is gestart.",
  "News_Flashpoint_0": "Flashpoint Zero is vrijgegeven.",
  "News_Flashpoint_1": "Flashpoint versie One is vrijgegeven.",
  "News_Was_Released": "is vrijgegeven",
  "News_Flashpoint_3_0": "Sleutels voor het Koninkrijk",
  "News_Flashpoint_3_0_Meta": "Deze versie introduceerde de Redirector, het laatste stukje van de puzzel dat de server setup werk maakte - laat ons 99,9% van Flash-spellen te behouden zonder te hacken. De sleutels van het koninkrijk van Flash-conservatie, als u wilt.",
  "News_Flashpoint_3_1": "Nacht openen",
  "News_Flashpoint_3_1_Meta": "Deze versie was de eerste die Flashpoint Theatre (hoewel het een apart exemplaar van LaunchBox op dat moment was).",
  "News_Flashpoint_3_2": "Angst und Schrecken",
  "News_Flashpoint_3_2_Meta": "Deze versie ondersteunt als eerste Shockwave titels.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Benoem na het feit dat we 4.000 partijen hadden gepasseerd in de collectie op dit punt. Jonge, hoe tijd vliegt.",
  "News_Flashpoint_4_0": "De Levende Oneindig",
  "News_Flashpoint_4_0_Meta": "Deze versie introduceert Flashpoint Infinity, waarmee mensen spellen van het internet kunnen streamen. De naam wordt overgenomen van het album van Soilwork's 2013 met dezelfde naam.",
  "News_Flashpoint_4_1": "Javaliteit",
  "News_Flashpoint_4_1_Meta": "Dit was de versie die ondersteuning introduceerde voor Java-applets. DarkMoe kwam met de naam.",
  "News_Flashpoint_5_0": "Ga voor het starten",
  "News_Flashpoint_5_0_Meta": "De Launcher die we allemaal kennen en waar we van houden, is geïntroduceerd in deze versie.",
  "News_Flashpoint_5_1": "Het Geweldige Filter",
  "News_Flashpoint_5_1_Meta": "Afspeellijsten werden hier toegevoegd (een filter). De naam is overgenomen van de Mesarthim EP, Het Geweldige Filter.",
  "News_Flashpoint_5_2": "Type III",
  "News_Flashpoint_5_2_Meta": "Het grootse filter en type III zijn twee Mesarthim EP's die vaak worden samengevoegd. Er is geen andere naam gevonden toen we het nodig hadden.",
  "News_Flashpoint_5_3": "Revolutie",
  "News_Flashpoint_5_3_Meta": "Deze versie is in de buurt van de 1-jarige verjaardag van Flashpoint vrijgekomen, en we vonden het echt een revolutie. (Het zou ook oorspronkelijk 'Orbit' heten, maar dat was een domme naam voor het concept.)",
  "News_Flashpoint_5_4": "Recombinatie",
  "News_Flashpoint_5_4_Meta": "Deze versie verplaatste animaties met spelen, die eerder in aparte mappen met aparte clients waren. 'Aanbeveling' en '74%' zijn ook de naam van twee nummers in het Mesarthim album The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Een snelle set van patches gemaakt naast de uploadtijd van 5,4. Het was niet alsof Flashpoint 5,4 slechts 74% werd voltooid toen we het uitbraken.",
  "News_Flashpoint_5_5": "Ijzer & Koper",
  "News_Flashpoint_5_5_Meta": "BlueMaxima speelde een beetje te veel Deus Ex op dat moment.",
  "News_Flashpoint_6_0": "Uitlijning",
  "News_Flashpoint_6_0_Meta": "Nog een Mesarthim referentie!",
  "News_Flashpoint_6_1": "Voorreserveringssysteem",
  "News_Flashpoint_6_1_Meta": "Een spel op de voorwaarden van software vaak gebruikt in techniek, zoals 'freeware' en 'shareware'.",
  "News_Flashpoint_6_2": "Moe's Grote Ontsnapping",
  "News_Flashpoint_6_2_Meta": "Het staflid DarkMoe heeft deze versie een werkelijk krankzinnige hoeveelheid escape-the-room spellen gecureerd.",
  "News_Flashpoint_6_3": "We hebben het over Flash Games, niet over Abstract Philosophie",
  "News_Flashpoint_6_3_Meta": "Vernoemd na een spontane uitspraak van nosamu, een staflid.",
  "News_Old_Releases_Title": "Retroactieve tijdlijn van releases",
  "News_Old_Releases_Description": "Vanwege het feit dat er pas sinds december 2019 een nieuwskolom bestond, is het merendeel van de releases tot nu toe niet in catalogus opgenomen. Deze sectie is verantwoordelijk voor de ontbrekende versies.",
  "News_Is_Available": "is nu beschikbaar!",
  "News_Grab_Download": "Pak het van de {downloads page}",
  "News_Flashpoint_Update_October_2019": "De Flashpoint status update voor oktober 2019 is nu beschikbaar op Medium. Bekijk het {here}.",
  "News_Flashpoint_Update_November_2019": "De Flashpoint status update voor november 2019 is nu beschikbaar op Medium. Bekijk het {here}.",
  "News_Flashpoint_7_0": "Acht Duizend uren",
  "News_Flashpoint_7_0_Meta": "Achtduizend uur was ongeveer hoe lang Flash op het moment van de vrijlating moest doorstaan.",
  "News_Flashpoint_7_1": "Blijf op doelwit",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7,0 kwam naar onze maatstaven uit een puinhoop. 7,1 was een zware bugfix release.",
  "News_Featured_Kotaku_Link": "We zijn uitgelicht op Kotaku!",
  "News_Featured_Kotaku_Rest": "Dit is een enorme mijlpaal. Dank u allen voor de steun!",
  "News_Flashpoint_Update_March_2020": "De Flashpoint status update voor maart 2020 is nu beschikbaar op Medium. Bekijk het {here}.",
  "News_Flashpoint_Update_April_2020": "De Flashpoint status update voor april 2020 is nu beschikbaar op Medium. Bekijk het {here}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Deze versie zag het einde van de Redirector software, die eerder werd gebruikt om de server te laten werken. HTTP Code 301 is 'permanent verplaatst', als in, niet meer omleiden.",
  "News_Flashpoint_Update_June_2020": "De update van de mini status update voor juni 2020 is nu beschikbaar op Medium. Bekijk het {here}.",
  "News_Flashpoint_8_1": "Geest van Avontuur",
  "News_Flashpoint_8_1_Meta": "Na een regel van het toenmalige Aether Realm album, Redneck Vikings from Hell. Om specifiek te zijn, het nummer 'One Hollow Word'.",
  "News_Flashpoint_Update_August_2020": "De Flashpoint status update voor augustus 2020 is nu beschikbaar op Medium. Bekijk het {here}.",
  "News_Flashpoint_8_2": "Naderen Planeet Negen",
  "News_Flashpoint_8_2_Meta": "Één (uitgelekt, ik geef u) portmanteau van 'naderen van versie negen', en Planet Negen, het Mesarthim EP.",
  "News_Flashpoint_9_0": "Glorieuze Zonsondergang",
  "News_Flashpoint_9_0_Meta": "Noem na Glorious Morning, het nummer dat het meest bekend staat omdat het in oorlogstijd is. Dit was de laatste versie die vóór de dood van Flash vrijkwam, vandaar 'zonsondergang'.",
  "News_Flashpoint_Update_April_2021": "De Flashpoint status update voor april 2021 is vandaag vrijgegeven. Bekijk het {here}.",
  "News_Flashpoint_10_0": "Afwezigheid",
  "News_Flashpoint_10_0_Meta": "Dit is de eerste versie die vrijkomt naar een post-Flash internet, vandaar de naam 'Afwezig'. Het was toevallig ook de naam van het laatste spoor van het Mesarthim EP \"Vacuum Solution”.",
  "News_Flashpoint_10_1": "Afwezigheid II",
  "News_Flashpoint_10_1_Meta": "Gaat u maar door.",
  "News_Flashpoint_11": "Oeps, alle plugins!",
  "News_Flashpoint_11_Meta": "Het is een meme, omdat 11 drie dozijn nieuwe plugins heeft toegevoegd.",
  "News_Flashpoint_11_1": "Operatie Kersenbloesem",
  "News_Flashpoint_11_1_Meta": "Een verwijzing naar het spel Muv-Luv (koop het op Steam).",
  "News_Flashpoint_12": "Axolotl",
  "News_Flashpoint_12_meta": "Ze zijn schattig en ze zijn vet."
}