{
  "Platforms_Title": "Ondersteunde platforms",
  "Platforms_Description1": "Flashpoint ondersteunt games en animaties die gemaakt zijn voor een verscheidenheid aan webplugins en standaarden - niet alleen Flash. Deze pagina bevat een overzicht van de geschiedenis van elke technologie vanaf versie 11. Bijgewerkte statistieken over het aantal inzendingen van elk platform kunnen bekeken worden in de {Flashpoint Database}.",
  "Platforms_Description2": "Dit dient als een \"Wie? Wanneer? Wat?\" samenvatting & startpunt voor verder onderzoek, het is geen allesomvattende geschiedenis van elk platform. We doen ons best om accurate feiten weer te geven, maar fouten blijven mogelijk. Neem contact met ons op met relevante informatie voor correcties.",
  "Platforms_By": "door",
  "Platforms_3D_Groove_GX_Description": "The Groove Alliance werd opgericht in 1998 en was de ontwikkelaar van 3D Groove SX, een 3D-game-engine met Shockwave. Later, in 2002, werd de engine losgekoppeld van Shockwave en omgevormd tot 3D Groove GX. Beide varianten konden worden gebruikt voor de ontwikkeling van online games en desktoptoepassingen. Dit bleek een succes te zijn voor het bedrijf, het vergaarde een groot aantal zakelijke gebruikers en leidde tot de creatie van verschillende spraakmakende titels voor tv-programma's en andere grote eigendommen. Nadat de hype voorbij was, werd The Groove Alliance in 2008 omgevormd tot OTOY, maar de 3D Groove website bleef online tot 2009. De exacte oorzaak van de ondergang van het oorspronkelijke bedrijf is onbekend, maar er is bevestigd dat er interne strubbelingen hebben plaatsgevonden.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (voorheen 3D Life Player, Virtools Player en NeMo Web Player, niet te verwarren met 3DVIA Studio/Beta Player of 3DVIA Composer Player) was een browser plugin van Dassault Systèmes voor het afspelen van 3D ervaringen gemaakt in Virtools. Het was bedoeld voor geavanceerde, praktische toepassingen van 3D zoals computergebaseerde training, virtuele rondleidingen en vastgoed. 3DVIA Player werd ook gebruikt voor webgames, waarbij enkele van de belangrijkste gebruikers de in Quebec gevestigde gamestudio Sarbakan en de in Amsterdam gevestigde Little Chicken Game Company waren. De laatste update, versie 5.0, werd uitgebracht in 2009. De downloadpagina zou de komende jaren blijven bestaan totdat hij in 2016 werd verwijderd. Tegen die tijd was het spel al meer dan 30 miljoen keer geïnstalleerd.",
  "Platforms_AboutPeople_Description": "Nog geen beschrijving.",
  "Platforms_AboutTime_Description": "Nog geen beschrijving.",
  "Platforms_ActiveX_Controls_Description": "ActiveX, in 1996 uitgebracht door Microsoft, was een softwareframework dat diende als standaard voor het inkapselen van programma's als containers voor gebruik in andere niet-gerelateerde programma's, ActiveX-besturingselementen genoemd. Ze konden worden ingesloten in HTML-inhoud en er konden speciaal voor één doel bestemde besturingselementen worden gemaakt voor gebruik in Internet Explorer om webgames af te spelen. Na de lancering van Edge in 2015 werd de software niet meer gebruikt en het gebruik ervan voor webtoepassingen lijkt te zijn gestopt. De software wordt nu in Internet Explorer 11 ondersteund door oudere software.",
  "Platforms_Adobe_Atmosphere_Player_Description": "De ontwikkeling begon in 1996 als V3O door Rocket Science Games, werd later overgedragen aan Attitude Software en omgedoopt tot 3D Anarchy, en vervolgens verkocht aan Adobe in 2000 en herdoopt in 2001. Atmosphere Player is een web plugin gemaakt voor het bekijken van interactieve 3D werelden, vergelijkbaar met de VRML standaard, gemaakt in Atmosphere Builder. Het was vooral bedoeld voor virtuele mediagalerijen, die afbeeldingen/audio/video en de 3D-modellen zelf konden presenteren. Toen het begon als 3D Anarchy, was de software nog in bèta toen Adobe de technologie overnam voor verdere ontwikkeling. De volgende 3 jaar werd de software getest in bèta's en de laatste versie 1.0 van de Player werd uitgebracht in februari 2004. In december 2004 werd aangekondigd dat Atmosphere zou worden stopgezet en dat de ondersteuning in januari 2005 zou worden beëindigd.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (ook gewoon Flash, voorheen Macromedia Shockwave Flash Player) is een speler voor vectoranimaties en afbeeldingen, vaak met toegevoegde interactiviteit. Het werd gebruikt als medium voor webgames vanwege de effectieve compressie, de lage prijs, het gebruiksgemak en de grote install base. Ontwikkeld in 1995 en voor het eerst geïntroduceerd door FutureWave in 1996, kon het weinig meer dan basisanimaties en knoppen om ze te besturen. Naarmate het populairder werd, werden er meer geavanceerde functies aan de speler toegevoegd, zoals de programmeertaal ActionScript. Toen mensen echter op hun hoede raakten voor de potentiële beveiligingsproblemen en HTML5 steeds populairder werd onder webontwikkelaars, kondigde Adobe aan dat Flash op 31 december 2020 uit de roulatie zou worden genomen.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (ook Shockwave, voorheen Macromedia Shockwave Player of Shockwave Director Player) is een speler voor interactieve media die in 1995 werd uitgebracht. Gebouwd op technologie die 10 jaar eerder was ontwikkeld door MacroMind, werd het pas een web plugin na de overname door Macromedia. In tegenstelling tot Flash bevatte Shockwave de scripttaal Lingo en ondersteuning voor C++ door het gebruik van Xtras, waardoor de speler over een breed scala aan mogelijkheden beschikte, waaronder 3D. Het werd wijdverspreid gebruikt op het vroege internet en in cd-rom-spellen en won aan populariteit. Het platform daalde aanzienlijk in populariteit na de overname van Macromedia door Adobe ten gunste van Flash, dat snel uitbreidde qua mogelijkheden en nu ook eigendom was van Adobe. Uiteindelijk kondigde Adobe in februari 2019 de stopzetting aan en twee maanden later werd de ondersteuning stopgezet.",
  "Platforms_Alambik_Plugin_Description": "De Alambik Plugin is een webspeler voor inhoud gemaakt met Alambik, een ontwikkelplatform. Het werd uitgebracht in 2001 en was geschikt voor 2D- en 3D-afbeeldingen, vectoren en vele andere toepassingen. In 2002 organiseerde Alambik een wedstrijd met prijzen om de release van Alambik Script te vieren. In 2004 maakte Alambik een nieuwe demosite, maar daarna werd het stil en heeft het bedrijf nooit meer iets nieuws uitgebracht voor het platform of de plugin bijgewerkt.",
  "Platforms_Ambulant_Description": "Ambulant is een speler voor SMIL-bestanden, gemaakt door verschillende individuen die coördineren bij het CWI in Amsterdam, Nederland. De naam lijkt te verwijzen naar \"ambulation\", een ander woord voor lopen; dit wordt verder ondersteund door het logo dat iemand lijkt te zijn die loopt. SMIL was een specificatie van W3C, het internationale webconsortium, maar werd niet erg populair. Ambulant probeerde een open source speler te zijn die alle SMIL-bestanden ondersteunt. Echter, de wens om alle onderdelen open source te maken verhinderde de ondersteuning van sommige propriëtaire mediaformaten. De ontwikkeling begon in april 2003 en de eerste versie, \"AMBULANT/G\" werd uitgebracht in juli van dat jaar. De laatste stabiele versie, 2.6, werd uitgebracht in februari 2015, maar het werk aan een onstabiele build van Ambulant 2.7 ging door tot juli 2016, toen de laatste commit naar hun Github repo werd gedaan. De ontwikkelaars van Ambulant zijn nog steeds actief op andere projecten.",
  "Platforms_AnimaFlex_Description": "AnimaFlex was een grafische afspeelplugin die animaties met een kleine bestandsgrootte kon afspelen, gemaakt met RubberWeb Composer, die afbeeldingen konden uitrekken en vervormen. Het kon animaties afspelen voordat het hele bestand was gedownload en zich aanpassen aan lagere internetsnelheden. Ondanks de beloften had RubberFlex zelf verschillende andere producten, die allemaal gifs exporteerden, die concurreerden met hun eigen optie, en ze lanceerden zelfs FlexToGif om Plugin-bestanden te converteren naar gifs 2 dagen na de plugin. Begin 1998 stopte RubberWeb Composer met de distributie, waardoor AnimaFlex zonder auteursprogramma kwam te zitten.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics was een presentatieprogramma dat in 1986 werd gemaakt door Software Publishing Corporation (SPC) voor MS-DOS PC's. Na de overgang naar Windows in 1991 slaagde het er niet in om het marktaandeel terug te winnen dat het had en verloor het van PowerPoint. In 1996 kocht Allegro New Media (later dat jaar omgedoopt tot Vizacom) SPC en Serif. SPC creëerde ASAP WordPower, een programma om eenvoudig diavoorstellingen te maken die op het web konden worden gepubliceerd met behulp van de ASAP WebShow plugin. SPC fuseerde met Serif in 1997. in 1998 werd het merk Harvard nieuw leven ingeblazen met het auteursprogramma Harvard Graphics 98, en de invoegtoepassing werd vervangen door een nieuwe, Harvard Graphics WebShow. In 2000 exporteerde Advanced Presentations, de nieuwe versie van de auteurssoftware, naar de Flash-standaard in plaats van het gepatenteerde plugin-formaat. Vizacom verkocht Serif terug aan het oorspronkelijke management in 2001, waardoor de Harvard-serie werd gedegradeerd tot legacysoftware, die werd ondersteund en verkocht tot de stopzetting in 2017.",
  "Platforms_Authorware_Web_Player_Description": "De Authorware Web Player werd in 1996 door Macromedia gemaakt als een van de nieuwe functies van Authorware 3.5. Het was een manier om interactieve programma's die waren ontwikkeld met Macromedia Authorware op het web uit te voeren. In tegenstelling tot de meeste webplugins was het primaire doel van Authorware om e-learning te ondersteunen, wat leidde tot het gebruik ervan in bedrijven en in de academische wereld als een manier om multimediaal lesmateriaal samen te stellen zonder programmeerervaring. De laatste versie van de plugin werd uitgebracht in 2004, vóór de overname van Macromedia door Adobe in 2005. Daarna stagneerde de ontwikkeling tot de aankondiging van de stopzetting in 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Nog geen beschrijving.",
  "Platforms_AXEL_Player_Description": "AXEL Player was een interactieve 3D-inhoudsplugin die in 2002 werd gemaakt door MindAvenue. Het was een manier voor modellen en animaties op het AXELedge web authoring programma, en AXELpublisher, die bestanden converteerde van andere 3D software zoals 3ds Max. De software werd goed ontvangen door critici, ondanks een paar beperkingen, waaronder het gebrek aan veel gebruikers voor de plugin. In 2005 werd MindAvenue overgenomen door 20-20 Technologies, gespecialiseerd in software voor interieurontwerp en meubelontwikkeling, en in 2006 werd hun website een pagina die naar 20-20 verwijst. Alle AXEL merkproducten inclusief de plugin werden stopgezet.",
  "Platforms_BitPlayer_Description": "BitPlayer was een desktopapplicatie gebaseerd op Flash- en Shockwave-technologie, gemaakt in 1999 door het Nederlandse bedrijf BitMagic. Het bood dagelijkse korte filmpjes, intern en door klanten geproduceerd, die vergezeld gingen van advertenties en quizzen. Aanvankelijk werd het op $6 miljoen geschat, maar het werd het slachtoffer van de dot-com crash na de adverteerders en stopte met de productie in januari 2001. Veel van de inhoud heeft het sindsdien overleefd als geconverteerde SWF-bestanden, ondanks het verlies van de extra functionaliteit die de aangepaste speler bood.",
  "Platforms_Blender_Description": "Blender is een 3D-softwareprogramma dat in 1994 is gemaakt door de Nederlandse animatiestudio NeoGeo. De eerste versie werd uitgebracht in 1995. Het bedrijf werd in 1998 opgeheven, maar mede-eigenaar Ton Roosendaal richtte Not a Number Technologies (NaN) op om Blender verder te ontwikkelen. Versie 2.0, ook bekend als GameBlender, kwam uit in 2000 en was een verschuiving naar interactiviteit en spelontwikkeling. Daarom werd er in 2001 een browser plugin uitgebracht, beginnend als een open bèta, met een tweede bèta gelanceerd in januari 2002. Ondanks het vroege succes waren er financiële problemen en NaN werd begin 2002 gesloten. Roosendaal besloot toen om Blender open source te maken en slaagde hierin na crowdfunding om de aandelen terug te kopen van investeerders. Er werden pogingen gedaan om de ontwikkeling van de plugin voort te zetten, maar de overstap naar open source resulteerde in ontbrekende componenten voor de game engine; het herstel ervan had de hoogste prioriteit en de plugin werd in de wacht gezet. De laatste versie werd een paar jaar beschikbaar gehouden, met de mededeling dat er op dat moment geen ondersteuning voor was of plannen voor een nieuwe release, voordat deze in 2005 werd verwijderd.",
  "Platforms_Burster_Description": "Burster was een 2010 implementatie van de Blender Game Engine uit 2000. Het project was een poging om een officiële plugin die gelanceerd was met Blender nieuw leven in te blazen. Het verbeterde het origineel en maakte gebruik van nieuwere versies van de engine voor betere prestaties en graphics. De laatste versie werd gelanceerd in 2013 en na 3 jaar zonder updates werd Burster officieel stopgezet in 2016. De game engine zelf werd verwijderd uit Blender in 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin is een productiviteitstool gemaakt door Logic Pulse in 1996. Het was een nieuwe functie die werd toegevoegd aan versie 3.2 van Calendar Quick, een agenda- en planningsdesktoptoepassing. Het liet gebruikers hun agenda's publiceren met behulp van de exportfunctie in internetpagina's die gekoppeld konden worden aan andere mensen en bekeken konden worden met de plugin. Na het oplossen van een millenniumbug in 1999 werd de website verlaten zonder verdere updates en ging ten onder in 2001.",
  "Platforms_Cult3D_Description": "Cult3D was een webviewer voor 3D-inhoud die was gemaakt met het auteursprogramma Cult3D Designer. Het genoot een matig succes, met 6 miljoen gebruikers in 2001 en verschillende bekende klanten die het gebruikten, en er werden meer importopties voor 3D-modellen uit andere programma's toegevoegd. 5.3 was de laatste versie die werd uitgebracht in 2002 en de laatste update van de plugin was in 2004, toen de technologie werd verkocht aan Mental Images GmbH. Nvidia kocht Mental Images later in 2007 en werd de dochteronderneming Nvidia Advanced Rendering Center. Ondanks het updaten van de website, ontving de plugin geen updates en vanaf 2011 werd de plugin niet meer getoond als een levensvatbare optie. De downloadpagina werd in stand gehouden door gebruikers die nog steeds een auteurslicentie hadden en werd later in 2013 verwijderd.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion was een reeks AR (augmented reality) programma's die in 1999 door Total Immersion werden ontwikkeld en die gebruik maakten van videocamera's om 3D-objecten in realtime weer te geven. Een van die programma's was D'Fusion @Home, uitgebracht in 2008, met een plugin later in 2009. Toepassingen voor het programma werden gemaakt met behulp van het auteursprogramma D'Fusion Studio en het programma was vooral gericht op marketing en korte ervaringen. Tegen 2011 had de technologie moeite om wijdverspreid te worden. Zelfs met de toegankelijkere Flash-implementatie en het feit dat de auteurssoftware gratis werd, was de toepassing nog steeds erg beperkt. Na de opkomst van smartphones werd TryLive ontwikkeld als een andere AR-gebaseerde oplossing om eenvoudig producten zoals meubels en brillen te bekijken. Dit werd een succes, in tegenstelling tot de D'Fusion-lijn die na 2013 geen updates meer kreeg. In 2015 werd het bedrijf verkocht aan ACEP, een brillenbedrijf.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Nog geen beschrijving.",
  "Platforms_DPGraph_Description": "DPGraph (Dynamic Photorealistic Graphing) werd in 1999 gecreëerd door David Parker en is een uitvoerbaar programma dat grafieken van webpagina's weergeeft. Ze kunnen animeren en tot 8 dimensies weergeven, met controle over variabelen. Het werkte door een bestand op een webpagina te downloaden dat de browser vertelde om het programma uit te voeren en de grafieken weer te geven. Een volledige versie werd gelicentieerd aan verschillende onderwijsinstellingen voor gebruik in klaslokalen en studie om grafieken te maken, evenals een gratis speler om ze te bekijken. Het werd voor het laatst bijgewerkt in 2016, en in 2019 werd de volledige versie van DPGraph vrij te gebruiken door iedereen.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) was een animatie plugin uitgebracht door Sharp in 2001. Ontworpen met mobiele apparaten zoals telefoons en PDA's in het achterhoofd, werd het exclusief in Japan uitgebracht voor bepaalde telefoonmodellen en als browser plugin. Het was trots op zijn kleine bestandsgrootte en vectorafbeeldingen die op elk mobiel scherm pasten. De technologie werd in 2002 in de VS uitgebracht onder de naam SharpMotionART. Geen van beide duurde lang, want e-animator bracht zijn laatste update uit in 2003 en SharpMotionART werd stopgezet in 2004.",
  "Platforms_Envoy_Description": "Envoy was een documentindeling die in 1993 werd ontwikkeld door Tumbleweed Software, gemaakt door ze virtueel af te drukken in WordPerfect. Het was een concurrent voor Adobe Acrobat en zijn PDF-indeling. WordPerfect Corporation werd in 1994 verkocht aan Novell, waaronder Envoy, maar Tumbleweed bleef samenwerken met Novell en maakte in 1995 een webplugin om bestanden online te bekijken. Novell verkocht WordPerfect in 1996 aan Corel, maar behield het eigendom van Envoy. In 1999 stopte Novell met de ontwikkeling van Envoy en Corel beëindigde de ondersteuning voor Envoy vanaf WordPerfect 2000. Dit beëindigde de samenwerking die Tumbleweed had met Novell na de overname van Envoy in 1994, en de ondersteuning voor de plugin werd stopgezet.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) is een lichtgewicht animatie plugin ontwikkeld door Sharp in 1997. Er waren verschillende versies van de auteurssoftware gebundeld met Sharp computers en voor verschillende doelgroepen, waarvan de belangrijkste \"EVA Animator\" was. Een meer kindvriendelijke \"EVA Animator Kids\", met een エバキッズクラブ (EVA Kids Club) website werd gelanceerd in 2000. Deze werd in 2007 stopgezet en vervangen door een tussenniveau \"EVA Animator School II\". De laatste grote update van de plugin kwam in 2002 met een kleine verbetering in 2008, maar desondanks behield het een kleine gemeenschap van gebruikers, totdat Sharp de hoofdwebsite sloot in 2016.",
  "Platforms_Flatland_Rover_Description": "Rover is een 3D-plugin gebaseerd op de 3DML-taal die in 1997 werd ontwikkeld door Flatland. Gebruikers konden \"Spots\" maken met het Spotnik authoring programma, bestaande uit \"Levels\" met daarin \"Blocks\" om het ontwikkelen te vergemakkelijken, en deze uitvoeren met Rover, beschikbaar als een browser plugin en een standalone programma. De ontwikkeling was levendig tot de dot-com crash, toen het grootste deel van het team uit elkaar ging. De laatste update verscheen in 2005 en de website werd verlaten voordat deze in 2012 ten onder ging. Een van de voormalige ontwikkelaars, Michael Powers, besloot in 2014 om de website nieuw leven in te blazen, een archief van de software aan te leggen en deze bij te werken om op moderne systemen te draaien. De standalone Rover app werd herzien in 2017, maar de plugin keerde niet terug.",
  "Platforms_Formula_One_Description": "Nog geen beschrijving.",
  "Platforms_Fractal_Viewer_Description": "Nog geen beschrijving.",
  "Platforms_FreeHand_Description": "FreeHand was een creatieve suite voor vectorgrafieken uit 1988, gemaakt door Altsys Corporation. Macromedia kocht FreeHand in 1994 en bleef het ontwikkelen. In oktober 1996 werd FreeHand 7.0 gelanceerd met een plugin voor het web, Shockwave for FreeHand genaamd. De plugin maakte het mogelijk vectorafbeeldingen die door het programma waren gemaakt in een webpagina in te sluiten en te bekijken. In november 1996 kocht Macromedia FutureSplash, een andere plugin voor vectorafbeeldingen op het web, die werd omgedoopt tot Flash.  FreeHand 8.0 werd uitgebracht in 1998 en exporteerde nu naar Flash, in plaats van de FreeHand plugin. De laatste nieuwe versie van het programma, FreeHand MX, werd uitgebracht in 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "De GoBit Games Plugin is in 2008 gemaakt door GoBit, een kleine onafhankelijke studio bestaande uit voormalige PopCap-werknemers. Hun eerste spel, Burger Shop, werd uitgebracht in oktober 2007 en kreeg op veler verzoek 4 maanden later een webdemo met hun toen nieuwe Games Plugin. Er ging een jaar voorbij en de demo werd herwerkt tot een advergame voor Eggo, gepubliceerd door Shockwave.com op 1 februari 2009. De plugin werd kort daarna verlaten met de release van Burger Shop 2 - de bijbehorende webdemo die in plaats daarvan Flash gebruikte - waardoor Burger Shop en de reskin de enige spellen waren die er ooit voor werden gemaakt.",
  "Platforms_HotSauce_Description": "Een Meta Content Framework (MCF) was een formaat voor het structureren van metadata dat vanaf 1995 werd ontwikkeld door de Advanced Technology Group van Apple Computer. In 1996 werd Project X een experimentele plugin om ze op het internet te bekijken, later HotSauce genoemd, die sitemaps in een 3D-ruimte liet zien. Aan het einde van 1996 gebruikten meer dan 200 websites HotSauce, wat later uitgroeide tot 300+, en er werd een deal gesloten met NetCarta om een bibliotheek van meer dan 30.000 websites te creëren die met de plugin konden worden genavigeerd. Hoewel de MCF-standaard enige lof oogstte, zagen de meeste gebruikers geen voordeel in deze 3D-navigatiemethode en het project eindigde als een van de vele geannuleerde projecten toen Steve Jobs terugkwam bij Apple in 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage is een standaard voor het weergeven van documenten via een webbrowser. HTML werd oorspronkelijk ontwikkeld door Tim Berners-Lee in het begin van de jaren negentig (met wortels die teruggaan tot 1980) en werd de belangrijkste methode voor het delen van informatie via het internet. De mogelijkheden ervan werden uitgebreid door andere talen zoals CSS en JavaScript. HTML werd voor het eerst gelanceerd in 1993 en werd vervolgens bijgewerkt met HTML2 in 1995 en HTML3 en HTML4 in 1997. De laatste update voor HTML4 was in 2000 en in de jaren daarna werden de aan elkaar gekoppelde talen grotendeels genegeerd als platform voor games, animaties en andere webinhoud. Ontwikkelaars kozen in plaats daarvan voor op plugins gebaseerde technologie, maar naarmate de technologie en het internet zich ontwikkelden, begonnen plugins verouderd te raken, dus werd er een poging gedaan om de standaard bij te werken en in 2008 werd HTML5 gelanceerd. Omdat Flash en andere plugins uit de mode raakten en HTML5 de aanbevolen standaard werd, hebben veel mensen hun projecten overgezet naar de HTML-familie - of zijn helemaal afgestapt van propriëtaire plugins - en uploaden ze hun inhoud in plaats daarvan naar websites zoals YouTube. {Opmerking: Omwille van de beknoptheid bestempelt Flashpoint elk item dat geen frameworks of inhoud met plugins bevat als \"HTML\".}",
  "Platforms_HyperG_Description": "Hyper-G was een op Gopher gebaseerd Web Content Management System (WCMS), ontwikkeld door het Institute for Information Processing and Computer Supported New Media (IICM) van de Technische Universiteit van Graz, Oostenrijk in 1995. Het was een alternatief voor de Hyperlinks van het World Wide Web en maakte gebruik van Browsers met Hyper-G, die 3D-modellen van mappen en bestanden en andere modellen konden weergeven met een ingebouwde viewer. Omdat het gebaseerd was op het steeds meer verouderde Gopher, de voorloper van het WWW, evolueerde het later in 1996 naar Hyperwave, zonder de extra mogelijkheden die Hyper-G-browsers boden, zoals de 3D-functies. Het overgrote deel van de inhoud is nu verloren gegaan door de manier waarop de bestanden met Gopher werden opgeslagen.",
  "Platforms_Hypercosm_Player_Description": "Hypercosm, gebaseerd op technologie die al sinds 1989 in ontwikkeling is, is een 3D-content webspeler die in 1999 werd gelanceerd. Het bedrijf deed een flinke investering die zich niet terugbetaalde. Het was een van de vele slachtoffers van de dot-com crash en ging in 2001 failliet. Het bedrijf werd echter opgekocht door ORBITEC en dankzij een contract met NASA slaagde het bedrijf erin zich enigszins te herstellen en bleef het werken aan nieuwe projecten tot een herstructurering in 2012, toen het door ORBITEC in de wacht werd gezet totdat een nieuwe zakenpartner geïnteresseerd was in het werken met de technologie. Dat gebeurde nooit, waardoor Hypercosm in 2016 stopte.",
  "Platforms_Illuminatus_Description": "Nog geen beschrijving.",
  "Platforms_iPix_Description": "Nog geen beschrijving.",
  "Platforms_Java_Plugin_Description": "Java Applets, die samen met de programmeertaal Java werden uitgebracht als een van de functies, waren kleine toepassingsvensters die op pagina's waren ingebed voor extra interactieve functies. Ze waren gemaakt om compatibel te zijn met verschillende besturingssystemen en browsers en om krachtiger te zijn dan standaard HTML. Het bleef een capabele optie voor meer dan 10 jaar, maar vanaf 2013 begon de technologie die ten grondslag lag aan de Applets niet meer ondersteund te worden door de belangrijkste browsers, waardoor veel Applets onbruikbaar werden. Dit leidde ertoe dat ze in 2017 niet meer ondersteund werden en in 2018 verwijderd werden uit Java SE 11.",
  "Platforms_JCAMPDX_Description": "Nog geen beschrijving.",
  "Platforms_Lightning_Strike_Description": "Nog geen beschrijving.",
  "Platforms_LiveMath_Plugin_Description": "De LiveMath-plugin is een toepassing voor interactieve wiskunde, waarmee een venster wordt gemaakt dat notities, formules, grafieken en andere wiskundige functies kan bevatten, om in te sluiten op een webpagina. Het werd oorspronkelijk gelanceerd als Theorist in 1989 door Prescience Corporation en de webplugin werd gelanceerd in 1994. In 1997 werd het hernoemd naar MathView nadat het was gekocht door Waterloo Maple, voordat het werd gekocht door MathMonkeys en hernoemd werd naar LiveMath in 1999. In 2014 werd de plugin vanwege toenemende problemen en incompatibiliteit met de nieuwste browsers met pensioen gestuurd en vervangen door een standalone viewer met de naam LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Nog geen beschrijving.",
  "Platforms_MHSV_Description": "Het werd gelanceerd als een alpha genaamd VSV ({V}irtual {S}pace {V}iewer) en later hernoemd naar MHSV ({M}ultimedia {H}ome {S}pace {V}iewer). Het was een plugin ontwikkeld door ParaGraph die interactieve 3D-werelden mogelijk maakte met behulp van het VHSB ({V}irtual {H}ome {S}pace {B}uilder) authoring programma, dat zowel interactieve MHSV als standaard statische VRML-werelden kon maken. In 1996 voegde de ontwikkeling van de VRML 2.0-standaard interactiviteit toe en ParaGraph paste VHSB aan om het maken van VRML 2.0-werelden mogelijk te maken. ParaGraph besloot echter om samen te werken met Silicon Graphics en hun viewer Cosmo VRML 2.0-player en paste VHSB aan om er beter mee te kunnen werken. Silicon Graphics nam ParaGraph in 1997 over en creëerde Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Silverlight is ontwikkeld door Microsoft als antwoord op Flash en Java en werd gelanceerd in 2007. Het is een multimediatool die zich richt op het streamen van video's en wordt onder andere gebruikt door Netflix. Latere versies voegden meer mogelijkheden voor andere toepassingen toe. Het genoot een behoorlijke populariteit, met een adoptiegraad van 64,7% in 2011. In 2012 echter, met de aankondiging van het einde van NPAPI, de release van Windows 8 en het begin van de adoptie van HTML5, deprecieerde Microsoft de software. In 2015, met de release van Windows 10, kwam het End-of-Life en werd het stopgezet in oktober 2021.",
  "Platforms_NoteWorthy_Composer_Description": "Nog geen beschrijving.",
  "Platforms_O2C_Player_Description": "De o2c Player, onderdeel van de o2c (objects to see) lijn, was in 1999 een web 3D plugin voor het weergeven van objecten en scènes, ontwikkeld door het Duitse bedrijf mb Software AG. Het bedrijf verkocht de o2c-technologie in 2003 aan ELECO plc, die in 2005 versie 2.0 van de o2c Player ontwikkelde en lanceerde. Deze versie bracht veel betere prestaties met 3D-versnelling en werd meer als CAD-tool voor architecten gebruikt. Er werd ondersteuning voor meer browsers toegevoegd, maar er werden geen grote updates uitgevoerd. Vanaf 2021 is de plugin nog steeds beschikbaar om te downloaden, maar Elcosoft is overgestapt op een Unity WebGL implementatie van de technologie.",
  "Platforms_Octree_View_Description": "Begonnen als een oudere plugin met de naam PicTree Viewer of PicView, daarna herontwikkeld als de nieuwe Fastview plugin voordat het in 1999 een andere naam kreeg, is Octree View een 3D-objectviewer gebaseerd op Voxel-technologie die minstens sinds 1980 in ontwikkeling is en die gebruik maakt van speciale camera's en laserscanners om afbeeldingen te maken. Het bedrijf bleef gebruik maken van hun technologie en van de plugin, maar in 2007 werd hun website niet meer bijgewerkt, waardoor er verder geen activiteit meer was.",
  "Platforms_Pixound_Description": "Pixound was een artistieke muziekplugin die in 1996 werd gelanceerd als een joint venture van Hologramophone Research en Frankfurt Balkind Partners. Het fungeerde als een MIDI-keyboard dat de kleurwaarden van afbeeldingen gebruikte om verschillende noten en toonhoogtes te produceren. In 2003 veranderde Hologramophone zijn naam in Techné Media. In 2005 werd de plugin verwijderd ten gunste van een standalone applicatie die uitsluitend voor Mac OS X werd gebruikt. Later werd het een iOS-app in 2011.",
  "Platforms_Play3D_DeepV_Description": "Play3D was een 3D plugin die in 1996 werd uitgebracht door Heads Off. Het jaar daarop werd de plugin omgedoopt tot DeepV. Afgezien van een handvol voorbeelden, werd de plugin tijdens zijn leven weinig gebruikt. De website van de ontwikkelaar ging ten onder in 2001.",
  "Platforms_PointPlus_Description": "PointPlus was een plugin voor het insluiten van PowerPoint presentaties op het web, ontwikkeld door Net-Scene en uitgebracht in mei 1996 voor Windows NT en 95. Het positioneerde zichzelf als alternatief voor het complexere Macromedia Shockwave. Het positioneerde zichzelf als een alternatief voor het meer complexe Macromedia Shockwave, voor gebruikers op instapniveau om de PowerPoint standaard te gebruiken. Tegen november was er een Java viewer ontwikkeld die platformoverschrijdend compatibel was en geen plugins nodig had. Het bleef een optie voor gespecialiseerde gevallen, maar de productlijn kreeg in 1997 geen updates meer. De website werd begin 2001 gesloten.",
  "Platforms_PopCap_Plugin_Description": "De PopCap-plugin was een plugin om de gamedemo's van ontwikkelaar PopCap te laten zien. In het begin gebruikte het bedrijf Java voor zijn online speldemo's vanwege de toegankelijkheid. Later werd de ontwikkeling echter verlegd naar een in-house plugin die beschikbaar was als ActiveX-besturingselement en een traditionele Firefox-plugin. Dit gaf PopCap het voordeel van een eigen platform voor demodistributie. Het ondergebruik ervan door zowel klanten als PopCap zelf leidde er echter toe dat de ontwikkelaar in 2007 overstapte op het populairdere Flash.",
  "Platforms_ProtoPlay_Description": "ProtoPlay was een plugin bedoeld om prototypes voor consumenteninteractie met producten en een simulatie van hun functies te laten zien. Het werd uitgebracht in 1996 en maakte gebruik van het Altia Design authoring programma om toepassingen te maken, bestaande uit 2D sprites met interactieve elementen. De plugin was meer utilitair van aard en er werd niet actief reclame voor gemaakt vanaf eind 2003. Altia Design en de plugin bleven updates krijgen om de functionaliteit te verbeteren en in 2007 werd er een nieuw hulpprogramma uitgebracht waarmee je plugin-apps kon maken in Photoshop, PhotoProto genaamd. In 2009 verlegde Altia Inc. de focus naar het ontwerpen van gebruikersinterfaces, waardoor het prototyping-aspect van de software, en daarmee ProtoPlay, achterbleef.",
  "Platforms_Pulse_Player_Description": "Pulse Player begon zijn ontwikkeling in 1997 onder de naam 3rd Degree en was een 3D-plugin met de nadruk op animatie. Het werd voor het eerst uitgebracht in 1999 met financiering en steun van verschillende ervaren leden op het gebied van internetmedia, en werd gebruikt door verschillende opmerkelijke klanten. De plugin werd op de markt gebracht als een leuk en creatief mediaplatform en leek succesvol te zijn, maar begin 2001 was er een verschuiving in wat het bedrijf wilde nastreven en werd de Player geherpositioneerd als een meer serieuze zakelijke en educatieve tool. In 2003 was 5.2 de laatste versie die werd gelanceerd en kort daarna werd de ondersteuning stopgezet.",
  "Platforms_REBOL_Plugin_Description": "REBOL is een programmeertaal die al meer dan 20 jaar wordt ontworpen en in 1997 werd uitgebracht. In 2004 werd een experimenteel prototype voor een REBOL-webplugin gemaakt, samen met een pagina met verschillende voorbeelden. De plugin begon als ActiveX voor alleen Internet Explorer, maar later in 2006 werd een pluginversie voor andere browsers uitgebracht. Kort daarna werd echter de laatste update gedaan, waardoor het in een bèta bleef als een onveilig prototype.",
  "Platforms_ShiVa_Web_Player_Description": "ShiVa Web Player werd gemaakt door Stonetrip en heette vóór 2007 Ston3D Web Player. Het was een plugin voor 3D-webinhoud om software te draaien die was gemaakt in de ShiVa 3D Engine. Het maakte complexe 3D-scènes met belichting en fysica mogelijk, terwijl het lage verwerkingsvereisten had. Stonetrip hernoemde zichzelf later in 2013 naar ShiVa Technologies SAS en richtte zich uitsluitend op de engine. Met de verwijdering van NPAPI uit de meeste browsers, verminderde de ondersteuning voor de plugin, wat ertoe leidde dat de URL's van verschillende kernbestanden in 2018 naar beneden gingen en de meeste spellen kapotmaakten, en in 2019 werd de download verwijderd van de website van ShiVa.",
  "Platforms_Show_It_Description": "Show It! was een plugin die in 1997 werd geïntroduceerd met WordPerfect Suite 8 als een van de functies van Corel Presentations 8, een PowerPoint-concurrent. Bij het exporteren met de Internet Publisher optie, konden ze de presentaties exporteren als een statische afbeelding slideshow, of als een ingesloten projector met behulp van een eigen bestand dat net zo functioneerde als de originele desktop app, met behoud van alle functies, waarvoor de plugin nodig was. De plugin bleef ondersteund in WordPerfect Office 2000 met Presentations 9, maar in 2001 werd de ondersteuning voor de plugin-optie verwijderd uit Presentations 10 in WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Nog geen beschrijving.",
  "Platforms_Squeak_Etoys_Description": "Squeak was een open source platform, gelanceerd in 2001, voor het maken van entertainment en educatieve content. Gebruikers konden kleine applicaties maken voor kinderen van verschillende leeftijdsgroepen, van de jongste, genaamd \"Etoys\", tot \"Omniuser\" en \"Expert\". Het werd in 2008 omgedoopt tot Etoys en richtte zich meer op jongere kinderen. Etoys 5 was de laatste versie van de plugin, uitgebracht in 2012. De ontwikkeling van een JavaScript-versie van het programma begon in 2013 na bezorgdheid over de beveiliging, waardoor de plugin werd verlaten en vervangen.",
  "Platforms_Superscape_Viscape_Description": "Viscape werd in 1996 gelanceerd door Superscape, een pionier op het gebied van 3D, met ondersteuning van Intel. Het heette oorspronkelijk VisNet en was een 3D-plug-in die, in tegenstelling tot de statische modellen van VRML 1.0, het duidelijke voordeel had dat het interactief was met werelden. Het genoot een korte periode van populariteit en aanvankelijk waren er geen plannen om VRML te ondersteunen, maar toen VRML97 interactiviteit implementeerde, werd in 1998 een update met de naam Viscape Universal uitgebracht, waarmee VRML-ondersteuning werd toegevoegd om relevant te blijven. Dit bleek niet voldoende te zijn, met financiële problemen en mislukte partnerschappen, en recensenten die de plug-in ondanks hun pogingen tot een revival verouderd en omslachtig noemden. Hoewel de laatste update in 2000 werd uitgebracht, werd de technologie het jaar daarop nog steeds gebruikt in de Lego Creator-serie van Superscape. Er werd een poging gedaan om het te updaten door de plug-in in Java-applets in te bedden, genaamd Vislite, maar uiteindelijk richtte het bedrijf zich opnieuw op de ontwikkeling van mobiele games en boekte het matig succes voordat het in 2008 werd gekocht door Glu Mobile.",
  "Platforms_Surround_Video_Description": "Nog geen beschrijving.",
  "Platforms_SVF_Viewer_Description": "Nog geen beschrijving.",
  "Platforms_Tcl_Plugin_Description": "Tool Command Language (Tcl, uitgesproken als \"kietelen\"), ontwikkeld door een klein team en gelanceerd in 1988, is een open source dynamische programmeertaal. In 1994 haalde Sun Microsystems het team binnen om de technologie verder te ontwikkelen. Een van de resultaten van deze onderneming was een plugin uit 1996 die Tcl-applets (\"Tclets\") ingebed in pagina's kon uitvoeren. Eind 1997 werd de ontwikkeling van Tcl ondergebracht in een onafhankelijk bedrijf genaamd Scriptics en in 2000 werd het weer ondergebracht in het Tcl Core Team. Hoewel de ontwikkeling van de taal tot op de dag van vandaag levendig blijft, is het werk aan de plugin vertraagd ondanks het feit dat het niet officieel stopgezet is. De laatste versie, 3.1.0, werd uitgebracht in 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer was een multimedia plugin uit 1997 gemaakt door Parable Corporation, die later in 1998 van naam veranderde in ThingWorld. Het maakte \"dingen\", activa die optioneel konden worden beschermd tegen stelen of knoeien en een unieke ID met krediet hadden om te delen op websites, met behulp van eenvoudige modulaire programmering, om dingen te maken zoals afbeeldingen, animaties en zelfs interactieve spellen, gemaakt met behulp van het ThingMaker authoring programma of het converteren van Shockwave Director bestanden met behulp van ThingConverter. Het was relatief populair en kreeg zelfs deals met Microsoft en verschillende anderen in 1999, maar eind 2000 verminderde het bedrijf zijn personeelsbestand en was het in gesprek met een onbekende partij voor een fusie om de technologie te verkopen. De website werd in 2002 gesloten.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine is een cross-platform game engine die als doel had om gameontwikkeling toegankelijker te maken, en is de populairste third-party software voor gameontwikkeling onder ontwikkelaars wereldwijd. Unity Web Player werd naast Unity zelf gemaakt en geïmplementeerd in de eerste patch in 2005. Het was een hulpmiddel om Unity-games op het web te spelen. Het bleef een populair platform voor 3D-games, maar met de verwijdering van NPAPI-ondersteuning in 2016 werd de plugin verwijderd ten gunste van Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap was een hulpmiddel om interactieve kaarten te visualiseren die in een webpagina waren ingebed. Het was compatibel met verschillende kaartbestanden van verschillende auteursprogramma's, kon gedetailleerde informatie over sectoren weergeven en bood de mogelijkheid om metingen uit te voeren. Na de lancering in 1997 werden er geen ontwikkelingen meer gedaan met de technologie, die hetzelfde bleef tot de pagina in 2004 uit de lucht ging.",
  "Platforms_Vitalize_Description": "Vitalize! werd in 1997 gemaakt door Corel voor het weergeven van inhoud die was gemaakt met hun Click&Create multimedia authoring programma. Het was een plugin met een lage bandbreedte die was gewijd aan eenvoudige webgames met de nadruk op gaming, marketing en reclame. Het werd gedistribueerd met de hulp van Europress en was er trots op dat het \"makkelijk te leren en te gebruiken was, in tegenstelling tot Java of Shockwave\" Ergens in 1999 verlieten de voormalige Corel-medewerkers het bedrijf om Clickteam op te richten, dat in 2000 de ontwikkeling overnam met versie 2.0. De laatste versie 4.0 werd uitgebracht in 2007/2008 en was beschikbaar op hun website tot 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage is een open 3D-standaard en de allereerste die voor het web werd gemaakt. Toen het voor het eerst werd gespecificeerd in november 1994, kon het formaat alleen statische modellen zonder interactiviteit weergeven. Dit probleem werd opgelost in 1997 toen versie 2.0, beter bekend als VRML97, werd gepubliceerd. Hoewel VRML nooit algemeen werd gebruikt, werd het na de lancering de populairste optie voor 3D op internet, voordat het in 2001 werd verdrongen door X3D (dat achterwaarts compatibel was met VRML-werelden). Omdat het een bestandsindeling was en geen plugin op zichzelf, zijn er veel verschillende implementaties van VRML gemaakt, die vaak hun eigen niet-standaard functies toevoegden.",
  "Platforms_X3D_Description": "Nog geen beschrijving.",
  "Platforms_Xara_Plugin_Description": "De Xara Plugin was een viewer voor vectorafbeeldingen, die gebruik maakte van een eigen indeling met lage bandbreedte. Het lanceerde een bèta en later een volledige release in 1996, waarmee Flare-bestanden gemaakt met CORELXara op het web konden worden bekeken. Later in 1997 werd Xara Webster gelanceerd om specifiek de webafbeeldingen voor de plugin te maken. In 1999 was 2.08a de laatste versie die werd uitgebracht. In 2000 werd Xara Webster vervangen door XaraX, dat kon exporteren naar Flash, een andere vector-plugin, dus de ondersteuning voor hun eigen optie werd geschrapt en het werd verbannen naar het archief met oudere software.",
  "Platforms_Coming_Soon": "Binnenkort beschikbaar",
  "Platforms_Coming_Soon_Description": "Games en animaties die op deze platforms zijn gemaakt, zullen in de volgende update beschikbaar zijn.",
  "Platforms_Common_Ground_Description": "Nog geen beschrijving.",
  "Platforms_DjVu_Description": "Nog geen beschrijving.",
  "Platforms_Jamagic_Description": "Nog geen beschrijving.",
  "Platforms_Jutvision_Description": "Nog geen beschrijving.",
  "Platforms_mBed_Description": "Nog geen beschrijving.",
  "Platforms_MrSID_Description": "Nog geen beschrijving.",
  "Platforms_PanoramIX_Description": "Nog geen beschrijving.",
  "Platforms_Petz_Player_Description": "Nog geen beschrijving.",
  "Platforms_Sibelius_Scorch_Description": "Nog geen beschrijving.",
  "Platforms_Sizzler_Description": "Nog geen beschrijving.",
  "Platforms_Ulead_COOL_360_Description": "Nog geen beschrijving.",
  "Platforms_VReam_WIRL_Description": "Nog geen beschrijving."
}
