{
  "FAQ_Title": "Perguntas frequentes",
  "FAQ_Question1": "Isso não costumava se chamar BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Sim - o projeto era utilizado para operar com BlueMaxima no nome até à sua retirada do projeto em janeiro de 2023.",
  "FAQ_Question2": "Quais sistemas operacionais você suporta?",
  "FAQ_Answer2": "O Flashpoint suporta Windows 8.1 e mais recente (excluindo Windows 8 padrão). As versões do MacOS e do Linux também estão disponíveis; no entanto, eles exigem passos adicionais para a instalação e só podem executar algumas das tecnologias de navegador mais populares.",
  "FAQ_Question3": "O Flashpoint apresenta algumas preocupações de segurança?",
  "FAQ_Answer3": "Não que nós saibamos. A totalidade da nossa suíte de aplicativos (menos a tecnologia de download de jogos da Infinity) não pode se conectar à internet aberta; quaisquer alterações de registro feitas pelo Flashpoint Secure Player são removidas quando o jogo é fechado; todas as curadorias recebidas são passadas através de um PC com software antivírus competente e atualizado; e, mais importante, o lançador e todo o funcionamento interno do Flashpoint {são grátis e de código-aberto}. Nós fizemos o possível para garantir que a coleção seja a mais segura possível, mas apesar de nossos esforços certos antivírus como a Avast e AVG tendem a detectar componentes importantes como perigosos. Se você é afetado por esta questão, {leia essa pagina} para instruções de solução de problemas.",
  "FAQ_Question4": "Quantos jogos/animações possui?",
  "FAQ_Answer4": "Flashpoint atualmente oferece mais de {} jogos e {} animações. Você pode pesquisar a coleção sem baixar Flashpoint {aqui}.",
  "FAQ_Question5": "Quais plataformas de navegador o Flashpoint preserva?",
  "FAQ_Answer5": "Conservamos jogos e animações em execução em todas as plataformas listadas no Flashpoint Database {statistics page}.",
  "FAQ_Question6": "Onde estão os jogos da Nitrome?",
  "FAQ_Answer6": "Nitrome gentilmente pediu-nos em remover o conteúdo deles da coleção. Se você está olhando para jogar os jogos deles, então faça no {Website} deles, e se for Flash não é uma opção, siga o {Catalogo de compativeis HTML5} {Flashpoint não tolera xingamento em cima da decisão da Nitrome}",
  "FAQ_Question7": "Como posso solicitar um jogo/animação?",
  "FAQ_Answer7": "Você pode fazer uma solicitação por primeiro ler {esse artigo} até o fim, então siga os links em baixo.",
  "FAQ_Question8": "Posso eu mesmo adicionar um jogo/animação?",
  "FAQ_Answer8": "Sim! Siga as instruções listadas no {tutorial de curação} para configurar o seu público de curadores. Assim que for aceito, você poderá submeter o máximo de curadorias que desejar.",
  "FAQ_Question9": "Quero contribuir de outra forma (codificação, testes, etc). Como posso ajudar?",
  "FAQ_Answer9": "Junte-se ao nosso {servidor do discord} para mais detalhes. A maioria das nossas comunicações e trabalho acontece lá.",
  "FAQ_Question10": "O Flashpoint é de código-aberto?",
  "FAQ_Answer10": "Parcialmente. As fontes para a nossa tecnologia personalizada, como o launcher estão todas disponíveis em nosso {GitHub}. As fontes do software que incluímos no Flashpoint estão disponíveis a partir de seus respectivos sites (nós não modificamos a fonte de nenhum dos softwares que incluímos). Os binários para os próprios plugins da web não são de código aberto, mas se eles fossem, nós não estaríamos aqui para começar.",
  "FAQ_Question11": "Posso usar o logo/está disponível sob Creative Commons?",
  "FAQ_Answer11": "Sim - o logotipo está sob a licença {CC-BY 4.0}. Para atribuição, você pode opcionalmente creditar Seirade e o Flashpoint. Arquivos de origem podem ser encontrados {aqui}.",
  "FAQ_Question12": "Onde posso doar para o projeto?",
  "FAQ_Answer12": "Flashpoint Archive opera como uma coleção sem fins lucrativos. Você pode encontrar mais detalhes sobre como doar e onde seu dinheiro vai em nossa {Open Collective page}.",
  "FAQ_Question13": "Flashpoint não está funcionando corretamente!",
  "FAQ_Answer13": "Siga as etapas de resolução de problemas listadas no {manual}. Se você ainda estiver com problemas, peça ajuda em nosso Discord.",
  "FAQ_Question14": "Quero que um jogo/animação seja removido do Flashpoint por uma ou outra razão.",
  "FAQ_Answer14": "Alerte-nos, seja através do nosso Discord ou {e-mail direto}. Nós provavelmente tentaremos convencê-lo a deixar-nos manter seu jogo por razões históricas, mas não somos irrazoáveis.",
  "FAQ_Question15": "Eu tenho outra pergunta.",
  "FAQ_Answer15": "Consulte o nosso {extended FAQ}. Se sua pergunta não foi respondida lá, entre em nosso Discord."
}
