{
  "News_Title": "Notícias",
  "News_Para1": "Todos os eventos notáveis na história do Flashpoint a partir de outubro de 2019. Passe o mouse sobre o codinome de uma versão para obter uma explicação de BlueMaxima, o fundador do projeto.",
  "News_Para2": "Um changelog englobando todas as versões lançadas antes da mudança para o sistema baseado em componentes pode ser achado {aqui}. Para downloads diretos de outras versões antigas do Flashpoint Ultimate, consulte as contas de Internet Archive do BlueMaxima e Dri0m's {aqui} e {aqui} respectivamente.",
  "News_Flashpoint_Started": "BlueMaxima's Flashpoint foi iniciado.",
  "News_Flashpoint_0": "Flashpoint Zero foi lançado.",
  "News_Flashpoint_1": "Versão um do Flashpoint foi lançada.",
  "News_Was_Released": "foi lançado",
  "News_Flashpoint_3_0": "Chaves para o Reino",
  "News_Flashpoint_3_0_Meta": "Esta versão introduziu o Redirecionador, a última peça do quebra-cabeças de fazer a configuração do servidor funcionar - permitindo-nos a preservar 99.9% em jogos de Flash sem hacking. As chaves para o reino da preservação Flash, se quiser.",
  "News_Flashpoint_3_1": "Abertura noturna",
  "News_Flashpoint_3_1_Meta": "Esta versão foi a primeira a ter o Flashpoint Theatre (embora fosse uma instância separada do LaunchBox na época).",
  "News_Flashpoint_3_2": "Choque e pavor",
  "News_Flashpoint_3_2_Meta": "Esta versão foi a primeira a suportar títulos em Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Nomeado após o fato de termos passado 4.000 jogos na coleção neste ponto. Amigo, como o tempo voa.",
  "News_Flashpoint_4_0": "O Infinito Vivo",
  "News_Flashpoint_4_0_Meta": "Esta versão introduziu o Flashpoint Infinity, que permite que as pessoas façam ‘streaming’ de jogos da ‘internet’. O nome é retirado do álbum de Soilwork em 2013 com o mesmo nome.",
  "News_Flashpoint_4_1": "Javalidade",
  "News_Flashpoint_4_1_Meta": "Esta é a versão que introduziu o suporte para applets Java. DarkMoe veio com o nome.",
  "News_Flashpoint_5_0": "Vá para o lançamento",
  "News_Flashpoint_5_0_Meta": "O Lançador que todos conhecemos e amamos foi introduzido nesta versão.",
  "News_Flashpoint_5_1": "O Grande Filtro",
  "News_Flashpoint_5_1_Meta": "As playlists foram adicionadas aqui (um filtro, se quiser). O nome é retirado do episódio de Mesarthim, O Grande filtro.",
  "News_Flashpoint_5_2": "Tipo III",
  "News_Flashpoint_5_2_Meta": "The Great Filter e Type III são dois episódios do Mesarthim que costumam ser agrupados. Nenhum outro nome surgiu quando precisávamos dele.",
  "News_Flashpoint_5_3": "Revolução",
  "News_Flashpoint_5_3_Meta": "Esta versão foi lançada perto do aniversário de 1 ano de Flashpoint, e nós sentimos ser realmente uma revolução. (originalmente também se chamava 'Orbit', mas era um nome bobo para o conceito.)",
  "News_Flashpoint_5_4": "Recombinação",
  "News_Flashpoint_5_4_Meta": "Esta versão moveu as animações com jogos, que anteriormente estavam em pastas separadas com clientes separados. \"Recombination\" e \"74%\" também por acaso eram o nome de duas faixas no álbum de Mesarthim, The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Um conjunto rápido de correções feitos junto ao tempo de upload do 5.4. Não era como se o Flashpoint 5.4 estivesse apenas 74% concluído.",
  "News_Flashpoint_5_5": "Ferro & Cobre",
  "News_Flashpoint_5_5_Meta": "BlueMaxima estava jogando Deus Ex um pouco demais na época.",
  "News_Flashpoint_6_0": "Alinhamento",
  "News_Flashpoint_6_0_Meta": "Outra referência á Mesarthim!",
  "News_Flashpoint_6_1": "Preservagrama",
  "News_Flashpoint_6_1_Meta": "Uma peça em termos de software comumente utilizados na tecnologia, como \"freeware\" e \"shareware\".",
  "News_Flashpoint_6_2": "Grande fuga de Moe",
  "News_Flashpoint_6_2_Meta": "O membro da equipe DarkMoe curou uma quantidade verdadeiramente louca de jogos de escape-the-room, nesta versão.",
  "News_Flashpoint_6_3": "Falamos sobre os jogos de Flash, não falamos da filosofia abstrata",
  "News_Flashpoint_6_3_Meta": "Nomeado após uma fala improvisada de nosamu, um membro da equipe.",
  "News_Old_Releases_Title": "Linha Temporal Retroativa de Lançamentos",
  "News_Old_Releases_Description": "Devido a uma coluna de notícias somente ter existido desde dezembro de 2019, a maioria dos lançamentos até esse ponto não foi catalogada. Esta seção conta para as versões que faltam.",
  "News_Is_Available": "está disponível agora!",
  "News_Grab_Download": "Pegue-o no {downloads page}",
  "News_Flashpoint_Update_October_2019": "A atualização de status do Flashpoint para abril de 2019 esta disponível no medium. veja {aqui}.",
  "News_Flashpoint_Update_November_2019": "A atualização de status do Flashpoint para novembro de 2019 esta disponível no medium. veja {aqui}.",
  "News_Flashpoint_7_0": "Oito Milhares de Horas",
  "News_Flashpoint_7_0_Meta": "Oito mil horas era próximo do quanto o Flash tinha que viver durante o tempo do lançamento.",
  "News_Flashpoint_7_1": "Permaneça no alvo",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0, segundo nossos padrões, saiu uma bagunça. 7.1 foi um grande lançamento de correção de erros.",
  "News_Featured_Kotaku_Link": "Fomos destacados no Kotaku!",
  "News_Featured_Kotaku_Rest": "Este é um marco enorme. Obrigado a todos pelo apoio!",
  "News_Flashpoint_Update_March_2020": "A atualização de status do Flashpoint para março de 2020 esta disponível no medium. veja {aqui}.",
  "News_Flashpoint_Update_April_2020": "A atualização de status do Flashpoint para Abril de 2020 esta disponível no medium. veja {aqui}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Esta versão viu o final do Redirector software, usado anteriormente para fazer o servidor funcionar. O Código HTTP 301 é 'movido permanentemente', como nele, já não redirecionando.",
  "News_Flashpoint_Update_June_2020": "A pequena atualização de status do Flashpoint para abril de 2020 foi lançada hoje. veja {aqui}.",
  "News_Flashpoint_8_1": "Espírito da Aventura",
  "News_Flashpoint_8_1_Meta": "Nomeado após uma fala do álbum recente de Aether Realm, Redneck Vikings from Hell. Para ser específico, a faixa 'One Hollow Word'.",
  "News_Flashpoint_Update_August_2020": "A atualização de status do Flashpoint para abril de 2020 foi lançada hoje. veja {aqui}.",
  "News_Flashpoint_8_2": "Aproximando-se do Planeta nove",
  "News_Flashpoint_8_2_Meta": "O (stretched, I'll grant you) Aglutinação de 'aproximando da versão nove', e o Planet Nine, o episódio de Mesarthim.",
  "News_Flashpoint_9_0": "Pôr-do-Sol Glorioso",
  "News_Flashpoint_9_0_Meta": "Nomeado após a Glorious Morning, uma canção muito conhecida por estar em Age of war. Esta foi a última versão á lançar antes da morte de Flash, por isso o \"pôr-do-sol”.",
  "News_Flashpoint_Update_April_2021": "A atualização de status do Flashpoint para abril de 2021 foi lançada hoje. Veja {aqui}.",
  "News_Flashpoint_10_0": "Absência",
  "News_Flashpoint_10_0_Meta": "Esta é a primeira versão a liberar para uma internet pós-Flash, daí o nome \"Absente\". Houve que também era o nome da última via no episódio \"Vacuum Solution\" de Mesarthim.",
  "News_Flashpoint_10_1": "Absência II",
  "News_Flashpoint_10_1_Meta": "Continue, acho.",
  "News_Flashpoint_11": "Oops, Todos os Plugins!",
  "News_Flashpoint_11_Meta": "É um meme, porque 11 adicionou três dúzias de plugins novos.",
  "News_Flashpoint_11_1": "Operação cerejeira",
  "News_Flashpoint_11_1_Meta": "Uma referência ao jogo Muv-Luv (compre-o na Steam).",
  "News_Flashpoint_12": "Axolote",
  "News_Flashpoint_12_meta": "Eles são bonitinhos e legais."
}