{
  "Platforms_Title": "Plataformas suportadas",
  "Platforms_Description1": "Flashpoint suporta jogos e animações criadas para uma variedade de plugins e padrões - não apenas o Flash. Esta página contém uma visão geral do histórico de cada tecnologia até a versão 11. Estatísticas atualizadas sobre a contagem de entrada de cada plataforma podem ser vistas no {Flashpoint Database}.",
  "Platforms_Description2": "Isso serve como um \"Quem? Quando? O quê?\" resumo, e ponto de partida para mais pesquisas, não é uma história abrangente de cada plataforma. Nós tentamos o nosso melhor para apresentar fatos precisos, mas ainda são possíveis erros. Por favor, contate-nos com informações relevantes para correções.",
  "Platforms_By": "por",
  "Platforms_3D_Groove_GX_Description": "Fundada em 1998, a Groove Alliance foi o desenvolvedor do 3D Groove SX, um motor de jogos 3D de Shockwave habilitado. Mais tarde, em 2002, o motor sairia da Shockwave e iria até à sua própria coisa chamada 3D Groove GX. Ambas as variações podem ser usadas para o desenvolvimento de jogos online e de aplicações para desktop. Isto provou ser um sucesso para a empresa, Aproximando-se de uma grande base de usuários corporativos e levando à criação de vários títulos de alto perfil para programas de TV e outras grandes propriedades. Depois de a tendencia ter acabado, a Groove Alliance foi retransformada em OTOY em 2008, mas o site do Groove 3D permaneceu online até 2009. A causa exata do desaparecimento da empresa original é desconhecida, mas foram confirmadas lutas internas.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (antes conhecido como 3D Life Player, Virtools Player, e NeMo Web Player, não confundir com o 3DVIA Studio/Beta Player ou 3DVIA Composer Player) era um plugin de navegador da Dassault Systèmes para a reprodução de criações 3D feitas no Virtools. Foi desenvolvido pensando em práticas avançadas com elementos 3D, como por exemplo treinamentos baseados em computador, turismo virtual e visitação de imóveis. 3DVIA Player era usado também para jogos de navegador, tendo como um de seus primeiros usuários neste quesito um estúdio de jogos localizado em Quebeque, Sarbakan, também como um em Amsterdã. Little Chicken Game Company. Sua última atualização, versão 5.0, foi lançada em 2009. A página de download se mateve ativa pelos próximos anos, até ser tirada do ar em 2016. Até então, já tinha sido baixado 30 milhões de vezes.",
  "Platforms_AboutPeople_Description": "Nenhuma descrição ainda.",
  "Platforms_AboutTime_Description": "Nenhuma descrição ainda.",
  "Platforms_ActiveX_Controls_Description": "Lançado em 1996 pela Microsoft, ActiveX foi um 'framework' de ‘software’ que servia de base e permitia encapsular programas como 'containers' para o uso em outros aplicativos não relacionados, chamados ActiveX Controls. Eles podiam ser integrados em conteúdo HTML, e Controls de propósito único podiam ser criados especificamente para o uso no Internet Explorer, com o objetivo de reproduzir jogos de navegador. Após o lançamento do Edge em 2015, o 'software' foi descontinuado, e o seu uso para aplicativos de navegador foram aparentemente cessados, permanecendo apenas no Internet Explorer 11 para fins de suporte à 'software' legado.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Iniciando o desenvolvimento em 1996 como V30 pela Rocket Science Games, depois transferido para a Attitude Software e sendo renomeado 3D Anarchy, e então depois vendido para a Adobe em 2000 e renomeado em 2001, Atmosphere Player é um plugin de navegador feito para visualizar mundos 3D interativos, similar ao padrão do VRML, criado no Atmosphere Builder. Foi projetado focado principalmente em galerias de mídia virtual, cujas podiam mostrar imagens/áudio/vídeo e os próprios modelos 3D em questão. Quando inicialmente ainda era 3D Anarchy, o 'software' ainda estava em Beta quando a Adobe adquiriu a tecnologia para um desenvolvimento futuro, passando os próximos 3 anos em 'beta testing', o lançamento da última versão, 1.0, do 'Player' foi lançada em Fevereiro de 2004. Em Dezembro de 2004 foi anunciado que o Atmosphere seria descontinuado, com seu suporte sendo finalizado em Janeiro de 2005.",
  "Platforms_Adobe_Flash_Player_Description": "O Adobe Flash Player (também só Flash, anteriormente Macromedia Shockwave Flash Player) é um reprodutor para animações e gráficos vetoriais, muitas vezes com interatividade adicionada. Ele foi usado como meio para webgames devido à compressão eficaz, baixo preço, a facilidade de uso e a uma grande base de instalação. Desenvolvido em 1995 e introduzido pela primeira vez pelo FutureWave em 1996, pouco mais foi capaz do que animações e botões básicos para as controlar. À medida que ganhou popularidade, recursos mais avançados foram adicionados ao jogador, como a linguagem de programação ActionScript. No entanto, à medida que as pessoas desconfiadas das suas potenciais preocupações de segurança cresceu, e o HTML5 aumentou a popularidade entre os desenvolvedores da web, Adobe anunciou a data final da vida do Flash, em 31 de dezembro de 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (também Shockwave, anteriormente Macromedia Shockwave Player ou Shockwave Director Player) é um reprodutor de mídia interativa lançado em 1995. Construído com tecnologia em desevolvimento á 10 anos antes pela MacroMind, tornou-se um plugin da web apenas após a sua aquisição pela Macromedia. Ao contrário do Flash, a Shockwave destacou a linguagem de script Lingo e o suporte C++ através do uso de Xtras, dando ao player uma ampla gama de recursos, incluindo 3D. observou o uso generalizado na Internet inicial e em jogos de CD-ROM, e ganhou popularidade convencional. A plataforma viu uma diminuição significativa na popularidade após a aquisição de Macromedia de Adobe a favor do Flash, que estava em rápida expansão em termos de recursos e agora pertencia também a Adobe. Finalmente em fevereiro de 2019, Adobe anunciou sua descontinuação e cortou o suporte dois meses depois.",
  "Platforms_Alambik_Plugin_Description": "O Alambik Plugin é um reprodutor de navegador para conteúdos feitos com a Alambik, uma plataforma de desenvolvimento. Lançado em 2001, ele suportava gráficos 2D e 3D, vetores e muitas outras aplicações. Em 2002. Alambik fez um concurso com prêmios para celebrar o lançamento do Alambik Script. Em 2004, Alambik criou um novo site de demonstrações, mas depois disso a empresa nunca mais se pronunciou e nem lançou nada novo para a plataforma, nem atualizou o plugin.",
  "Platforms_Ambulant_Description": "Ambulant é um reprodutor de arquivos SMIL, desenvolvido por diversas pessoas coordenando da CWI em Amsterdã, Holanda. O nome parece referenciar \"ambulação\", outra palavra para caminhar; essa ideia é reforçada pela logo que aparenta ser uma pessoa caminhando. SMIL era uma especificação feita pela W3C, o consórcio internacional da web, mas falhou em conseguir popularidade. Ambulant tentou ser um reprodutor de código aberto que suporta todos arquivos SMIL. Porém, o desejo em fazer com que todas suas partes terem o código aberto impediu eles de suportar alguns formatos de mídia próprios. Desenvolvimento iniciou em Abril de 2003 e sua primeira versão, \"AMBULANT/G\" goi lançado em Julho do mesmo ano. A última versão estável, 2.6, foi lançada em Fevereiro de 2015, porém o trabalho em uma versão instável do Ambulant, 2.7, continou até Julho de 2016, quando sua última contribuição em seu Github foi feita. Os desenvolvedores do Ambulant ainda estão ativos nos seus projetos.",
  "Platforms_AnimaFlex_Description": "AnimaFlex foi um plugin de reprodução gráfico que podia reproduzir animações com um tamanho de arquivo pequeno, feito com RubberWeb Composer, que podia esticar e distorcer imagens. Ele conseguia reproduzir animações antes de todo o arquivo ser baixado e se ajustar a conexões de 'internet' mais lentas. Apesar de suas promessas, RubberFlex em si tinha diversos outros produtos, todos exportando gifs, competindo com a sua própria opção, e ainda lançaram o FlexToGif para converter arquivos Plugin em gifs 2 dias depois do plugin. No início de 1998, a RubberWeb Composer cessou sua distribuição, deixando o AnimaFlex sem um programa de autoria.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics era um programa de apresentações criado em 1986 pela Software Publishing Corporation (SPC) para computadores MS-DOS. Depois da transição deles para o Windows em 1991, o programa falhou em re-conquistar divulgação do mercado que antes tinha e acabou perdendo para o PowerPoint. Em 1996 a Allegro New Media (renomeada para Vizacom depois naquele mesmo ano) comprou SPC e Serif. SCP criou o ASAP WordPower, um programa para criar apresentações em slide facilmente, que podiam ser publicados na web usando o plugin ASAP WebShow. SPC se fundiu com Serif em 1997. 1988 viu a marca de Harvard revitalizada com seu programa de autoria Harvard Graphics 98, e o plugin foi reposto por um novo chamado Harvar Graphic WebShow. Em 2000, Advanced Presentations, a nova versão do programa autoral, foi exportado para o padrão Flash invés do formato de plugin próprio. Vizacom vendeu Serif de volta para sua gerência original em 2001, que rebaixou o acervo de Harvard para software legado, tendo suporte e sendo vendido até então ser descontinuado em 2017.",
  "Platforms_Authorware_Web_Player_Description": "O Authorware Web Player foi criado pela Macromedia em 1996 como uma das novas funcionalidades do Authorware 3.5. Foi desenvolvido como uma maneira de executar programas interativos desenvolvidos com o Macromedia Authorware na web. Ao contrário da maioria dos plugins web, o principal propósito do Authorware era auxiliar no e-learning, levando ao seu uso em empresas e no campo acadêmico como uma forma de montar materiais de aprendizagem multimídia sem a necessidade de experiência em programação. A versão final do plugin foi lançada em 2004, antes da aquisição da Macromedia pela Adobe em 2005, após a qual o desenvolvimento estagnou até o anúncio de sua descontinuação em 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Nenhuma descrição ainda.",
  "Platforms_AXEL_Player_Description": "O AXEL Player era um plugin interativo de conteúdo 3D criado pela MindAvenue em 2002. Era uma forma para modelos e animações no programa de autoria web AXELedge e no AXELpublisher, que convertia arquivos de outros softwares 3D como o 3ds Max. O software foi bem recebido pelos críticos, apesar de algumas limitações, uma delas sendo a falta de muitos usuários para o Plugin. Em 2005, a MindAvenue foi adquirida pela 20-20 Technologies, especializada em software de design de interiores e desenvolvimento de móveis, e em 2006 seu site se tornou uma página direcionando para a 20-20. Todos os produtos da marca AXEL, incluindo o plugin, foram descontinuados.",
  "Platforms_BitPlayer_Description": "O BitPlayer era uma aplicação de desktop baseada em tecnologia Flash e Shockwave, criada em 1999 pela empresa holandesa BitMagic. Ele oferecia curtas diários, produzidos internamente e por clientes, acompanhados por anúncios e testes. Inicialmente avaliado em $6 milhões, foi vítima da queda das empresas ponto-com seguida da saída de seus anunciantes e cessou sua produção em janeiro de 2001. Grande parte de seu conteúdo sobreviveu como arquivos SWF convertidos, apesar de ter perdido a funcionalidade adicional que o player personalizado oferecia.",
  "Platforms_Blender_Description": "O Blender é uma ferramenta de software 3D criada em 1994 pelo estúdio de animação holandês NeoGeo. Sua primeira versão foi lançada em 1995. A empresa foi dissolvida em 1998, mas o co-proprietário Ton Roosendaal criou a Not a Number Technologies (NaN) para continuar o desenvolvimento do Blender. A versão 2.0, também conhecida como GameBlender, foi lançada em 2000 e marcou uma mudança em direção à interatividade e ao desenvolvimento de jogos. Por causa disso, um plugin para navegador foi lançado em 2001, começando como um beta aberto, com um segundo beta lançado em janeiro de 2002. Apesar do sucesso inicial, houve problemas financeiros e a NaN fechou as portas no início de 2002. Roosendaal então decidiu tornar o Blender de código aberto e teve sucesso após financiamento coletivo para recomprar as ações dos investidores. Foram feitas tentativas para continuar o desenvolvimento do plugin, mas a mudança para código aberto resultou em componentes ausentes para o motor de jogos; sua restauração era a principal prioridade e o plugin foi colocado em espera. A última versão ficou disponível por alguns anos — declarando que não havia suporte para ela ou planos para um novo lançamento na época — antes de ser removida em 2005.",
  "Platforms_Burster_Description": "O Burster foi uma implementação de 2010 da Blender Game Engine de 2000. O projeto foi uma tentativa de reviver um plugin oficial lançado com o Blender, que foi descontinuado devido a preocupações com segurança. Ele melhorou o original, aproveitando as versões mais recentes do motor para melhor desempenho e gráficos. A última versão foi lançada em 2013, e após 3 anos sem atualizações, o Burster foi oficialmente descontinuado em 2016. O próprio motor de jogo foi removido do Blender em 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "O Calendar Quick Plugin é uma ferramenta de produtividade feita pela Logic Pulse em 1996. Era uma nova funcionalidade adicionada à versão 3.2 do Calendar Quick, uma aplicação de desktop para calendário e agendamento. Ele permitia que os usuários os publicassem usando a função de exportação em páginas da internet que podiam ser vinculadas a outras pessoas e visualizadas com o plugin. Depois de corrigir um bug do Y2K em 1999, o site foi deixado abandonado sem mais atualizações e saiu do ar em 2001.",
  "Platforms_Cult3D_Description": "O Cult3D era um visualizador web para conteúdo 3D feito usando o programa de autoria Cult3D Designer. Ele desfrutou de sucesso moderado, com 6 milhões de usuários até 2001 e diversos clientes notáveis usando-o, além de mais opções de importação para modelos 3D de outros programas sendo adicionadas. A versão 5.3 foi a última lançada em 2002, com a última atualização do plugin sendo em 2004, quando a tecnologia foi vendida para a Mental Images GmbH. Mais tarde, a Nvidia comprou a Mental Images em 2007, tornando-se a subsidiária Nvidia Advanced Rendering Center. Apesar da atualização do site, o plugin não recebeu mais atualizações e a partir de 2011, deixou de ser apresentado como uma opção viável, e a página de downloads foi mantida para usuários que ainda tinham uma licença de autoria, sendo posteriormente retirada do ar em 2013.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion foi uma linha de programas de AR (realidade aumentada) que iniciou seu desenvolvimento em 1999 pela Total Immersion e que utilizava câmeras de vídeo para exibir objetos 3D em tempo real. Um desses programas foi o D'Fusion @Home, lançado em 2008, com um plugin posterior em 2009. Aplicações para ele eram criadas usando o programa de autoria, o D'Fusion Studio, e seu foco principal estava em marketing e experiências curtas. Até 2011, a tecnologia enfrentava dificuldades para alcançar uma aprovalçao generalizada. Mesmo com a implementação mais acessível do Flash e o software de autoria se tornando gratuito, sua aprovação ainda era muito limitada. Com o surgimento dos smartphones, o TryLive foi desenvolvido como outra solução baseada em AR para visualização fácil de produtos como móveis e óculos, o que se tornou bem-sucedido, ao contrário da linha D'Fusion, que não recebeu mais atualizações após 2013. Em 2015, a empresa foi vendida para a ACEP, uma empresa de óculos.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Nenhuma descrição ainda.",
  "Platforms_DPGraph_Description": "Criado em 1999 por David Parker, o DPGraph (Gráficos Fotorealistas Dinâmicos) é um programa executável dedicado a exibir gráficos a partir de páginas da web. Eles podem ser animados e mostrar até 8 dimensões, com controle de variáveis. Funcionava baixando um arquivo em uma página da web que instruía o navegador a executar o programa e renderizar os gráficos. Uma versão completa foi licenciada para várias instituições de ensino para uso em salas de aula e estudos para criar gráficos, além de um reprodutor gratuito para visualizá-los. Ele foi atualizado pela última vez em 2016 e, em 2019, a versão completa do DPGraph tornou-se gratuita para uso por qualquer pessoa.",
  "Platforms_E_Animator_SharpMotionART_Description": "O E-アニメータ (e-animator) foi um plugin de animação lançado pela Sharp em 2001. Projetado com dispositivos móveis como telefones e PDAs em mente, foi lançado exclusivamente para modelos de telefone selecionados no Japão, além de um plugin de navegador. Orgulhava-se de seu pequeno tamanho de arquivo e gráficos vetoriais que se adequavam a qualquer tela móvel. A tecnologia foi lançada para o público dos EUA em 2002 sob o nome de SharpMotionART. Nenhum dos dois durou muito, pois o e-animator lançou sua última atualização em 2003 e o SharpMotionART foi descontinuado em 2004.",
  "Platforms_Envoy_Description": "Envoy foi um formato de documento desenvolvido em 1993 pela Tumbleweed Software, criado virtualmente imprimindo-os no WordPerfect. Foi um concorrente do Adobe Acrobat e seu formato PDF. A WordPerfect Corporation foi vendida para a Novell em 1994, o que incluía o Envoy, mas a Tumbleweed continuou trabalhando com a Novell, criando um plugin web em 1995 para visualizar arquivos online. A Novell vendeu o WordPerfect para a Corel em 1996, mas manteve a propriedade do Envoy. Em 1999, a Novell parou de desenvolver o Envoy, e a Corel retirou o suporte ao Envoy do WordPerfect 2000. Isso encerrou a colaboração que a Tumbleweed tinha com a Novell após a aquisição do Envoy em 1994, e o suporte para o plugin foi abandonado.",
  "Platforms_EVA_Description": "O EVA ({E}xtended {V}ector {A}nimation) é um plugin de animação leve desenvolvido pela Sharp em 1997. Ele teve várias versões do software de autoria incluídas em computadores da Sharp e para diferentes públicos, sendo a principal o \"EVA Animator\". Uma versão mais amigável para crianças, chamada \"EVA Animator Kids\", com um site エバキッズクラブ (EVA Kids Club), foi lançada em 2000. Essas versões foram descontinuadas em 2007 e substituídas por uma versão intermediária chamada \"EVA Animator School II\". A última grande atualização do plugin ocorreu em 2002, com um pequeno ajuste em 2008, mas apesar disso, manteve uma pequena comunidade de usuários, até que a Sharp encerrou o site principal em 2016.",
  "Platforms_Flatland_Rover_Description": "Rover é um plugin 3D baseado na línguagem 3DML desenvolvida em 1997 pela Flatland. Usuários poderiam criar \"Spots\" com o programa de autoria do Spotnik, feito de \"Níveis\" contendo \"Blocos\" para facilitar o desenvolvimento, e executa-los com o Rover, disponível como um plugin de navegador e um programa independente. O desenvolvimento estava ativo até a queda do dot-com, quando a maioria da equipe foi dissolvida, com a última atualização lançada em 2005, e o website foi abandonado antes de desativado em 2012. Um dos antigos desenvolvedores, Michael Powers, decidiu em 2014 reviver o site, criando um arquivo do software e atualizá-lo para ser executado em sistemas modernos. O aplicativo autonomo do Rover foi revisado em 2017, porem o plugin não retornou.",
  "Platforms_Formula_One_Description": "Nenhuma descrição ainda.",
  "Platforms_Fractal_Viewer_Description": "Nenhuma descrição ainda.",
  "Platforms_FreeHand_Description": "O FreeHand era uma suíte de criação de gráficos vetoriais criada pela Altsys Corporation em 1988. A Macromedia comprou o FreeHand em 1994 e continuou desenvolvendo-o. Em outubro de 1996, o FreeHand 7.0 foi lançado com um plugin para a web, chamado Shockwave for FreeHand. O plugin permitia que imagens vetoriais criadas pelo programa fossem incorporadas e visualizadas em uma página da web. Em novembro de 1996, a Macromedia comprou o FutureSplash, outro plugin de gráficos vetoriais para web, que foi renomeado para Flash. O FreeHand 8.0 foi lançado em 1998 e agora exportava para Flash, em vez do plugin do FreeHand. A última nova versão do programa, FreeHand MX, foi lançada em 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "O Plugin de Jogos GoBit foi criado em 2008 pela GoBit, um pequeno estúdio independente composto por ex-funcionários da PopCap. Seu primeiro jogo, Burger Shop, foi lançado em outubro de 2007 e, por demanda popular, recebeu uma demonstração web 4 meses depois usando seu então novo Plugin de Jogos. Um ano se passou e a demonstração foi retrabalhada como um advergame para Eggo, publicado pela Shockwave.com em 1º de fevereiro de 2009. O plugin foi abandonado pouco depois, com o lançamento de Burger Shop 2 - sua respectiva demonstração web usando Flash em vez disso - deixando Burger Shop e sua repaginação como os únicos jogos já criados para ele.",
  "Platforms_HotSauce_Description": "O Meta Content Framework (MCF) foi um formato de estruturação de metadados desenvolvido pelo Advanced Technology Group da Apple Computer a partir de 1995, e em 1996 o Projeto X se tornaria um plugin experimental criado para visualizá-los na internet, posteriormente chamado de HotSauce, que mostrava mapas de sites em um espaço 3D. No final de 1996, mais de 200 sites usavam o HotSauce, que mais tarde cresceu para mais de 300, e um acordo com a NetCarta foi feito para criar uma biblioteca de mais de 30.000 sites para navegar usando o plugin. Embora o padrão MCF tenha recebido algum elogio, a maioria dos usuários não viu vantagem neste método de navegação em 3D, e o projeto acabou sendo um dos muitos cancelados quando Steve Jobs retornou à Apple em 1997.",
  "Platforms_HTML_HTML5_Description": "o {H}yper{T}ext {M}arkup {L}anguage é um padrão para visualização de documentos por um navegador web. Originalmente desenvolvido por Tim Berners-Lee durante o começo dos anos 1990s (com traços indo desde 1980,) HTML se tornou o método primário de divulgação de informações pela Internet, com as capacidades sendo expandidas por outras linguagens como CSS e JavaScript. Inicialmente lançado em 1993, e recebendo atualizações subsequentes como HTML2 em 1995, HTML3 e também HTML4 em 1997. A última atualização do HTML4 foi em 2000, e nos anos seguintes as linguagens conjuntas foram ignorados na maioria como uma plataforma de jogos, animações ou outros conteudos web, com os desenvolvedores escolhendo por tecnologias baseadas em plugins, mas como a tecnologia e a internet evoluiram, os plugins começaram a se tornar desatualizados, e um esforço foi feito para atualizar o padrão, então em 2008 HTML5 foi lançado. enquanto Flash e outros plugins perderam espaço, HTML5 se tornou o padrão recomendado, e muitos mudaram seus projetos para a família HTML - ou abandonou plugins proprietários como um todo - passaram a enviar o seu conteudo para sites como o YouTube. {Nota: por razões de brevidade, o Flashpoint identifica qualquer entrada que não contém frameworks ou qualquer conteudo habilitado para plugins como \"HTML\"}",
  "Platforms_HyperG_Description": "O Hyper-G era um Sistema de Gerenciamento de Conteúdo Web (WCMS) baseado em Gopher, desenvolvido pelo Instituto de Processamento de Informações e Novas Mídias Computadorizadas (IICM) da Universidade de Tecnologia de Graz, na Áustria, em 1995. Era uma alternativa aos Hiperlinks da World Wide Web, usando Navegadores Habilitados para Hyper-G, que podiam exibir modelos 3D de diretórios e arquivos, além de outros modelos, com um visualizador incorporado. Devido a sua base no cada vez mais obsoleto Gopher, predecessor da WWW, mais tarde evoluiu para Hyperwave em 1996, sem as capacidades adicionais oferecidas pelos navegadores Hyper-G, como as funções 3D. A grande maioria de seu conteúdo está perdida agora devido à forma como os arquivos foram armazenados com Gopher.",
  "Platforms_Hypercosm_Player_Description": "Baseada em tecnologia em desenvolvimento desde 1989, a Hypercosm é um reprodutor web de conteúdo 3D que foi lançado em 1999. A empresa fez um investimento robusto que não se pagou, sendo uma das muitas vítimas da bolha das empresas de tecnologia, encerrando suas atividades em 2001. No entanto, a empresa foi comprada pela ORBITEC e, graças a um contrato com a NASA, conseguiu se recuperar em parte e continuou trabalhando em novos projetos até uma reestruturação em 2012, quando foi temporariamente colocada em espera pela ORBITEC até que um novo parceiro comercial estivesse interessado em trabalhar com a tecnologia. Isso nunca aconteceu, levando ao encerramento da Hypercosm em 2016.",
  "Platforms_Illuminatus_Description": "Nenhuma descrição ainda.",
  "Platforms_iPix_Description": "Nenhuma descrição ainda.",
  "Platforms_Java_Plugin_Description": "Lançado ao lado da linguagem de programação Java como uma das suas funções, os Java Applets eram pequenas aplicações de janela incorporadas em páginas para recursos extra interativos. Eles foram feitos para serem compatíveis em diferentes sistemas operacionais e navegadores, além de serem mais poderosos do que HTML padrão. Continuou a ser uma opção hábil por mais de 10 anos, mas no começo em 2013 a tecnologia subjacente aos Applets começou a não ser suportada em grandes navegadores, com muitos se tornarem inutilizáveis, levando a que eles sejam depreciados em 2017 e removidos do Java SE 11 em 2018.",
  "Platforms_JCAMPDX_Description": "Nenhuma descrição ainda.",
  "Platforms_Lightning_Strike_Description": "Nenhuma descrição ainda.",
  "Platforms_LiveMath_Plugin_Description": "O plugin LiveMath é uma aplicação para matemática interativa, criando uma janela que poderia conter notas, fórmulas, gráficos e outras funções matemáticas, para ser incorporada em uma página web. Originalmente lançado como Theorist em 1989 pela Prescience Corporation, com o plugin web sendo lançado em 1994, ele foi então renomeado para MathView em 1997 após ser adquirido pela Waterloo Maple, antes de ser comprado pela MathMonkeys e renomeado para LiveMath em 1999. Em 2014, com problemas crescentes e incompatibilidade com os navegadores mais recentes, o plugin foi descontinuado, sendo substituído por um visualizador independente chamado LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Nenhuma descrição ainda.",
  "Platforms_MHSV_Description": "Lançado como um alpha chamado VSV ({V}irtual {S}pace {V}iewer) e posteriormente renomeado para MHSV ({M}ultimídia {H}ome {S}pace {V}iewer), era um plugin desenvolvido pela ParaGraph que permitia mundos 3D interativos feitos usando o programa de autoria VHSB ({V}irtual {H}ome {S}pace {B}uilder), que poderia criar tanto MHSV interativos quanto mundos estáticos padrão VRML. Em 1996, o desenvolvimento do padrão VRML 2.0 adicionou interatividade, e a ParaGraph atualizou o VHSB para permitir a criação de mundos VRML 2.0, mas a ParaGraph decidiu trabalhar com a Silicon Graphics e seu reprodutor Cosmo VRML 2.0, adaptando o VHSB para funcionar melhor com ele, abandonando o MHSV no processo. A Silicon Graphics adquiriu a ParaGraph em 1997 para criar o Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Desenvolvido pela Microsoft como resposta ao Flash e Java, e lançado em 2007, o Silverlight é uma ferramenta multimídia focada em streaming de vídeo, conhecida por ser utilizada pela Netflix. Versões posteriores adicionaram mais capacidades para outras aplicações. Ele desfrutou de uma quantidade razoável de popularidade, com uma taxa de adoção de 64,7% em 2011. No entanto, em 2012, com o anúncio do fim do NPAPI, o lançamento do Windows 8 e o início da adoção do HTML5, a Microsoft descontinuou o software e, em 2015, com o lançamento do Windows 10, ele entrou em Fim de Vida, sendo descontinuado em outubro de 2021.",
  "Platforms_NoteWorthy_Composer_Description": "Nenhuma descrição ainda.",
  "Platforms_O2C_Player_Description": "Parte da linha o2c (objects to see), o o2c Player foi um plugin web 3D de 1999 para mostrar objetos e cenas, desenvolvido pela empresa alemã mb Software AG. A empresa vendeu a tecnologia o2c para a ELECO plc em 2003, que desenvolveu e lançou em 2005 a Versão 2.0 do o2c Player, trazendo um desempenho muito melhor com aceleração 3D, e foi mais marcado como uma ferramenta CAD para arquitetos. O suporte para mais navegadores foi adicionado, mas não foram feitas grandes atualizações, consistindo principalmente em correções de bugs. Até 2021, o plugin ainda está disponível para download, mas a Elcosoft mudou para uma implementação Unity WebGL da tecnologia.",
  "Platforms_Octree_View_Description": "Começando como um plugin mais antigo chamado PicTree Viewer ou PicView, depois redesenvolvido como o novo plugin Fastview antes de ser renomeado em 1999, o Octree View é um visualizador de objetos 3D baseado na tecnologia Voxel em desenvolvimento desde pelo menos 1980, que faz uso de câmeras especiais e scanners a laser para criar imagens. A empresa continuou a usar sua tecnologia e o plugin, mas em 2007, seu site parou de ser atualizado, deixando-o online sem mais atividade.",
  "Platforms_Pixound_Description": "O Pixound era um plugin de música artística, lançado em 1996 como uma joint venture entre Hologramophone Research e Frankfurt Balkind Partners. Ele atuava como um teclado MIDI que usava os valores de cor de imagens para produzir diferentes notas e tons. Em 2003, a Hologramophone mudou seu nome para Techné Media. Em 2005, o plugin foi abandonado em favor de um aplicativo independente exclusivo para Mac OS X. Mais tarde, em 2011, ele se tornou um aplicativo iOS.",
  "Platforms_Play3D_DeepV_Description": "O Play3D era um plugin 3D lançado em 1996 pela Heads Off, apenas para ser renomeado e relançado no ano seguinte como DeepV. Além de alguns exemplos, o plugin teve pouco uso ao longo de sua vida útil. O site do desenvolvedor saiu do ar em 2001.",
  "Platforms_PointPlus_Description": "O PointPlus era um plugin para incorporar apresentações do PowerPoint na web, desenvolvido pela Net-Scene e lançado em maio de 1996 para Windows NT e 95. Ele se posicionava como uma alternativa ao mais complexo Macromedia Shockwave, para usuários iniciantes utilizarem o padrão do PowerPoint. Em novembro, um visualizador Java foi desenvolvido que era compatível com várias plataformas e não exigia nenhum plugin. Ele foi mantido como uma opção para casos especializados, mas a linha de produtos parou de receber atualizações em 1997. O site foi encerrado no início de 2001.",
  "Platforms_PopCap_Plugin_Description": "O Plugin PopCap foi um plugin para mostrar demonstrações de jogos criados pela desenvolvedora PopCap. No começo da história, a empresa usou Java para seus demos online devido a sua acessibilidade. Depois, no entanto, o desenvolvimento foi passado para um plugin feito internamente que estava disponível como um controle ActiveX e um plugin tradicional do Firefox. isso deu para PopCap o benefício de ter sua própría plataforma para distribuição de demonstração. Porém, sua falta de utilização tanto pelos clientes quanto pela própria PopCap levaram os desenvolvedores mudarem para a plataforma mais popular, Flash em 2007.",
  "Platforms_ProtoPlay_Description": "O ProtoPlay era um plugin destinado a mostrar protótipos para a interação do consumidor com produtos e uma simulação de suas características. Lançado em 1996, ele fazia uso do programa de autoria Altia Design para criar aplicativos, compostos por sprites 2D com elementos interativos. O plugin tinha uma natureza mais utilitária e não era anunciado ativamente a partir do final de 2003, existindo mais como um recurso disponível se necessário. O Altia Design e o plugin continuaram recebendo atualizações para melhorar a funcionalidade e, em 2007, uma nova ferramenta que permitia ao Photoshop criar aplicativos de plugin chamada PhotoProto foi lançada. Em 2009, a Altia Inc. mudou seu foco para o design de interfaces de usuário, deixando para trás o aspecto de prototipagem do software, e com ele, o ProtoPlay.",
  "Platforms_Pulse_Player_Description": "Iniciando o desenvolvimento em 1997 sob o nome de 3rd Degree, o Pulse Player era um plugin 3D com foco em animação. Ele foi lançado pela primeira vez em 1999 com financiamento e apoio de vários membros experientes no campo da mídia na internet, e foi usado por diversos clientes notáveis. O plugin foi comercializado como uma plataforma de mídia divertida e criativa, e aparentemente foi bem-sucedido, mas no início de 2001 houve uma mudança no que a empresa queria perseguir, rebrandando o Player como uma ferramenta mais séria para negócios e educação. Em 2003, a versão 5.2 foi a última lançada, e pouco depois o suporte foi encerrado.",
  "Platforms_REBOL_Plugin_Description": "REBOL é uma linguagem de programação projetada ao longo de mais de 20 anos e lançada em 1997. Em 2004, um protótipo experimental para um plugin web REBOL foi criado, junto com uma página contendo vários exemplos. O plugin começou como ActiveX apenas para o Internet Explorer, mas posteriormente, em 2006, uma versão do plugin para outros navegadores foi lançada. No entanto, logo após isso, a última atualização foi feita, deixando-o em estado beta como um protótipo não seguro.",
  "Platforms_ShiVa_Web_Player_Description": "Criado pela Stonetrip e inicialmente chamado de Ston3D Web Player antes de 2007, o ShiVa Web Player era um plugin de conteúdo web 3D para executar software feito na Engine ShiVa 3D. Ele permitia cenas 3D complexas com iluminação e física, enquanto tinha requisitos de processamento baixos. A Stonetrip posteriormente renomeou-se em 2013 para ShiVa Technologies SAS e concentrou-se exclusivamente na engine. Com a remoção do NPAPI da maioria dos navegadores, o suporte para o plugin diminuiu, levando ao desligamento das URLs de vários arquivos principais em 2018 e interrompendo a maioria dos jogos, e em 2019 o download foi removido do site da ShiVa.",
  "Platforms_Show_It_Description": "O Show It! era um plugin introduzido em 1997 com o WordPerfect Suite 8 como um dos recursos do Corel Presentations 8, um concorrente do PowerPoint. Ao exportar com a opção Internet Publisher, os usuários podiam exportar as apresentações como um slideshow de imagens estáticas ou como um projetor incorporado usando um arquivo proprietário que funcionava exatamente como o aplicativo desktop original, preservando todos os recursos, o que exigia o plugin. Ele continuou a ser suportado no WordPerfect Office 2000 com o Presentations 9, mas em 2001, o suporte para a opção de plugin foi removido do Presentations 10 no WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Nenhuma descrição ainda.",
  "Platforms_Squeak_Etoys_Description": "O Squeak era uma plataforma de código aberto, lançada em 2001, para criar conteúdo de entretenimento e educacional. Os usuários podiam criar pequenas aplicações destinadas a crianças de diferentes faixas etárias, desde as mais jovens, chamadas \"Etoys\", até \"Omniuser\" e \"Expert\". Ele foi renomeado para Etoys em 2008 e se voltou mais para crianças mais novas. O Etoys 5 foi a última versão do plugin, lançada em 2012. O desenvolvimento de uma versão JavaScript do programa começou em 2013 após preocupações com segurança, deixando o plugin abandonado e substituído por ele.",
  "Platforms_Superscape_Viscape_Description": "Lançado em 1996 pelo pioneiro inicial em 3D Superscape com o apoio da Intel, e originalmente chamado VisNet, o Viscape era um plugin 3D que tinha a vantagem distinta de interatividade com mundos, ao contrário dos modelos estáticos do VRML 1.0. Ele desfrutou de um breve período de popularidade, e inicialmente não havia planos para suportar o VRML, mas com o VRML97 implementando interatividade, uma atualização chamada Viscape Universal foi lançada em 1998, adicionando suporte ao VRML para permanecer relevante. Isso provou não ser suficiente, com problemas financeiros e parcerias fracassadas, e os revisores chamando o plugin de desatualizado e difícil de usar, apesar de seus esforços para uma revitalização. Embora a última atualização tenha sido lançada em 2000, sua tecnologia continuou a ser utilizada na série Lego Creator da Superscape no ano seguinte. Uma tentativa foi feita para atualizá-lo incorporando o plugin dentro de Applets Java, chamado Vislite, mas no final a empresa então se concentrou no desenvolvimento de jogos para dispositivos móveis e obteve um sucesso moderado antes de ser adquirida pela Glu Mobile em 2008.",
  "Platforms_Surround_Video_Description": "Nenhuma descrição ainda.",
  "Platforms_SVF_Viewer_Description": "Nenhuma descrição ainda.",
  "Platforms_Tcl_Plugin_Description": "Desenvolvida por uma pequena equipe e lançada em 1988, a Linguagem de Comando de Ferramentas (Tcl, pronunciada \"tickle\") é uma linguagem de programação dinâmica de código aberto. Em 1994, a Sun Microsystems contratou a equipe para desenvolver a tecnologia ainda mais. Um dos resultados dessa empreitada foi um plugin de 1996 que podia executar applets Tcl (\"Tclets\") incorporados em páginas. No final de 1997, o desenvolvimento do Tcl foi separado para uma empresa independente chamada Scriptics, e separado novamente para a Equipe Principal do Tcl em 2000. Embora o desenvolvimento da linguagem permaneça ativo até hoje, o trabalho no plugin diminuiu drasticamente, apesar de não ter sido oficialmente descontinuado. A versão mais recente, 3.1.0, foi lançada em 2006.",
  "Platforms_ThingViewer_Description": "O ThingViewer foi um plugin multimídia de 1997 feito pela Parable Corporation, que posteriormente mudou de nome para ThingWorld em 1998. Ele criava \"Things\", ativos que podiam ser protegidos contra roubo ou adulteração e tinham um ID único com crédito para compartilhar em websites, usando programação modular simples, para criar imagens, animações e até mesmo jogos interativos, feitos usando o programa de autoria ThingMaker ou convertendo arquivos do Shockwave Director usando o ThingConverter. Ele era relativamente popular, conseguindo até acordos com a Microsoft e vários outros em 1999, mas no final de 2000, a empresa reduziu sua equipe e estava em negociações com uma parte desconhecida para uma fusão para vender a tecnologia. O site foi encerrado em 2002.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine é um motor de jogos multiplataforma que pretendia tornar o desenvolvimento de jogos mais acessível, e é o software mais popular de desenvolvimento de jogos de terceiros entre os desenvolvedores do mundo. Criado ao lado do próprio Unity e implementado no primeiro patch em 2005, a Unity Web Player foi uma ferramenta para jogar jogos Unity na web. Ele permaneceu uma plataforma popular para jogos 3D, mas com a remoção do suporte ao NPAPI em 2016, o plugin foi abandonado em favor da Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "O Visual WebMap era uma ferramenta para visualizar mapas interativos incorporados em uma página da web. Era compatível com vários arquivos de mapas de diferentes programas de autoria, podia exibir informações detalhadas sobre setores e permitia fazer medições. Após o seu lançamento em 1997, não foram feitos mais desenvolvimentos com a tecnologia, permanecendo a mesma até que a página saiu do ar em 2004.",
  "Platforms_Vitalize_Description": "Criado em 1997 pela Corel para exibir conteúdo feito com seu programa de autoria multimídia Click&Create, o Vitalize! era um plugin de baixa largura de banda dedicado a jogos web simples com ênfase em jogos, marketing e publicidade. Distribuído com a ajuda da Europress, ele se orgulhava de ser \"fácil de aprender e usar, ao contrário do Java ou Shockwave\". Em algum momento de 1999, os ex-funcionários da Corel saíram para criar a Clickteam, que assumiu o desenvolvimento em 2000 com a versão 2.0. A versão mais recente, 4.0, foi lançada em 2007/2008 e estava disponível em seu site até 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage é um padrão 3D aberto e o primeiro criado para a web. Quando, em Novembro de 1994, o formato era apenas um modelo estático sem interactividade. Este problema foi resolvido em 1997 quando a versão 2.0, mais conhecida como VRML97, foi publicada. Apesar de nunca haver um uso convecional, ela se tornaria a opção mais popular para 3D baseado na internet no seu lançamento antes de ser ultrapassada em 2001 pelo X3D (que era retrospectivamente compatível com mundos em VRML). Como era um formato de arquivo e não um plugin em si mesmo, muitas implementações diferentes foram feitas de VRML, muitas vezes adicionando seus próprios recursos não padrão.",
  "Platforms_X3D_Description": "Nenhuma descrição ainda.",
  "Platforms_Xara_Plugin_Description": "O plugin Xara era um visualizador gráfico vetorial, usando um formato proprietário de baixa largura de banda. Lançando uma versão beta e, mais tarde, uma versão completa em 1996, podendo ver arquivos Flare feitos com o CORELXara na web. Mais tarde, em 1997, Xara Webster foi lançado para tornar especificamente os gráficos da web para o plugin. Em 1999, 2,08a foi a última versão lançada. Em 2000, Xara Webster foi substituído por XaraX que poderia exportar para Flash, outro plugin vetorial, Assim, foi deixado de apoiar a sua própria opção proprietária, que foi relegada para um arquivo de software legado.",
  "Platforms_Coming_Soon": "Em Breve",
  "Platforms_Coming_Soon_Description": "Jogos e animações criadas nessas plataformas estarão disponíveis na próxima atualização.",
  "Platforms_Common_Ground_Description": "Nenhuma descrição ainda.",
  "Platforms_DjVu_Description": "Nenhuma descrição ainda.",
  "Platforms_Jamagic_Description": "Nenhuma descrição ainda.",
  "Platforms_Jutvision_Description": "Nenhuma descrição ainda.",
  "Platforms_mBed_Description": "Nenhuma descrição ainda.",
  "Platforms_MrSID_Description": "Nenhuma descrição ainda.",
  "Platforms_PanoramIX_Description": "Nenhuma descrição ainda.",
  "Platforms_Petz_Player_Description": "Nenhuma descrição ainda.",
  "Platforms_Sibelius_Scorch_Description": "Nenhuma descrição ainda.",
  "Platforms_Sizzler_Description": "Nenhuma descrição ainda.",
  "Platforms_Ulead_COOL_360_Description": "Nenhuma descrição ainda.",
  "Platforms_VReam_WIRL_Description": "Nenhuma descrição ainda."
}
