{
  "Source_Title": "Source Code",
  "Source_Desc": "The software that powers Flashpoint is free and open-source, obviously excluding most of the supported browser plugins/technologies (we can't do much about that). Applications and utilities developed by project contributors can be found at our {GitHub team page} and at our {GitLab}.",
  "Source_Developed_Projects_Title": "Projects Developed by Flashpoint",
  "Source_Developed_Projects_Desc": "The following projects are released under the MIT license:",
  "Source_Flashpoint_Launcher_Desc": "{Flashpoint Launcher}, um launcher extensível, baseado em Electron e inspirado no LaunchBox.",
  "Source_Flashpoint_Proxy_Desc": "{Flashpoint Proxy}, uma biblioteca que permite a comunicação entre um navegador/projetor e a internet simulada do Flashpoint.",
  "Source_Flashpoint_Secure_Player_Desc": "{Flashpoint Secure Player}, uma aplicação avançada que permite a reprodução de conteúdos baseados em plugins sem fazer mudanças permanentes no registro do Windows.",
  "Source_Flashpoint_VM_Desc": "{flashpointvm}, an Apache-configured Linux disk image that securely serves the contents of ZIP archives.",
  "Source_Flashpoint_OldCPUSimulator_Desc": "{OldCPUSimulator}, uma ferramenta que executa aplicativos com velocidades de clock simuladas.",
  "Source_Utilized_Projects_Title": "Projects Utilized by Flashpoint",
  "Source_Utilized_Projects_Desc": "The following projects are included directly within the Flashpoint download:",
  "Source_Apache_Desc": "{Apache HTTP Server}, um servidor web lançado sob a licença Apache-2.0.",
  "Source_Basilisk_Desc": "{Basilisk}, um navegador web lançado sob a licença MPL-2.0. O Flashpoint usa uma versão customizada de 32-bits com o seu próprio branding, que pode ser encontrada {aqui}.",
  "Source_Chromium_Desc": "{Chromium}, um navegador web lançado sob várias licenças de código aberto.",
  "Source_PHP_Desc": "{PHP}, uma linguagem de script web lançada sob a licença PHP.",
  "Source_QEMU_Desc": "{QEMU}, a machine emulator released under the GPL-2.0-only license."
}