{
  "Source_Title": "Source Code",
  "Source_Desc": "O software que alimenta o Flashpoint é gratuito e de código aberto, com a exclusão óbvia de muitas das tecnologias e dos plugins de navegador que são suportados (não podemos fazer muito sobre isso). Aplicações e utilidades desenvolvidas pelos contribuidores do projeto podem ser encontradas na {página da equipe no GitHub}.",
  "Source_Developed_Projects_Title": "Softwares Desenvolvidos pelos Contribuidores do Flashpoint",
  "Source_Developed_Projects_Desc": "O seguinte software está disponível sob a licença MIT:",
  "Source_Flashpoint_Launcher_Desc": "{Flashpoint Launcher}, um launcher extensível, baseado em Electron e inspirado no LaunchBox.",
  "Source_Flashpoint_Proxy_Desc": "{Flashpoint Proxy}, uma biblioteca que permite a comunicação entre um navegador/projetor e a internet simulada do Flashpoint.",
  "Source_Flashpoint_Secure_Player_Desc": "{Flashpoint Secure Player}, uma aplicação avançada que permite a reprodução de conteúdos baseados em plugins sem fazer mudanças permanentes no registro do Windows.",
  "Source_Flashpoint_Component_Tools_Desc": "{Flashpoint Component Tools}, um conjunto de aplicativos que permite que o usuário baixe, gerencie e remova componentes.",
  "Source_Flashpoint_OldCPUSimulator_Desc": "{OldCPUSimulator}, uma ferramenta que executa aplicativos com velocidades de clock simuladas.",
  "Source_Utilized_Projects_Title": "Software de Terceiros Utilizados pelo Flashpoint",
  "Source_Utilized_Projects_Desc": "Os seguintes softwares de código aberto não foram desenvolvidos por nós, mas estão incluídos dentro do pacote de software do Flashpoint:",
  "Source_Apache_Desc": "{Apache HTTP Server}, um servidor web lançado sob a licença Apache-2.0.",
  "Source_Basilisk_Desc": "{Basilisk}, um navegador web lançado sob a licença MPL-2.0. O Flashpoint usa uma versão customizada de 32-bits com o seu próprio branding, que pode ser encontrada {aqui}.",
  "Source_Chromium_Desc": "{Chromium}, um navegador web lançado sob várias licenças de código aberto.",
  "Source_PHP_Desc": "{PHP}, uma linguagem de script web lançada sob a licença PHP."
}