{
  "Discord_Title": "Discord",
  "Discord_Intro": "Prosím přečtěte si pravidla před připojením k našemu Discord serveru (můžete se také na ně kouknout v {#rules-and-faq}, jakmile budete uvnitř):",
  "Discord_Rule1": "Dodržujte Discord pravidla a k tomu i ta naše: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Respektujte ostatní. Nebuďte bigotní, nepodněcujte problémy, nechovejte se protivně, opakovaně nezmiňujte uživatele/role, nebo neposílejte přímé zprávy členům serveru (včetně personálu) bez svolení.",
  "Discord_Rule3": "Ponechte témata v jejich určených kanálech. Pokud si nejste plně jisti účelem kanálu, vždy si přečtěte popis. Pokud vás zaměstnanec požádá o přesun konverzace, udělejte to prosím.",
  "Discord_Rule4": "Distribuce obsahu, který se v současné době prodává nebo o který se žádá, aby byl odstraněn z Flashpointu není povolena.",
  "Discord_Rule5": "{Never send emails relating to Flashpoint without the consent of staff, no matter how good you think it is.} Nikdo nechce, aby jeho šance na kontaktování vývojáře přišla nazmar, proto chceme zajistit, aby se to nestalo.",
  "Discord_Rule6": "Propagace vašich nebo přidružených stran prostřednictvím Discord pozvánek, YouTube odkazů, peněžitého podnikání nebo podobných aktivit je zakázaná, pokud není v kontextu Flashpoint nebo digitálního archivu.",
  "Discord_Rule7": "Erotický obsah a diskuse musí být uchovány v {#nsfw-lounge} (samotná existence kanálu by měla vysvětlit více než dost).",
  "Discord_Rule8": "Politické konverzace nemají na tomto serveru místo. Provádějte je někde jinde nebo vůbec.",
  "Discord_Curation_Exception": "(Jedinou výjimkou z pravidel 7 a 8 jsou kurátorské příspěvky - konkrétní diskuse o nich a o obsahu, který obsahují.)",
  "Discord_Sanctions": "Členům týmu je dovoleno varovat/umlčet/vyhodit/zabanovat uživatele, o kterých mají pocit, že porušují tato pravidla na základě závažnosti porušeného pravidla. Vyzýváme zaměstnance, aby byli velkorysí při prvním nebo náhodném porušení, ale mnohonásobné porušení pravidel budou mít za následek tvrdší tresty.",
  "Discord_Agreed": "Přečetl/a jsem si pravidla a chci se připojit k serveru!"
}