{
  "FAQ_Title": "Často kladené dotazy",
  "FAQ_Question1": "Nejmenoval se tento projekt dříve BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Ano - projekt obsahoval ve svém názvu BlueMaximu až do jeho odchodu z projektu v lednu 2023.",
  "FAQ_Question2": "Jaké operační systémy podporujete?",
  "FAQ_Answer2": "Flashpoint podporuje Windows 7 SP1 a novější (kromě stock Windows 8). Jsou k dispozici také verze MacOS a Linuxu; vyžadují však další kroky k instalaci a mohou spustit pouze hrstku nejpopulárnějších technologií prohlížeče.",
  "FAQ_Question3": "Vyvolává Flashpoint nějaké bezpečnostní problémy?",
  "FAQ_Answer3": "O žádných nevíme. Celá naše aplikační sada (kromě stahovací technologie verze Infinity) se nemůže připojit k otevřenému internetu, veškeré změny v rejstříku provedené Flashpoint Secure Player jsou odstraněny po ukončení hry; všechny příchozí kurace procházejí počítačem s kompetentním a aktuálním antivirovým programem; a co je nejdůležitější, launcher a všechen strojový kód Flashpointu {je zdarma a open-source}. Udělali jsme vše, co je v našich silách, abychom zajistili, že kolekce je co nejbezpečnější, ale navzdory našemu úsilí, některé antiviry, jako je Avast a AVG, mají tendenci označovat důležité komponenty za nebezpečné. Pokud jste postiženi tímto problémem, {přečtěte si tuto stránku} pro pokyny pro řešení problémů.",
  "FAQ_Question4": "Kolik her/animací je tam?",
  "FAQ_Answer4": "Flashpoint v současné době nabízí přes {} her a {} animací. Kolekci si můžete prohlédnout bez stažení Flashpointu {zde}.",
  "FAQ_Question5": "Jaké prohlížečové platoformy Flashpoint uchovává?",
  "FAQ_Answer5": "Uchováváme hry a animace bězící na všech platformách uvedených na {stránce statistik} databáze Flashpointu.",
  "FAQ_Question6": "Kde jsou Nitrome hry?",
  "FAQ_Answer6": "Nitrome nás zdvořile požádal, abychom odstranili jejich obsah z kolekce. Pokud chcete hrát jejich hry, udělete tak na jejich {stránce}, a pokud Flash není dostupný, postupujte podle jejich rostoucího {katalogu her kompatibilních s HTML5}. {Flashpoint nesouhlasí s obtěžováním kvůli rozhodnutí Nitrome.}",
  "FAQ_Question7": "Jak mohu požádat o hru/animaci?",
  "FAQ_Answer7": "Požadavek můžete podat nejprve přečtením {tohoto článku} v celé jeho délce a poté následováním odkazů v dolní části.",
  "FAQ_Question8": "Mohu přidat hru/animaci sám?",
  "FAQ_Answer8": "Ano! Postupujte podle pokynů uvedených v {kurátorském tutoriálu} a vytvořte zkušební kuraci. Jakmile bude schválena, můžete odeslat tolik dalších kurací, kolik si přejete.",
  "FAQ_Question9": "Chci přispět jiným způsobem (kódování, testování atd.). Jak mohu pomoci?",
  "FAQ_Answer9": "Připojte se na náš {Discord server} pro více podrobností. Většina naší práce a komunikace probíhá právě tam.",
  "FAQ_Question10": "Je Flashpoint open source?",
  "FAQ_Answer10": "Jakoby jo i ne. Zdroje pro naši vlastní technologii, jako je spouštěč, jsou k dispozici na našem {GitHubu}. Zdroje pro software, který zahrnujeme do Flashpointu, jsou k dispozici na jejich příslušných webových stránkách (neupravujeme zdroj žádného softwaru, který zahrneme). Binární soubory pro samotné webové pluginy nejsou open source, ale pokud by byly, tak bychom zde ani nebyli.",
  "FAQ_Question11": "Mohu použít logo/je k dispozici pod Creative Commons?",
  "FAQ_Answer11": "Ano - logo spadá pod licenci {CC-BY 4.0}. Jako autora můžete volitelně uvést Seirade a Flashpoint. Zdrojové soubory naleznete {zde}.",
  "FAQ_Question12": "Kde mohu na projekt přispět?",
  "FAQ_Answer12": "Archiv Flashpoint funguje jako neziskový kolektiv. Více informací o tom, jak přispět a kam vaše peníze půjdou, najdete na naší {Open Collective stránce}.",
  "FAQ_Question13": "Flashpoint nefunguje správně!",
  "FAQ_Answer13": "Postupujte podle kroků řešení problémů uvedených v {manuálu}. Pokud stále máte problémy, požádejte o pomoc na našem Discordu.",
  "FAQ_Question14": "Chci, aby byla hra/animace odstraněna z Flashpointu.",
  "FAQ_Answer14": "Upozorněte nás buď prostřednictvím našeho Discordu nebo {přímo e-mailem}. Pravděpodobně se vás pokusíme přesvědčit, abyste si zde udrželi svou hru z historických důvodů, ale nejsme nerozumní.",
  "FAQ_Question15": "Mám jiný dotaz.",
  "FAQ_Answer15": "Podívejte se na náš {rozšířený FAQ}. Pokud zde není vaše otázka zodpovězena, připojte se k našemu Discordu."
}