{
  "News_Title": "Novinky",
  "News_Para1": "Všechny významné události v historii Flashpointu k říjnu 2019. Najeďte na jméno verze a získejte vysvětlení od BlueMaximy, zakladatele projektu.",
  "News_Para2": "Seznam změn zahrnující všechny verze vydané před přechodem na systém založený na komponentech naleznete {here}. Možnost přímého stahování starších verzí Flashpoint Ultimate naleznete na účtech BlueMaxima a Dri0m v internetovém archivu {here} a {here}.",
  "News_Flashpoint_Started": "BlueMaximův Flashpoint byl spuštěn.",
  "News_Flashpoint_0": "Flashpoint Zero byl vydán.",
  "News_Flashpoint_1": "Flashpoint Version One byl vydán.",
  "News_Was_Released": "byl vydán",
  "News_Flashpoint_3_0": "Klíče ke království",
  "News_Flashpoint_3_0_Meta": "V této verzi byl představen Redirector, který byl posledním dílem skládačky pro zprovoznění serveru - umožnil nám zachovat 99,9 % her Flash bez hackování. Představoval klíče ke království zachování Flashe, chcete-li.",
  "News_Flashpoint_3_1": "Premiéra",
  "News_Flashpoint_3_1_Meta": "Tato verze byla první, která měla Flashpoint divadlo (i když to byla v té době samostatná instance Launchboxu).",
  "News_Flashpoint_3_2": "Šok a obdiv",
  "News_Flashpoint_3_2_Meta": "Tato verze byla první, která podporovala tituly Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Pojmenováno po skutečnosti, že v této kolekci bylo 4000 her. Jak ten čas letí.",
  "News_Flashpoint_4_0": "Žijící nekonečnost",
  "News_Flashpoint_4_0_Meta": "Tato verze představila Flashpoint Infinity, která umožňuje lidem streamovat hry z internetu. Jméno je převzato z alba Soilwork v roce 2013 stejného jména.",
  "News_Flashpoint_4_1": "Javalita",
  "News_Flashpoint_4_1_Meta": "Toto byla verze, která představila podporu pro applety Java. DarkMoe přišel s tímto názvem.",
  "News_Flashpoint_5_0": "Jdeme to spustit",
  "News_Flashpoint_5_0_Meta": "Launcher, který všichni známe a milujeme byl představen právě v této verzi.",
  "News_Flashpoint_5_1": "Velký filtr",
  "News_Flashpoint_5_1_Meta": "Playlisty byly přidány zde (filtry, pokud chcete). Jméno je převzato z EP Mesarthimu, The Great Filter.",
  "News_Flashpoint_5_2": "Typ III",
  "News_Flashpoint_5_2_Meta": "Velký filtr a Typ III jsou dvě EPéčka Mesarthimu, které jsou často dávány dohromady. Žádný jiný název se neobjevil, když jsme potřebovali.",
  "News_Flashpoint_5_3": "Revoluce",
  "News_Flashpoint_5_3_Meta": "Tato verze byla vydána blízko jednoletého výročí Flashpointu a my jsme to považovali za skutečnou revoluci. (Původně se měla nazývat \"Orbit\", ale to byl hloupý název)",
  "News_Flashpoint_5_4": "Rekombinace",
  "News_Flashpoint_5_4_Meta": "Tato verze přesunula animace ke hrám, které byly dříve v oddělených složkách s oddělenými klienty. 'Rekombinace' a '74%' jsou také jména dvou skladeb v albu The Density Parameter od Mesarthimu.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Rychlá sada patchů vytvořená podél uploadu verze 5.4. Nebylo to tak, že by Flashpoint 5.4 byl dokončen pouze 74% při jeho uploadu.",
  "News_Flashpoint_5_5": "Železo a měď",
  "News_Flashpoint_5_5_Meta": "BlueMaxima v této době hrál příliš mnoho Deus Ex.",
  "News_Flashpoint_6_0": "Zarovnání",
  "News_Flashpoint_6_0_Meta": "Další odkaz na Mesarthim!",
  "News_Flashpoint_6_1": "Uchovávacíware",
  "News_Flashpoint_6_1_Meta": "Hříčka se softwarovými termíny běžně používanými v technologickém sektoru, jako jsou \"freeware\" a \"shareware\".",
  "News_Flashpoint_6_2": "Moeův velký útěk",
  "News_Flashpoint_6_2_Meta": "Zaměstnanec DarkMoe připravil v této verzi opravdu šílené množství únikových her.",
  "News_Flashpoint_6_3": "Hovoříme o Flash hrách, ne o abstraktní filozofii",
  "News_Flashpoint_6_3_Meta": "Pojmenováné podle hlášky, kterou pronesl nosamu, člen personálu.",
  "News_Old_Releases_Title": "Retroaktivní časová osa vydání",
  "News_Old_Releases_Description": "Vzhledem k tomu, že informační sloupec existoval až od prosince 2019, byla většina vydání až do tohoto okamžiku nezapsaná. V této sekci jsou uvedeny chybějící verze.",
  "News_Is_Available": "je nyní k dispozici!",
  "News_Grab_Download": "Stáhněte z {downloads page}",
  "News_Flashpoint_Update_October_2019": "Aktualizace stavu Flashpointu v říjnu 2019 je nyní k dispozici na Medium. Podívejte se na {here}.",
  "News_Flashpoint_Update_November_2019": "Aktualizace stavu Flashpointu v listopadu 2019 je nyní k dispozici na Medium. Podívejte se na {here}.",
  "News_Flashpoint_7_0": "Osm tisíc hodin",
  "News_Flashpoint_7_0_Meta": "Osm tisíc hodin bylo zhruba tak dlouho, jak dlouho měl Flash v době vydání žít.",
  "News_Flashpoint_7_1": "Držte se cíle",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0, podle našich měřítek, byl dost nepovedený. 7.1 byla verze s ohromným množstvím oprav.",
  "News_Featured_Kotaku_Link": "Byli jsme uvedeni na Kotaku!",
  "News_Featured_Kotaku_Rest": "To je obrovský milník. Děkujeme vám všem za podporu!",
  "News_Flashpoint_Update_March_2020": "Aktualizace stavu Flashpointu v březnu 2020 je nyní k dispozici na Medium. Podívejte se na {here}.",
  "News_Flashpoint_Update_April_2020": "Aktualizace stavu Flashpointu v dubnu 2020 je nyní k dispozici na Medium. Podívejte se na {here}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Tato verze znamenala konec Redirector softwaru, který se dříve používal k tomu, aby server fungoval. 301 je HTTP kód pro 'trvale přesunuto', tj. již nepřesměrovává.",
  "News_Flashpoint_Update_June_2020": "Mini aktualizace stavu Flashpointu v červnu 2020 je nyní k dispozici na Medium. Podívejte se na {here}.",
  "News_Flashpoint_8_1": "Dobrodružný duch",
  "News_Flashpoint_8_1_Meta": "Název je odvozen od verše z tehdy nedávného alba Redneck Vikings from Hell od skupiny Aether Realm. Konkrétně se jedná o skladbu \"One Hollow Word\".",
  "News_Flashpoint_Update_August_2020": "Aktualizace stavu Flashpointu v srpnu 2020 je nyní k dispozici na Medium. Podívejte se na {here}.",
  "News_Flashpoint_8_2": "Blížíme se k Planetě Devět",
  "News_Flashpoint_8_2_Meta": "Jde o (roztažený, to přiznávám) portmanteau slov \"blížíme se k deváté verzi\" a Planet Nine, EPéčka Mesarthimu.",
  "News_Flashpoint_9_0": "Nádherný západ slunce",
  "News_Flashpoint_9_0_Meta": "Pojmenováno podle písně Glorious Morning, která je známá za to, že je v Age of War. Tato verze byla poslední, která vyšla před smrtí Flashe, proto \"západ slunce\".",
  "News_Flashpoint_Update_April_2021": "Aktualizace stavu Flashpointu v dubnu 2021 je nyní k dispozici na Medium. Podívejte se na {here}.",
  "News_Flashpoint_10_0": "Absence",
  "News_Flashpoint_10_0_Meta": "Toto je první verze, která se uvolní na \"po Flashovém\" internetu, proto název \"Absence\". Shodou okolností se tak jmenuje i poslední skladba na EPéčku Mesarthimu 'Vacuum Solution'.",
  "News_Flashpoint_10_1": "Absence II",
  "News_Flashpoint_10_1_Meta": "Zkuste hádat.",
  "News_Flashpoint_11": "Jejda, všechny pluginy!",
  "News_Flashpoint_11_Meta": "Je to meme, protože verze 11 přidala tři tucty nových pluginů.",
  "News_Flashpoint_11_1": "Operace Cherry Blossom",
  "News_Flashpoint_11_1_Meta": "Odkaz na hru Muv-Luv (jděte si ji koupit na Steamu).",
  "News_Flashpoint_12": "Axolotl",
  "News_Flashpoint_12_meta": "Jsou roztomilí a cool."
}