{
  "Platforms_Title": "Podporované platformy",
  "Platforms_Description1": "Flashpoint podporuje hry a animace vytvořené pro různé webové pluginy a standardy - nejen pro Flash. Tato stránka obsahuje přehled historie jednotlivých technologií od verze 11. Aktuální statistiky o počtu výskytů každé platformy si můžete prohlédnout na stránce {Flashpoint Database}.",
  "Platforms_Description2": "To slouží jako \"Kdo? Kdy? Co?\" shrnutí a výchozí bod pro další výzkum, není to komplexní historie každé platformy. Snažíme se prezentovat přesná fakta, ale chyby jsou stále možné. Kontaktujte nás prosím s příslušnými informacemi pro opravy.",
  "Platforms_By": "od",
  "Platforms_3D_Groove_GX_Description": "Společnost The Groove Alliance byla založena v roce 1998 a vyvinula 3D Groove SX, 3D herní engine s podporou Shockwave. Později, v roce 2002, se engine oddělil od Shockwave a vytvořil vlastní celek s názvem 3D Groove GX. Obě varianty bylo možné použít pro vývoj online her a desktopových aplikací. Z toho se stal pro společnost velký úspěch, který shromáždil velkou firemní uživatelskou základnu a později vedl k vytvoření několika vysoce profilovaných titulů pro televizní seriály a další velké oblasti. Poté, co humbuk opadl, se společnost The Groove Alliance v roce 2008 přetvořila na OTOY, ale webové stránky 3D Groove zůstaly online až do roku 2009. Přesná příčina zániku původní společnosti není známa, ale bylo potvrzeno, že došlo k vnitřním bojům.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (dříve 3D Life Player, Virtools Player a NeMo Web Player, nezaměňujte s 3DVIA Studio/Beta Player nebo 3DVIA Composer Player) byl prohlížečový plugin společnosti Dassault Systèmes pro přehrávání 3D zážitků vytvořených v programu Virtools. Byl určen pro pokročilé, praktické aplikace 3D, jako jsou počítačová školení, virtuální prohlídky a nemovitosti. 3DVIA Player se používal také pro webové hry, přičemž mezi jeho hlavní uživatele pro tento účel patřilo quebecké herní studio Sarbakan a amsterdamská společnost Little Chicken Game Company. Poslední aktualizace, verze 5.0, byla vydána v roce 2009. Stránka pro stahování zůstávala v provozu i v následujících letech, dokud nebyla v roce 2016 stažena. Do té doby byl plugin nainstalován více než 30 milionkrát.",
  "Platforms_AboutPeople_Description": "Zatím žádný popis.",
  "Platforms_AboutTime_Description": "Zatím žádný popis.",
  "Platforms_ActiveX_Controls_Description": "ActiveX byl softwarový rámec vydaný společností Microsoft v roce 1996, který sloužil jako standard umožňující zapouzdření programů jako kontejnerů pro použití v jiných nesouvisejících programech, tzv. ovládacích prvcích ActiveX. Ty bylo možné vkládat do obsahu HTML a bylo možné vytvářet jednoúčelové ovládací prvky speciálně pro použití v aplikaci Internet Explorer za účelem přehrávání webových her. Po uvedení prohlížeče Edge v roce 2015 byl tento software vyřazen a jeho používání pro webové aplikace zřejmě skončilo a byl odsunut do prohlížeče Internet Explorer 11 pro podporu staršího softwaru.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Atmosphere Player, jehož vývoj byl zahájen v roce 1996 jako V3O společností Rocket Science Games, později převeden do společnosti Attitude Software a přejmenován na 3D Anarchy a poté v roce 2000 prodán společnosti Adobe a v roce 2001 přejmenován, je webový plugin určený k prohlížení interaktivních 3D světů, podobných standardu VRML, vytvořených v Atmosphere Builderu. Byl určen především pro virtuální mediální galerie, které mohly prezentovat obrázky/audio/video a samotné 3D modely. Při svém vzniku pod názvem 3D Anarchy byl software ještě ve fázi beta, když společnost Adobe získala technologii pro další vývoj, kde strávil další 3 roky v beta testování a poslední verze 1.0 přehrávače byla vydána v únoru 2004. V prosinci 2004 bylo oznámeno, že Atmosphere bude ukončen, přičemž podpora byla ukončena v lednu 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (také jen Flash, dříve Macromedia Shockwave Flash Player) je přehrávač vektorových animací a grafiky, často s přidanou interaktivitou. Byl používán jako médium pro webové hry díky své účinné kompresi, nízké ceně, snadnému použití a velké instalační základně. Byl vyvinut v roce 1995 a poprvé představen společností FutureWave v roce 1996, uměl toho o málo víc než jen základní animace a tlačítka pro jejich ovládání. Jak získával na popularitě, byly do přehrávače přidávány pokročilejší funkce, například programovací jazyk ActionScript. Protože se však lidé začali obávat jeho potenciálních bezpečnostních problémů a mezi webovými vývojáři vzrostla popularita jazyka HTML5, společnost Adobe oznámila konec životnosti přehrávače Flash na 31. prosince 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (také Shockwave, dříve Macromedia Shockwave Player nebo Shockwave Director Player) je přehrávač interaktivních médií vydaný v roce 1995. Byl postaven na technologii, kterou o deset let dříve vyvíjela společnost MacroMind, a webovým pluginem se stal až po převzetí společností Macromedia. Na rozdíl od Flashe obsahoval Shockwave skriptovací jazyk Lingo a podporu jazyka C++ pomocí Xtras, což přehrávači poskytlo širokou škálu možností včetně 3D. Byl široce používán na počátku internetu a ve hrách na CD-ROM a získal si všeobecnou popularitu. Po převzetí společnosti Macromedia firmou Adobe došlo k výraznému poklesu popularity této platformy ve prospěch Flashe, který rychle rozšiřoval své funkce a nyní byl také vlastněn společností Adobe. Nakonec v únoru 2019 společnost Adobe oznámila jeho ukončení a o dva měsíce později ukončila jeho podporu.",
  "Platforms_Alambik_Plugin_Description": "The Alambik Plugin je webový přehrávač pro obsah vytvořený pomocí vývojové platformy Alambik. Byl vydán v roce 2001 a uměl pracovat s 2D a 3D grafikou, vektory a mnoha dalšími aplikacemi. V roce 2002 uspořádala společnost Alambik k oslavení vydání Alambik Scriptu soutěž s cenami. V roce 2004 vytvořila společnost Alambik novou webovou stránku s ukázkami, ale poté se odmlčela a nikdy nevydala nic nového pro tuto platformu a ani plugin neaktualizovala.",
  "Platforms_Ambulant_Description": "Ambulant je přehrávač pro soubory SMIL, který vytvořilo mnoho jednotlivců koordinujících práci v CWI v Amsterdamu v Nizozemsku. Zdá se, že název odkazuje na \"ambulaci\", což je jiný výraz pro chůzi; to je navíc podpořeno logem, které vypadá jako někdo, kdo jde. SMIL byl specifikací vytvořenou mezinárodním webovým konsorciem W3C, ale nezískal si velkou popularitu. Ambulant se pokusil být open source přehrávačem, který podporuje všechny soubory SMIL. Snaha o to, aby všechny části byly open source, mu však zabránila podporovat některé proprietární mediální formáty. Vývoj začal v dubnu 2003 a první verze \"AMBULANT/G\" byla vydána v červenci téhož roku. Poslední stabilní verze, 2.6, byla vydána v únoru 2015, avšak práce na nestabilním sestavení Ambulant 2.7 pokračovaly až do července 2016, kdy byla provedena poslední revize jejich repozitáře na Githubu. Vývojáři systému Ambulant jsou stále aktivní na jiných projektech.",
  "Platforms_AnimaFlex_Description": "AnimaFlex byl plugin pro přehrávání grafiky, který uměl přehrávat animace s malou velikostí vytvořené pomocí nástroje RubberWeb Composer, který dokázal roztáhnout a zkreslit obrázky. Dokázal začít přehrávat animace ještě před stažením celého souboru a přizpůsobit se pomalejší rychlosti internetu. Navzdory svým slibům měl samotný RubberFlex několik dalších produktů, všechny exportovaly gify a konkurovaly jejich proprietární variantě, a dokonce 2 dny po pluginu spustil FlexToGif, který převáděl Plugin soubory na gify. Počátkem roku 1998 RubberWeb Composer ukončil distribuci a AnimaFlex tak zůstal bez autorského programu.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics byl prezentační program vytvořený v roce 1986 společností Software Publishing Corporation (SPC) pro počítače se systémem MS-DOS. Po jejich přechodu na Windows v roce 1991 se mu nepodařilo získat zpět podíl na trhu, který měl, a prohrál s PowerPointem. V roce 1996 koupila společnosti SPC a Serif společnost Allegro New Media (později téhož roku přejmenovaná na Vizacom). Společnost SPC vytvořila ASAP WordPower, program pro snadné vytváření prezentací, které bylo možné publikovat na webu pomocí pluginu ASAP WebShow. Společnost SPC se v roce 1997 sloučila se společností Serif. V roce 1998 byla značka Harvard oživena autorským programem Harvard Graphics 98 a plugin byl nahrazen novým s názvem Harvard Graphics WebShow. V roce 2000 se objevila nová verze autorizačního programu Advanced Presentations, která místo proprietárního formátu pluginu exportovala do standardu Flash. V roce 2001 společnost Vizacom prodala firmu Serif zpět svému původnímu vedení, které odsunulo řadu Harvard do kategorie staršího softwaru, který byl podporován a prodáván až do svého ukončení v roce 2017.",
  "Platforms_Authorware_Web_Player_Description": "Authorware Web Player vytvořila společnost Macromedia v roce 1996 jako jednu z nových funkcí softwaru Authorware 3.5. Byl vytvořen jako způsob, jak na webu spouštět interaktivní programy vytvořené pomocí softwaru Macromedia Authorware. Na rozdíl od většiny webových pluginů bylo hlavním účelem Authorware pomoci při elektronickém vzdělávání, což vedlo k jeho využití ve firmách a v akademické oblasti jako způsob sestavování multimediálních výukových materiálů bez nutnosti programátorských zkušeností. Finální verze pluginu byla vydána v roce 2004, před převzetím společnosti Macromedia firmou Adobe v roce 2005, po čemž se vývoj zastavil až do oznámení o ukončení jeho vývoje v roce 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Zatím žádný popis.",
  "Platforms_AXEL_Player_Description": "AXEL Player byl interaktivní plugin pro 3D obsah vytvořený společností MindAvenue v roce 2002. Byl to způsob, jak ukládat a přehrávat modely a animace ve webovém autorském programu AXELedge a AXELpublisheru, který převáděl soubory z jiných 3D programů, jako je 3ds Max. Tento software byl kritikou dobře přijat, a to i přes několik omezení, z nichž jedním byl nedostatek uživatelů pluginu. V roce 2005 společnost MindAvenue koupila firma 20-20 Technologies, která se specializovala na software pro navrhování interiérů a vývoj nábytku, a v roce 2006 se jejich webové stránky staly stránkou směřující k 20-20. Všechny produkty značky AXEL včetně pluginu byly ukončeny.",
  "Platforms_BitPlayer_Description": "BitPlayer byla desktopová aplikace založená na technologiích Flash a Shockwave, kterou v roce 1999 vytvořila nizozemská společnost BitMagic. Nabízela denně krátká videa, která byla vyráběna doma a klienty, ktera byla doprovázena reklamami a kvízy. Původně měla hodnotu 6 milionů dolarů, ale po internetové horečce se stala obětí inzerentů a v lednu 2001 ukončila výrobu. Velká část jejího obsahu od té doby přežila jako konvertované soubory SWF, přestože ztratila další funkce, které vlastní přehrávač nabízel.",
  "Platforms_Blender_Description": "Blender je 3D softwarový nástroj vytvořený v roce 1994 nizozemským animačním studiem NeoGeo. Jeho první verze byla vydána v roce 1995. Společnost byla v roce 1998 zrušena, ale její spolumajitel Ton Roosendaal vytvořil společnost Not a Number Technologies (NaN), která Blender dále rozvíjela. Verze 2.0, známá také jako GameBlender, vyšla v roce 2000 a znamenala posun směrem k interaktivitě a vývoji her. Z tohoto důvodu byl v roce 2001 vydán plugin pro prohlížeč, který začal jako otevřená beta verze. Druhá beta verze byla spuštěna v lednu 2002. Navzdory počátečnímu úspěchu se objevily finanční problémy a společnost NaN počátkem roku 2002 ukončila činnost. Roosendaal se poté rozhodl udělat Blender open-source a podařilo se mu to po crowdfundingu, kdy odkoupil akcie od investorů. Pokusy o pokračování vývoje pluginu byly učiněny, ale přechod na open source vedl k chybějícím komponentům pro herní engine; jeho obnova byla nejvyšší prioritou a plugin byl pozastaven. Poslední verze byla k dispozici ještě několik let - s tím, že v té době neexistovala žádná podpora ani plány na nové vydání - než byla v roce 2005 odstraněna.",
  "Platforms_Burster_Description": "Burster byl implementací herního enginu Blender z roku 2000. Projekt byl pokusem o oživení oficiálního pluginu spuštěného s Blenderem, který byl ukončen z bezpečnostních důvodů. Vylepšoval původní verzi a využíval novější verze enginu pro lepší výkon a grafiku. Poslední verze byla spuštěna v roce 2013 a po třech letech bez aktualizací byl Burster v roce 2016 oficiálně ukončen. Samotný herní engine byl z programu Blender odstraněn v roce 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin je nástroj pro zvýšení produktivity, který v roce 1996 vytvořila společnost Logic Pulse. Jednalo se o novou funkci přidanou do verze 3.2 aplikace Calendar Quick, která slouží k vytváření kalendáře a plánování na počítači. Umožňovala uživatelům publikovat je pomocí funkce exportu do internetových stránek, které bylo možné propojit s dalšími osobami a prohlížet pomocí pluginu. Po opravě chyby Y2K v roce 1999 zůstaly stránky opuštěné bez dalších aktualizací a v roce 2001 zanikly.",
  "Platforms_Cult3D_Description": "Cult3D byl webový prohlížeč 3D obsahu vytvořeného pomocí autorského programu Cult3D Designer. Zaznamenal mírný úspěch, do roku 2001 jej používalo 6 milionů uživatelů a několik významných klientů, přičemž byly přidány další možnosti importu 3D modelů z jiných programů. Poslední verze 5.3 byla vydána v roce 2002 a poslední aktualizace pluginu proběhla v roce 2004, kdy byla technologie prodána společnosti Mental Images GmbH. Společnost Nvidia později v roce 2007 koupila Mental Images a stala se dceřinou společností Nvidia Advanced Rendering Center. I přes aktualizaci webových stránek se plugin nedočkal žádných aktualizací a od roku 2011 přestal být prezentován jako životaschopná možnost a stránka ke stažení byla udržována kvůli uživatelům, kteří stále měli autorskou licenci, později byl v roce 2013 stažen.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion byla řada programů pro augmentovanou realitu (AR), kterou v roce 1999 začala vyvíjet společnost Total Immersion a která využívala videokamery k zobrazení 3D objektů v reálném čase. Jedním z těchto programů byl D'Fusion @Home, který byl vydán v roce 2008 a později v roce 2009 k němu byl přidán plugin. Aplikace pro něj byly vytvářeny pomocí autorizačního programu D'Fusion Studio a jeho hlavní náplní byl marketing a krátké zážitky. Do roku 2011 se tato technologie snažila dosáhnout širokého přijetí. I když byla implementace Flashe dostupnější a autorský software se stal bezplatným, jeho přijetí bylo stále velmi omezené. Po nástupu chytrých telefonů byla vyvinuta aplikace TryLive jako další řešení založené na augementované realitě pro snadný náhled produktů, jako je nábytek a brýle, která se stala úspěšnou na rozdíl od řady D'Fusion, která se po roce 2013 nedočkala dalších aktualizací. V roce 2015 byla společnost prodána společnosti ACEP, která vyrábí brýle.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Zatím žádný popis.",
  "Platforms_DPGraph_Description": "Program DPGraph (Dynamic Photorealistic Graphing), který v roce 1999 vytvořil David Parker, je spustitelný program určený k zobrazování grafů z webových stránek. Umí animovat a zobrazovat až 8 rozměrů s možností ovládání proměnných. Fungoval tak, že se na webové stránce stáhl soubor, který prohlížeči sdělil, aby spustil program a vykreslil grafy. Plná verze byla licencována několika vzdělávacím institucím pro použití v učebnách a studovnách k vytváření grafů, stejně jako bezplatný přehrávač k jejich prohlížení. Naposledy byl aktualizován v roce 2016 a v roce 2019 se plná verze programu DPGraph stala volně použitelnou pro kohokoli.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) byl animační plugin vydaný společností Sharp v roce 2001. Byl navržen s ohledem na mobilní zařízení, jako jsou telefony a PDA, a vydán pro vybrané modely telefonů výhradně v Japonsku, stejně jako plugin pro prohlížeče. Pyšnil se malou velikostí souboru a vektorovou grafikou, která se hodila na jakoukoli obrazovku mobilního telefonu. V roce 2002 byla tato technologie představena pro americké publikum pod názvem SharpMotionART. Ani jedna z nich neměla dlouhého trvání, protože e-animator vydal svou poslední aktualizaci v roce 2003 a SharpMotionART byl ukončen v roce 2004.",
  "Platforms_Envoy_Description": "Envoy byl formát dokumentů vyvinutý v roce 1993 společností Tumbleweed Software, vytvořený virtuálním tiskem v programu WordPerfect. Jednalo se o konkurenta Adobe Acrobatu a jeho formátu PDF. Společnost WordPerfect Corporation byla v roce 1994 prodána firmě Novell, které patřil i Envoy, ale Tumbleweed pokračoval ve spolupráci s Novellem a v roce 1995 vytvořil webový plugin pro prohlížení souborů online. V roce 1996 Novell prodal WordPerfect společnosti Corel, ale ponechal si vlastnictví Envoy. V roce 1999 Novell přestal Envoy vyvíjet a Corel ukončil podporu Envoy v programu WordPerfect 2000. Tím byla ukončena spolupráce společnosti Tumbleweed se společností Novell po převzetí Envoy v roce 1994, čímž byla podpora pluginu zrušena.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) je lehký animační plugin vyvinutý společností Sharp v roce 1997. Měl několik verzí autorského softwaru dodávaných s počítači značky Sharp a pro různé demografické skupiny, z nichž hlavní byla \"EVA Animator\". V roce 2000 byla spuštěna verze \"EVA Animator Kids\", která je přívětivější pro děti, s webovou stránkou エバキッズクラブ (EVA Kids Club). Ty byly v roce 2007 ukončeny a nahrazeny středně pokročilou úrovní \"EVA Animator School II\". Poslední větší aktualizace pluginu přišla v roce 2002 s jednou drobnou opravou v roce 2008, ale přesto si udržel malou komunitu uživatelů, dokud Sharp v roce 2016 nezrušil hlavní webové stránky.",
  "Platforms_Flatland_Rover_Description": "Rover je 3D plugin založený na jazyce 3DML, který v roce 1997 vyvinula společnost Flatland. Uživatelé mohli pomocí autorizačního programu Spotnik vytvářet \"Spoty\" složené z \"Úrovní\" obsahujících \"Bloky\" pro snadnější vývoj a spouštět je pomocí programu Rover, který je k dispozici jako plugin pro prohlížeč i jako samostatný program. Vývoj probíhal čile až do internetové horečky, kdy se většina týmu rozpadla, poslední aktualizace vyšla v roce 2005 a webové stránky byly opuštěny, než v roce 2012 zanikly. Jeden z bývalých vývojářů, Michael Powers, se v roce 2014 rozhodl webové stránky oživit, vytvořit archiv programu a aktualizovat jej tak, aby fungoval na moderních systémech. Samostatná aplikace Rover byla v roce 2017 revidována, ale plugin se nevrátil.",
  "Platforms_Formula_One_Description": "Zatím žádný popis.",
  "Platforms_Fractal_Viewer_Description": "Zatím žádný popis.",
  "Platforms_FreeHand_Description": "FreeHand byla kreativní sada pro vektorovou grafiku z roku 1988, kterou vytvořila společnost Altsys Corporation. Společnost Macromedia koupila FreeHand v roce 1994 a pokračovala v jeho vývoji. V říjnu 1996 byl uveden FreeHand 7.0 se pluginem pro web, nazvaným Shockwave for FreeHand. Tento plugin umožňoval vkládat vektorové obrázky vytvořené programem a zobrazovat je na webových stránkách. V listopadu 1996 společnost Macromedia koupila FutureSplash, další webový plugin pro vektorovou grafiku, který byl přejmenován na Flash.  V roce 1998 byl vydán FreeHand 8.0, který nyní místo pluginu do FreeHand exportoval do Flashe. Poslední nová verze programu, FreeHand MX, byla vydána v roce 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "Plugin GoBit Games vytvořilo v roce 2008 malé nezávislé studio GoBit složené z bývalých zaměstnanců společnosti PopCap. Jejich první hra, Burger Shop, byla vydána v říjnu 2007 a na základě velké poptávky se o 4 měsíce později dočkala webové ukázky s využitím tehdy nového pluginu Games Plugin. Uplynul rok a demo bylo přepracováno jako reklamní hra pro Eggo, kterou 1. února 2009 vydala společnost Shockwave.com. Krátce poté byl plugin opuštěn s vydáním Burger Shop 2 - příslušné webové demo místo něj používalo Flash - a Burger Shop a jeho reskin tak zůstaly jedinými hrami, které pro něj byly kdy vytvořeny.",
  "Platforms_HotSauce_Description": "Meta Content Framework (MCF) byl formát pro strukturování metadat, který od roku 1995 vyvíjela skupina Advanced Technology Group společnosti Apple Computer, v roce 1996 se z Projektu X stal experimentální plugin vytvořený pro jejich zobrazování na internetu, později nazvaný HotSauce, který zobrazoval mapy stránek v 3D prostoru. Na konci roku 1996 používalo HotSauce více než 200 webových stránek, později se jejich počet zvýšil na více než 300, a byla uzavřena dohoda se společností NetCarta o vytvoření knihovny více než 30 000 webových stránek, které bylo možné pomocí pluginu prohlížet. Přestože si standard MCF získal určitou chválu, většina uživatelů neviděla v tomto způsobu 3D navigace žádnou výhodu a projekt skončil jako jeden z mnoha zrušených po návratu Steva Jobse do společnosti Apple v roce 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage je standard pro zobrazování dokumentů prostřednictvím webového prohlížeče. Jazyk HTML, který původně vyvinul Tim Berners-Lee na počátku 90. let 20. století (jeho kořeny sahají až do roku 1980), se stal hlavní metodou sdílení informací prostřednictvím internetu a jeho možnosti byly rozšířeny o další jazyky, jako jsou CSS a JavaScript. Poprvé byl uveden na trh v roce 1993, následně byl aktualizován v roce 1995 pomocí HTML2 a v roce 1997 pomocí HTML3 a HTML4. Poslední aktualizace HTML4 proběhla v roce 2000 a v následujících letech byly jeho spřízněné jazyky jako platforma pro hry, animace a další webový obsah do značné míry ignorovány, vývojáři místo toho volili technologii pluginů, ale s rozvojem technologií a internetu začaly být pluginy zastaralé, a proto byla vyvinuta snaha o aktualizaci standardu a v roce 2008 byl uveden HTML5. Vzhledem k tomu, že Flash a další zásuvné moduly vyšly z módy a HTML5 se stal doporučeným standardem, mnozí přesunuli své projekty do rodiny HTML - nebo zcela opustili proprietární pluginy a místo toho nahrávali svůj obsah na webové stránky, jako je YouTube. {Poznámka: Z důvodu stručnosti označuje Flashpoint jako \"HTML\" všechny položky, které neobsahují rámce nebo obsah s podporou pluginů.}",
  "Platforms_HyperG_Description": "Hyper-G byl systém pro správu webového obsahu (WCMS) založený na Gopheru, který v roce 1995 vyvinul Institut pro zpracování informací a počítačem podporovaná nová média (IICM) z Technické univerzity v rakouském Grazu. Jednalo se o alternativu k hypertextovým odkazům World Wide Webu, využívající prohlížeče s podporou Hyper-G, které mohly zobrazovat 3D modely adresářů a souborů, jakož i jiné modely, s vestavěným prohlížečem. Vzhledem k tomu, že byl založen na stále zastaralejším Gopheru, předchůdci WWW, vyvinul se později v roce 1996 v Hyperwave, bez dalších možností, které nabízely prohlížeče Hyper-G, jako například 3D funkce. Převážná většina jeho obsahu je nyní ztracena kvůli způsobu ukládání souborů v Gopheru.",
  "Platforms_Hypercosm_Player_Description": "Hypercosm je webový přehrávač 3D obsahu založený na technologii vyvíjené od roku 1989, který byl uveden na trh v roce 1999. Společnost provedla velkou investici, která se jí však nevrátila, a stala se tak jednou z mnoha obětí internetové horečky a v roce 2001 zanikla. Společnost však koupila společnost ORBITEC a díky smlouvě s NASA se jí podařilo poněkud odrazit ode dna a pokračovala v práci na nových projektech až do restrukturalizace v roce 2012, kdy ji společnost ORBITEC pozastavila do doby, než se objeví nový obchodní partner, který by měl zájem s touto technologií pracovat. K tomu však nikdy nedošlo, což vedlo k ukončení činnosti společnosti Hypercosm v roce 2016.",
  "Platforms_Illuminatus_Description": "Zatím žádný popis.",
  "Platforms_iPix_Description": "Zatím žádný popis.",
  "Platforms_Java_Plugin_Description": "Java applety, které byly vydány spolu s programovacím jazykem Java jako jedna z jeho funkcí, byly malá aplikační okna vložená do stránek pro další interaktivní funkce. Byly vytvořeny tak, aby byly vzájemně kompatibilní v různých operačních systémech a prohlížečích a aby byly výkonnější než standardní HTML. Zůstaly schopnou volbou po více než 10 let, ale počínaje rokem 2013 začala být technologie, na níž byly applety založeny, v hlavních prohlížečích nepodporována a mnohé z nich se staly nepoužitelnými, což vedlo k jejich vyřazení v roce 2017 a odstranění z Java SE 11 v roce 2018.",
  "Platforms_JCAMPDX_Description": "Zatím žádný popis.",
  "Platforms_Lightning_Strike_Description": "Zatím žádný popis.",
  "Platforms_LiveMath_Plugin_Description": "Plugin LiveMath je aplikace pro interaktivní matematiku, která vytváří okno s poznámkami, vzorci, grafy a dalšími matematickými funkcemi, které lze vložit na webovou stránku. Původně spuštěn jako Theorist v roce 1989 společností Prescience Corporation, webový plugin byl spuštěn v roce 1994 a v roce 1997 přejmenován na MathView poté, co jej koupila společnost Waterloo Maple, v roce 1999 jej koupila společnost MathMonkeys a přejmenovala jej na LiveMath. V roce 2014 byl s přibývajícími problémy a nekompatibilitou s nejnovějšími prohlížeči plugin vyřazen a nahrazen samostatným prohlížečem s názvem LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Zatím žádný popis.",
  "Platforms_MHSV_Description": "Spuštěn jako alfa verze s názvem VSV ({V}irtual {S}pace {V}iewer) a později přejmenován na MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), jednalo se o plugin vyvinutý společností ParaGraph, který umožňoval vytvářet interaktivní 3D světy pomocí autorského programu VHSB ({V}irtual {H}ome {S}pace {B}uilder), který uměl vytvářet jak interaktivní MHSV, tak standardní statické světy VRML. V roce 1996 při vývoji standardu VRML 2.0 přibyla interaktivita a ParaGraph aktualizoval VHSB tak, aby umožňoval tvorbu světů VRML 2.0. ParaGraph se však rozhodl spolupracovat se společností Silicon Graphics a jejím přehrávačem Cosmo VRML 2.0 a upravil VHSB tak, aby s ním lépe spolupracoval, a opustil přitom MHSV. Společnost Silicon Graphics koupila ParaGraph v roce 1997 a vytvořila Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Silverlight, vyvinutý společností Microsoft jako reakce na Flash a Javu a uvedený na trh v roce 2007, je multimediální nástroj zaměřený na streamování videa, který používá například společnost Netflix. Pozdější verze přidaly další možnosti pro jiné aplikace. Dočkal se slušné popularity, v roce 2011 dosáhl míry přijetí 64,7 %. V roce 2012 však s oznámením konce NPAPI, vydáním systému Windows 8 a začátkem zavádění HTML5 společnost Microsoft tento software vyřadila a v roce 2015 s vydáním systému Windows 10 vstoupil do fáze End-of-Life, kdy byl v říjnu 2021 ukončen.",
  "Platforms_NoteWorthy_Composer_Description": "Zatím žádný popis.",
  "Platforms_O2C_Player_Description": "Přehrávač o2c Player, součást řady o2c (objects to see = objekty k zobrazení), byl v roce 1999 webový 3D plugin pro zobrazování objektů a scén, který vyvinula německá společnost mb Software AG. V roce 2003 společnost prodala technologii o2c společnosti ELECO plc, která vyvinula a v roce 2005 uvedla na trh verzi 2.0 přehrávače o2c, která přinesla mnohem lepší výkon s 3D akcelerací a byla označena spíše jako nástroj CAD pro architekty. Byla přidána podpora pro více prohlížečů, ale nedošlo k žádným zásadním aktualizacím, převážné pouze opravy chyb. Od roku 2021 je plugin stále k dispozici ke stažení, ale společnost Elcosoft přešla na implementaci technologie Unity WebGL.",
  "Platforms_Octree_View_Description": "Octree View, který začínal jako starší plugin PicTree Viewer nebo PicView, poté přepracován na nový zásuvný modul Fastview a v roce 1999 přejmenován, je prohlížeč 3D objektů založený na technologii Voxel, která se vyvíjí nejdříve od roku 1980 a k vytváření obrázků využívá speciální kamery a laserové skenery. Společnost nadále využívala svou technologii a plugin, ale v roce 2007 přestala své webové stránky aktualizovat a ponechala je bez další aktivity.",
  "Platforms_Pixound_Description": "Pixound byl umělecký hudební plugin, který byl spuštěn v roce 1996 jako společný podnik společností Hologramophone Research a Frankfurt Balkind Partners. Fungoval jako MIDI klávesy, které využívaly barevné hodnoty obrázků k vytváření různých tónů a výšek. V roce 2003 společnost Hologramophone změnila název na Techné Media. V roce 2005 byl plugin opuštěn ve prospěch samostatné aplikace určené výhradně pro Mac OS X. Později se z ní v roce 2011 stala aplikace pro systém iOS.",
  "Platforms_Play3D_DeepV_Description": "Play3D byl 3D plugin vydaný v roce 1996 společností Heads Off, který byl v následujícím roce přejmenován a znovu vydán jako DeepV. Kromě několika příkladů se plugin po celou dobu své existence používal jen málo. Webové stránky vývojářů zanikly v roce 2001.",
  "Platforms_PointPlus_Description": "PointPlus byl plugin pro vkládání prezentací aplikace PowerPoint na web, vyvinutý společností Net-Scene a vydaný v květnu 1996 pro Windows NT a 95. Prezentoval se jako alternativa ke složitějšímu softwaru Macromedia Shockwave, určená pro laické uživatele, kteří chtějí používat standard PowerPoint. Do listopadu byl vyvinut prohlížeč v jazyce Java, který byl kompatibilní s různými platformami a nevyžadoval žádné pluginy. Byl ponechán jako možnost pro specializované případy, ale v roce 1997 přestala produktová řada dostávat aktualizace. Webové stránky byly ukončeny počátkem roku 2001.",
  "Platforms_PopCap_Plugin_Description": "Plugin PopCap byl plugin pro prezentaci herních ukázek vytvořených vývojářskou společností PopCap. Ve svých začátcích používala společnost pro svá dema online her Javu kvůli její přístupnosti. Později se však vývoj přesunul na vlastní plugin, který byl k dispozici jako ovládací prvek ActiveX a tradiční plugin pro Firefox. Tím společnost PopCap získala výhodu, že měla vlastní platformu pro distribuci demoverzí. Její nedostatečné využití zákazníky i samotnou společností PopCap však vedlo k tomu, že vývojáři v roce 2007 přešli na populárnější Flash.",
  "Platforms_ProtoPlay_Description": "ProtoPlay byl plugin určený k prezentaci prototypů pro interakci spotřebitelů s produkty a simulaci jejich funkcí. Byl vydán v roce 1996 a využíval autorizační program Altia Design k vytváření aplikací, které se skládaly z 2D spritů s interaktivními prvky. Plugin měl spíše utilitární charakter a od konce roku 2003 nebyl aktivně propagován, existoval spíše jako funkce, která byla k dispozici v případě potřeby. Altia Design a plugin neustále dostávaly aktualizace, které zlepšovaly jejich funkčnost, a v roce 2007 byl vydán nový nástroj, který umožňoval vytvářet pluginy pro Photoshop, nazvaný PhotoProto. V roce 2009 se společnost Altia Inc. přesunula k navrhování uživatelských rozhraní, čímž opustila aspekt prototypování softwaru a spolu s ním i ProtoPlay.",
  "Platforms_Pulse_Player_Description": "Pulse Player byl 3D plugin se zaměřením na animace, jehož vývoj byl zahájen v roce 1997 pod názvem 3rd Degree. Poprvé byl vydán v roce 1999 za finanční podpory několika zkušených členů v oblasti internetových médií a byl používán několika významnými klienty. Plugin byl prodáván jako zábavná a kreativní mediální platforma a zdálo se, že bude úspěšný, ale na začátku roku 2001 došlo ke změně v tom, čemu se společnost chtěla věnovat, a změnila značku přehrávače na serióznější obchodní a vzdělávací nástroj. V roce 2003 byla uvedena poslední verze 5.2 a krátce poté byla její podpora ukončena.",
  "Platforms_REBOL_Plugin_Description": "REBOL je programovací jazyk navržený před více než 20 lety a vydaný v roce 1997. V roce 2004 byl vytvořen experimentální prototyp webového pluginu REBOL a k tomu stránka s několika příklady. Plugin začal jako ActiveX pouze pro Internet Explorer, ale později v roce 2006 byla vydána verze pluginu pro ostatní prohlížeče. Krátce poté však byla provedena poslední aktualizace a plugin zůstal v beta verzi jako nezabezpečený prototyp.",
  "Platforms_ShiVa_Web_Player_Description": "ShiVa Web Player, vytvořený společností Stonetrip a před rokem 2007 pojmenovaný Ston3D Web Player, byl plugin 3D webového obsahu pro spouštění softwaru vytvořeného v enginu ShiVa 3D. Umožňoval vytvářet komplexní 3D scény s osvětlením a fyzikou při nízkých nárocích na zpracování. Společnost Stonetrip se později v roce 2013 přejmenovala na ShiVa Technologies SAS a zaměřila se výhradně na engine. S odstraněním rozhraní NPAPI z většiny prohlížečů se podpora pluginu snížila, což vedlo k tomu, že v roce 2018 došlo k výpadku URL odkazů několika základních souborů a rozbití většiny her a v roce 2019 bylo jeho možné stahování z webových stránek společnosti ShiVa odstraněno.",
  "Platforms_Show_It_Description": "Show It! byl plugin představený v roce 1997 se sadou WordPerfect Suite 8 jako jedna z funkcí aplikace Corel Presentations 8, konkurenta aplikace PowerPoint. Při exportu s možností Internet Publisher mohli exportovat prezentace buď jako statickou prezentaci obrázků, nebo jako vložený projektor pomocí proprietárního souboru, který fungoval stejně jako původní desktopová aplikace, se zachováním všech funkcí, k čemuž byl plugin potřeba. Ten byl nadále podporován v aplikaci WordPerfect Office 2000 v modulu Presentations 9, ale v roce 2001 byla podpora možnosti pluginu v aplikaci WordPerfect Office 2002 v modulu Presentations 10 zrušena.",
  "Platforms_SmoothMove_Panorama_Description": "Zatím žádný popis.",
  "Platforms_Squeak_Etoys_Description": "Squeak byla platforma s otevřeným zdrojovým kódem, která byla spuštěna v roce 2001 a sloužila k vytváření zábavného a vzdělávacího obsahu. Uživatelé mohli vytvářet malé aplikace určené pro děti různých věkových skupin, od těch nejmenších s názvem \"Etoys\" až po \"Omniuser\" a \"Expert\". V roce 2008 byl přejmenován na Etoys a posunul se více k mladším dětem. Etoys 5 byla poslední verze pluginu, vydaná v roce 2012. V roce 2013 byl po obavách o bezpečnost zahájen vývoj verze programu v JavaScriptu, po kterém byl plugin opuštěn a nahrazen.",
  "Platforms_Superscape_Viscape_Description": "Viscape, který v roce 1996 uvedl na trh průkopník 3D, společnost Superscape, s podporou společnosti Intel a který se původně jmenoval VisNet, byl 3D plugin, jehož výraznou výhodou byla interaktivita se světy, na rozdíl od statických modelů VRML 1.0. Dočkal se krátkého období popularity a zpočátku se s podporou VRML nepočítalo, ale s implementací interaktivity s VRML97 byla v roce 1998 vydána aktualizace s názvem Viscape Universal, která přidala podporu VRML, aby zůstala relevantní. Ukázalo se však, že to nestačí a došlo k finančním potížím a neúspěšným partnerstvím a recenzenti označili plugin za zastaralý a těžkopádný, přestože se snažili o jeho oživení. Ačkoli poslední aktualizace byla vydána v roce 2000, jeho technologie se ještě následující rok využívaly v sérii Lego Creator společnosti Superscape. Byl učiněn pokus o jeho aktualizaci vložením pluginu do Java appletů s názvem Vislite, ale nakonec se pak společnost přeorientovala na vývoj mobilních her a dosáhla mírného úspěchu, než ji v roce 2008 koupila společnost Glu Mobile.",
  "Platforms_Surround_Video_Description": "Zatím žádný popis.",
  "Platforms_SVF_Viewer_Description": "Zatím žádný popis.",
  "Platforms_Tcl_Plugin_Description": "Tool Command Language (Tcl, vyslovuje se \"tickle\"), vyvinutý malým týmem a uvedený na trh v roce 1988, je dynamický programovací jazyk s otevřeným zdrojovým kódem. V roce 1994 přibrala společnost Sun Microsystems tým, aby tuto technologii dále rozvíjel. Jedním z výsledků tohoto podniku byl plugin z roku 1996, který umožňoval spouštět aplety Tcl (\"Tclety\") vložené do stránek. Koncem roku 1997 byl vývoj Tcl vyčleněn do nezávislé společnosti Scriptics a v roce 2000 se opět oddělil do Tcl Core Team. Zatímco vývoj jazyka je dodnes aktivní, práce na pluginu se zpomalila, přestože nebyla oficiálně ukončena. Poslední verze 3.1.0 byla vydána v roce 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer byl multimediální plugin z roku 1997 od společnosti Parable Corporation, která se později v roce 1998 přejmenovala na ThingWorld. Vytvářel \"Things\", prostředky, které mohly být volitelně chráněny proti krádeži nebo manipulaci a měly jedinečné ID s možností pro sdílení na webových stránkách, pomocí jednoduchého modulárního programování, k vytváření věcí, jako jsou obrázky, animace a dokonce interaktivní hry, vytvořené pomocí autorského programu ThingMaker nebo převodem souborů Shockwave Director pomocí ThingConverter. Byl poměrně populární, v roce 1999 dokonce získal smlouvy s Microsoftem a několika dalšími společnostmi, ale na konci roku 2000 společnost snížila počet zaměstnanců a jednala s neznámou stranou o fúzi s cílem prodat technologii. Webové stránky byly v roce 2002 uzavřeny.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine je víceplatformní herní engine, jehož cílem je zpřístupnit vývoj her, který je mezi vývojáři po celém světě nejoblíbenějším softwarem pro vývoj her třetích stran. Unity Web Player, vytvořený souběžně se samotným Unity a implementovaný v první opravné verzi v roce 2005, byl nástrojem pro hraní her Unity na webu. Zůstal oblíbenou platformou pro 3D hry, ale s odstraněním podpory NPAPI v roce 2016 byl plugin opuštěn ve prospěch Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap byl nástroj pro vizualizaci interaktivních map vložených do webové stránky. Byl kompatibilní s několika mapovými soubory z různých autorských programů, uměl zobrazit podrobné informace o sektorech a umožňoval provádět měření. Po jeho spuštění v roce 1997 nedošlo k dalšímu vývoji této technologie a zůstal stejný až do zániku stránky v roce 2004.",
  "Platforms_Vitalize_Description": "Vitalize! byl plugin s nízkou šířkou pásma určený pro jednoduché webové hry s důrazem na hry, marketing a reklamu, který v roce 1997 vytvořila společnost Corel pro zobrazování obsahu vytvořeného pomocí svého multimediálního autorského programu Click&Create. Byl distribuován s pomocí společnosti Europress a pyšnil se tím, že se \"na rozdíl od Javy nebo Shockwavu snadno učí a používá\". Někdy v roce 1999 odešli bývalí zaměstnanci Corelu a vytvořili Clickteam, který pak v roce 2000 převzal vývoj verze 2.0. Poslední verze 4.0 byla vydána na přelomu let 2007/2008 a na jejich webových stránkách byla k dispozici až do roku 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage je otevřený 3D standard a vůbec první vytvořený pro web. Když byl v listopadu 1994 původně specifikován, mohl tento formát reprezentovat pouze statické modely bez interaktivity. Tento problém byl vyřešen v roce 1997, kdy byla zveřejněna verze 2.0, známější jako VRML97. Přestože se nikdy nedočkal masového využití, stal se po svém uvedení na trh nejoblíbenější možností pro internetové 3D projetky, než byl v roce 2001 nahrazen formátem X3D (který byl zpětně kompatibilní se světy VRML). Protože se jednalo o formát souborů, nikoliv o plugin, vzniklo mnoho různých implementací VRML, které často přidávaly vlastní nestandardní funkce.",
  "Platforms_X3D_Description": "Zatím žádný popis.",
  "Platforms_Xara_Plugin_Description": "Plugin Xara byl prohlížeč vektorové grafiky používající proprietární formát s nízkou šířkou pásma. V roce 1996 byla spuštěna beta verze a později plná verze, která umožňovala prohlížet soubory Flare vytvořené pomocí programu CORELXara na internetu. Později v roce 1997 byla spuštěna aplikace Xara Webster, která speciálně vytvářela webovou grafiku pro tento plugin. V roce 1999 byla vydána poslední verze 2.08a. V roce 2000 byl Xara Webster nahrazen XaraX, který uměl exportovat do Flashe, dalšího vektorového pluginu, takže podpora vlastní proprietární varianty byla zrušena a byla odsunuta do archivu staršího softwaru.",
  "Platforms_Coming_Soon": "Již brzy",
  "Platforms_Coming_Soon_Description": "Hry a animace vytvořené na těchto platformách budou k dispozici v příští aktualizaci.",
  "Platforms_Common_Ground_Description": "Zatím žádný popis.",
  "Platforms_DjVu_Description": "Zatím žádný popis.",
  "Platforms_Jamagic_Description": "Zatím žádný popis.",
  "Platforms_Jutvision_Description": "Zatím žádný popis.",
  "Platforms_mBed_Description": "Zatím žádný popis.",
  "Platforms_MrSID_Description": "Zatím žádný popis.",
  "Platforms_PanoramIX_Description": "Zatím žádný popis.",
  "Platforms_Petz_Player_Description": "Zatím žádný popis.",
  "Platforms_Sibelius_Scorch_Description": "Zatím žádný popis.",
  "Platforms_Sizzler_Description": "Zatím žádný popis.",
  "Platforms_Ulead_COOL_360_Description": "Zatím žádný popis.",
  "Platforms_VReam_WIRL_Description": "Zatím žádný popis."
}
