{
  "Discord_Title": "Discord",
  "Discord_Intro": "Por favor, lea las reglas antes de ingresar a nuestro servidor de Discord (También pueden ser revisadas en el canal {#rules-and-faq} cuando ya estés dentro):",
  "Discord_Rule1": "Ten en cuenta tanto nuestras reglas, como las del propio Discord: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Sé respetuoso a los demás. No discrimines, no incites drama, ni menciones a otros usuarios o roles repetidamente, ni envíes mensajes privados a miembros del servidor (o los admins) sin permiso.",
  "Discord_Rule3": "Utiliza los canales designados para cada tema. Siempre lee la descripción si no estás completamente seguro de su propósito. Si un miembro del equipo te pide trasladar la conversación a otro canal, por favor, hazlo.",
  "Discord_Rule4": "No se permite la distribución de contenido que actualmente esté a la venta, o que haya solicitado su eliminación de Flashpoint.",
  "Discord_Rule5": "{Nunca envies correos relacionados con Flashpoint sin el consentimiento del equipo, sin importar lo bueno que sea.} Nadie quiere que la posibilidad de contactarse con un desarrollador se desperdicie, esa es la razón por la que queremos asegurarnos de que eso no ocurra.",
  "Discord_Rule6": "Promocionarte a ti mismo o terceros a través de invitaciones a servidores de Discord, enlaces de YouTube, enlaces con anuncios para generar dinero o similares, está prohibido, a no ser que se encuentre dentro del contexto de lo que se realiza con el proyecto Flashpoint o de la preservación digital.",
  "Discord_Rule7": "El contenido pornográfico y la discusión del mismo debe mantenerse en el canal {#nsfw-lounge} (La simple existencia del canal, separado del resto, lo explica todo).",
  "Discord_Rule8": "Discutir sobre políticas no está permitido en este servidor. O hablas sobre eso en otra parte o no lo discutes aquí para nada.",
  "Discord_Curation_Exception": "(Preservaciones - discusión específica de, y contenido incluido - son la única excepción a las reglas 7 y 8.)",
  "Discord_Sanctions": "Los miembros del equipo tienen permiso para advertir/silenciar/expulsar o banear a usuarios que sientan que están rompiendo las reglas basados en la severidad de la regla incumplida. Alentamos al equipo a mostrar liviandad ante violaciones de reglas accidentales o que hayan ocurrido por primera vez, pero las sucesivas violaciones de reglas resultarán en sanciones más severas.",
  "Discord_Agreed": "¡He leído las reglas y quiero unirme al servidor!"
}