{
  "Discord_Title": "Discord",
  "Discord_Intro": "Por favor, lee las reglas antes de ingresar a nuestro servidor de Discord (también pueden ser revisadas en el canal {#rules-and-faq} cuando ya estés dentro):",
  "Discord_Rule1": "Ten en cuenta tanto nuestras reglas, como las del propio Discord: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Sé respetuoso ante los demás. No seas molesto, no incites al odio ni menciones a otros roles o usuarios repetidamente, ni envíes mensajes privados a miembros del servidor (incluido el equipo del mismo) sin autorización.",
  "Discord_Rule3": "Utiliza los canales designados para cada tema. Siempre lee la descripción si no estás completamente seguro de su propósito. Si un miembro del equipo te pide eliminar la conversación, por favor, hazlo.",
  "Discord_Rule4": "No se permite la distribución de contenido que cuente con una versión de pago, o que haya sido solicitada su eliminación de Flashpoint.",
  "Discord_Rule5": "{Never send emails relating to Flashpoint without the consent of staff, no matter how good you think it is.} Nadie quiere que su oportunidad de contactar a un desarrollador se desperdicie, por lo que queremos asegurarnos de que no suceda.",
  "Discord_Rule6": "Promocionarte a ti mismo o terceros a través de invitaciones a servidores de Discord, enlaces de YouTube, enlaces con anuncios para generar dinero o similares, está prohibido, a no ser que se encuentre dentro del contexto de lo que se realiza con el proyecto Flashpoint o de la preservación digital.",
  "Discord_Rule7": "El contenido +18 y la discusión del mismo debe mantenerse en el canal {#nsfw-lounge} (la simple existencia del canal, separado del resto, lo explica todo).",
  "Discord_Rule8": "Las charlas políticas no se admiten en el servidor. Puedes hablarlo en otro sitio, o simplemente no hablarlo.",
  "Discord_Curation_Exception": "(Existen excepciones a la regla 7 y 8, si se trata de curaciones, contenido específico de estas o incluidos en las mismas)",
  "Discord_Sanctions": "Los miembros del equipo están autorizados a advertir, silenciar, expulsar y banear a los usuarios que crean que están rompiendo alguna regla, basándose en la gravedad de la misma. Animamos a nuestro equipo a ser benevolentes en caso de que un usuario rompa una regla accidentalmente o por primera vez, pero la gravedad del castigo aumentará en función de la cantidad de veces que un usuario rompa las reglas.",
  "Discord_Agreed": "He leído las reglas y quiero unirme al servidor!"
}