{
  "Downloads_Avast_Title": "ADVERTENCIA PARA USUARIOS DE AVAST Y AVG:",
  "Downloads_Avast_Warning": "Un archivo, necesario por el programa para poder reproducir los juegos, será detectado como virus y puesto en cuarentena; esto es un falso positivo! {Follow these instructions} para crear una regla que exima a Flashpoint. Hacemos nuestro mayor esfuerzo por mantener el archivo y las tecnologías que utiliza libres de virus. {Learn more}",
  "Downloads_Title": "Descargas",
  "Downloads_Para1": "Todas las descargas de Flashpoint son portables, gratuitas y creadas con software de código abierto (obviamente excluyendo los juegos y las plataformas como tal). La mayoría del contenido de código abierto es original, creado específicamente para el proyecto, el cual puedes encontrar en nuestra página de GitHub {here}.",
  "Downloads_Para2": "Para saber qué ha cambiado desde el origen del proyecto, revisa el {changelog}. Advertencia: es muy grande.",
  "Downloads_Para3": "{Supported operating systems:} Windows 7 SP1 y superiores, MacOS, Linux",
  "Downloads_Prerequisites": "{Prerequisites:} Visual C++ 2015 Redistributable},\n{Microsoft .NET Framework 4.7}\n(Se requiere {7-Zip} para extraer las versiones Ultimate y Core)",
  "Downloads_Content_Disclaimer_Title": "DESCARGO DE RESPONSABILIDAD SOBRE EL CONTENIDO:",
  "Downloads_Content_Disclaimer_Warning": "Flashpoint es un museo de la cultura de Internet, por lo que contiene un enorme abanico de contenido - con porciones que podrían ser ilegales, dependiendo de tu jurisdicción. Si no estás de acuerdo con esto, {download Flashpoint Infinity}, que te otorga control absoluto sobre el contenido que se almacena en tu dispositivo.",
  "Downloads_Size": "Tamaño",
  "Downloads_Size_Download": "descargar",
  "Downloads_Size_Extracted": "una vez extraído",
  "Downloads_Ultimate_Line1": "La colección completa en un enorme, pero único paquete",
  "Downloads_Ultimate_Line2": "Cada juego y animación estará disponible al instante, sin necesidad de conexión a internet",
  "Downloads_Ultimate_Line3": "Puede actualizarse utilizando el {Flashpoint Ultimate Updater}",
  "Downloads_Ultimate_Line4": "Es un archivo .7z (se recomienda el uso de {qBittorrent} y de {Free Download Manager} para la descarga del archivo torrent y la descarga directa del mismo, respectivamente)",
  "Downloads_7z_Torrent": "Descargar 7z (Torrent)",
  "Downloads_7z_Direct": "Descargar 7z (directa)",
  "Downloads_Hash_Placeholder": "(Hashes próximamente)",
  "Downloads_Recommended": "Recomendado",
  "Downloads_Size_Grows": "el tamaño del archivo aumenta con el uso",
  "Downloads_Infinity_Line1": "Un paquete ligero para usuarios casuales",
  "Downloads_Infinity_Line2": "Los juegos y las animaciones se descargan automáticamente cuando los juegas",
  "Downloads_Infinity_Line3": "Debe volverse a descargar para poder actualizarse",
  "Downloads_Infinity_Line4": "Es un archivo ejecutable de auto-extracción (extraerá el programa al directorio especificado)",
  "Downloads_Exe": "Descargar EXE",
  "Downloads_Instructions": "Instrucciones",
  "Downloads_Mirror": "Enlace alternativo de Archive.org (Windows)",
  "Downloads_Manual": "Dirígete al {help manual} para saber cómo usar/recibir soporte de Flashpoint!",
  "Downloads_Core": "También existe {Flashpoint Core}, una copia en miniatura de Flashpoint que está dirigido específicamente a contribuyentes del proyecto. Contiene entradas de ejemplo para cada plataforma, así como instrucciones para la curación. Puedes descargarlo {here}. Para saber cómo contribuir al proyecto utilizando Flashpoint Core, lee el {curation tutorial}."
}