{
  "FAQ_Title": "Preguntas frecuentes",
  "FAQ_Question1": "¿Qué/quién es BlueMaxima?",
  "FAQ_Answer1": "BlueMaxima, o Ben Latimore, es el australiano que inició el proyecto Flashpoint, y que gestiona las copias principales. No existe ningún negocio u organización asociado con Flashpoint - Se trata de un proyecto mantenido enteramente por la comunidad.",
  "FAQ_Question2": "¿Qué sistemas operativos soporta?",
  "FAQ_Answer2": "Flashpoint soporta Windows 7 SP1 y superiores (exlcuyendo la versión base de Windows 8). Las versiones para MacOS y Linux también están disponibles, aunque requieren de algunos pasos adicionales para su instalación y solo pueden ejecutar un puñado de las tecnologías de navegador más populares.",
  "FAQ_Question3": "¿Tiene Flashpoint algún tipo de problema de seguridad?",
  "FAQ_Answer3": "No, hasta donde sabemos. La aplicación completa (exceptuando el programa de instalación de la versión Infinity) no se conecta al internet abiertamente, y cualquier registro generado por el reproductor seguro de Flashpoint se eliminar una vez que el juego se cierra; todas las curaciones nuevas pasan a través de un equipo con software actualizado y de calidad; y más importante, el lanzador y todos los trabajos de Flashpoint son de código abierto y pueden encontrarse {here}. Hemos hecho nuestro mayor esfuerzo para que la colección sea lo más segura posible, pero a pesar de esto, hay algunos antivirus, como Avast o AVG, que tienden a detectar componentes importantes del programa como peligrosos. Si este problema te afecta, {read this page} para recibir instrucciones.",
  "FAQ_Question4": "¿Cuántos juegos/animaciones hay?",
  "FAQ_Answer4": "A partir de Flashpoint 11, tenemos más de 130.000 juegos y 20.000 animaciones. Puedes indagar en la colección sin descargar el programa {here}. Alternativamente, puedes ver las respectivas listas {here} y {here}.",
  "FAQ_Question5": "¿Qué plataformas ofrece la colección?",
  "FAQ_Answer5": "La aplicación soporta juegos y animaciones que corran en cualquier plataforma que se encuentre en la página de {Supported Platforms}.",
  "FAQ_Question6": "¿Qué son los juegos de Nitrome?",
  "FAQ_Answer6": "Nitrome nos pidió amablemente que retiremos su contenido de la colección. Si buscas sus juegos, puedes encontrarlos en su {website}, y si el complemento Flash no es una opción para ti, puedes ver revisar su catálogo de {HTML5-compatible catalog}. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "¿Cómo puedo solicitar un juego/animación?",
  "FAQ_Answer7": "Puedes crear una solicitud leyendo {this article} completo, y luego siguiendo los enlaces del fondo.",
  "FAQ_Question8": "¿Puedo añadir un juego/animación yo mismo?",
  "FAQ_Answer8": "Sí. Siue las instrucciones indicadas en el {curation tutorial} para iniciar tu solicitud de curador. Una vez aceptada, podrás enviarnos cuantas curaciones desees.",
  "FAQ_Question9": "Quiero contribuir de otro modo (programando, testeando, etc). ¿Cómo puedo ayudar?",
  "FAQ_Answer9": "Ingresa a nuestro {Discord server} para más detalles. La mayoría de nuestro trabajo y comunicación sucede aquí.",
  "FAQ_Question10": "¿El proyecto es de código abierto?",
  "FAQ_Answer10": "Sí... más o menos. Las fuentes de nuestra propia tecnología, como el lanzador, están disponibles en nuestra página de {GitHub}. Las fuentes para el software que incluimos en Flashpoint están disponibles de sus respectivos sitios web (no modificamos la fuente de ninguno de los software que incluimos). Los binarios de los plugins como tal no son de código abierto, pero si lo fuesen, no estaríamos aquí.",
  "FAQ_Question11": "¿Puedo usar el logotipo o está disponible bajo la licencia Creative Commons?",
  "FAQ_Answer11": "Sí - El logo se rige bajo la licencia {CC-BY 4.0}. Para atribuciones, opcionalmente, puedes dar créditos a Seirade y al proyecto Flashpoint de BlueMaxima. Puedes encontrar los archivos {here}.",
  "FAQ_Question12": "¿Dónde puedo donar al proyecto?",
  "FAQ_Answer12": "Por respeto a los artistas y desarrolladores cuyos trabajos se encuentran en Flashpoint, intentamos evitar solicitar donaciones. Aunque anteriormente realizamos {a fundraiser} para cubrir los costos de los servidores, no está en nuestros planes lanzar otra en el futuro.",
  "FAQ_Question13": "¡Flashpoint no está funcionando correctamente!",
  "FAQ_Answer13": "Sigue los pasos de solución de problemas listados en el {manual}. Si sigues teniendo problemas después, pide ayuda en nuestro Discord.",
  "FAQ_Question14": "Quiero que un juego/animación sea eliminado de Flashpoint por algún motivo.",
  "FAQ_Answer14": "Avísanos, ya sea a través de Discord o {directly by email}. Probablemente, intentaremos convencerte de permitirnos mantener tu juego por motivos de preservación histórica, pero somos razonables.",
  "FAQ_Question15": "Tengo otra pregunta.",
  "FAQ_Answer15": "Consulta nuestra sección de {extended FAQ}. Si tu pregunta no se soluciona con el contenido del mismo, ingresa a nuestro servidor de Discord."
}