{
  "FAQ_Title": "Preguntas frecuentes",
  "FAQ_Question1": "¿Esto no solía llamarse BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Sí - el proyecto operaba con BlueMaxima en su nombre hasta su retiro del proyecto en enero del 2023.",
  "FAQ_Question2": "¿Qué sistemas operativos soporta?",
  "FAQ_Answer2": "Flashpoint soporta Windows 7 SP1 y más recientes (excluyendo la versión base de Windows 8). Versiones de macOS y Linux también están disponibles, sin embargo, requieren pasos extra para instalar y solo pueden ejecutar unas pocas de las más tecnologías de navegador.",
  "FAQ_Question3": "¿Tiene Flashpoint algún problema de seguridad?",
  "FAQ_Answer3": "No que sepamos. Ninguna de nuestras aplicaciones (exceptuando la tecnología de descarga de juegos de Infinity) puede conectarse a internet; cualquier cambio en el registro realizado por Flashpoint Secure Player es eliminado luego de cerrar el juego; todas las curaciones entrantes pasan por una PC con programas antivirus competentes y actualizados; y lo más importante, el aplicativo lanzador y todas las mecánicas internas de Flashpoint {are free and open-source}. Hicimos nuestro mejor esfuerzo para asegurarnos de que la colección sea lo más segura posible, pero a pesar de todo nuestro trabajo, algunos antivirus como Avast y AVG tienden a detectar componentes importantes como peligrosos. Si te ves afectado por este problema, {read this page} para obtener instrucciones de resolución de problemas.",
  "FAQ_Question4": "¿Cuántos juegos/animaciones hay?",
  "FAQ_Answer4": "Flashpoint ofrece actualmente más de {} juegos y {} animaciones. Puedes buscar en la colección sin descargar Flashpoint {here}.",
  "FAQ_Question5": "¿Qué plataformas de navegador preserva Flashpoint?",
  "FAQ_Answer5": "Preservamos juegos y animaciones que corran bajo todas las plataformas listadas en la {statistics page} de la Base de Datos de Flashpoint.",
  "FAQ_Question6": "¿Dónde están los juegos de Nitrome?",
  "FAQ_Answer6": "Nitrome nos pidió amablemente que quitáramos su contenido de la colección. Si estás buscando sus juegos, puedes encontrarlos en su {website}, y si Flash no es una opción, revisa su creciente {HTML5-compatible catalog}. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "¿Cómo puedo solicitar un juego/animación?",
  "FAQ_Answer7": "Puedes realizar una solicitud leyendo primero {this article} completo, y luego siguiendo los enlaces que están al final del mismo.",
  "FAQ_Question8": "¿Puedo añadir un juego/animación yo mismo?",
  "FAQ_Answer8": "¡Sí! Sigue las instrucciones indicadas en el {curation tutorial} para comenzar tu audición de curador. Una vez que haya sido aceptada, podrás enviar tantas curaciones como lo desees.",
  "FAQ_Question9": "Quiero contribuir de otra manera (programando, testeando, etc.). ¿Cómo puedo ayudar?",
  "FAQ_Answer9": "Únete a nuestro {Discord server} para más detalles. La mayor parte de nuestro trabajo y comunicación ocurre allí.",
  "FAQ_Question10": "¿Flashpoint es de código abierto?",
  "FAQ_Answer10": "Si... algo así. Las fuentes para toda nuestra tecnología personalizada, tales como el programa de ejecución se encuentran disponibles en nuestro {GitHub}. Las fuentes para el software y programas que incluimos en Flashpoint se encuentran disponibles desde sus respectivos sitios web. (no modificamos la fuente de ningún tipo de software que incluimos). Los binarios para los plugins web en si mismos no son de fuente-abierta, pero si lo fuesen, no estaríamos aqui en primer lugar.",
  "FAQ_Question11": "¿Puedo utilizar el logotipo/está disponible bajo la licencia Creative Commons?",
  "FAQ_Answer11": "Sí - El logo se rige bajo la licencia {CC-BY 4.0}. Para atribuciones, opcionalmente, puedes dar créditos a Seirade y al proyecto Flashpoint. Puedes encontrar los archivos de origen {here}.",
  "FAQ_Question12": "¿Dónde puedo donar para el proyecto?",
  "FAQ_Answer12": "Flashpoint Archive opera como un colectivo sin fines de lucro. Puede encontrar más detalles sobre como donar y dónde va este dinero en nuestra {Open Collective page}.",
  "FAQ_Question13": "¡Flashpoint no está funcionando correctamente!",
  "FAQ_Answer13": "Sigue los pasos de resolución de problemas indicados en el {manual}. Si continúas teniendo problemas, pide ayuda en nuestro Discord.",
  "FAQ_Question14": "Quiero que un juego/animación sea eliminado de Flashpoint por algún motivo.",
  "FAQ_Answer14": "Avísanos, ya sea a través de Discord o {directly by email}. Probablemente, intentaremos convencerte de que nos permitas mantener tu juego por motivos de preservación histórica, pero somos razonables.",
  "FAQ_Question15": "Tengo otra pregunta.",
  "FAQ_Answer15": "Consulta nuestro {extended FAQ}. Si tu pregunta no está respondida ahí, únete a nuestro Discord."
}