{
  "About_Welcome": "Bienvenido",
  "About_Title": "Flashpoint, de BlueMaxima, es un proyecto de preservación de juegos en internet.",
  "About_Para1": "La historia y la cultura de internet es importante, y el contenido creado en plataformas web, incluyendo, pero no limitándose a, Adobe Flash, constituyen una parte importante de dicha cultura. Este proyecto está dedicado a preservar tantas experiencias de dichas plataformas como sea posible, de modo que no se pierdan en el tiempo. Desde principios de 2018, Flashpoint ha salvado más de 100.000 juegos y 10.000 animaciones, que corren en 35 plataformas diferentes.",
  "About_Para2": "Flashpoint inició en enero de 2018 por BlueMaxima, en un intento de solventar la desaparición del contenido antes de la muerte de Flash. Desde entonces, se ha convertido en un proyecto internacional, en el que participan más de 100 colaboradores, incluyendo tanto juegos como animaciones creadas con numerosos plugins, estructuras y estándares.",
  "About_Para3": "Flashpoint utiliza una gran selección de software de código abierto. Combinando el poder de Apache, un lanzador a medida, y nuestra propia aplicación llamada Flashpoint Secure Player, podemos reproducir contenido basado en web en un entorno fácil y rápido de usar, sin dejar cambios permanentes o brechas de seguridad en tu ordenador.",
  "About_Para4": "Ofrecemos dos versiones del software; la versión Ultimate, que contiene todos los medios disponibles en un formato sin conexión, y la versión Infinity, una distribución más pequeña que te permite descargar y reproducir contenido bajo demanda. Ambas versiones no se ven afectadas por la finalización del soporte de Flash y otros plugins.",
  "About_Para5": "Este proyecto es y siempre será enteramente sin ánimo de lucro, para preservar el sentido de la comunidad y compartir el contenido creado con Flash y similares. Para aprender más acerca de Flashpoint, consulta la barra ubicada en la izquierda de la página.",
  "Search_Collection": "Buscar en la colección",
  "Request_Archival": "Solicitar eliminación de contenido"
}