{
  "About_Welcome": "Bienvenido",
  "About_Title": "Flashpoint Archive es un esfuerzo comunitario para preservar juegos y animaciones de la web.",
  "About_Para1": "La historia y la cultura de Internet son importantes y la web está evolucionando a un ritmo tan rápido que lo que podría ser común hoy en día podría ser obsoleto mañana. Este proyecto se dedica a preservar tantas experiencias de estas plataformas como sea posible, para que no se pierdan en el tiempo. Desde diciembre de 2017, {más de {} juegos y animaciones} se han conservado a través de más de un centenar de plugins de navegador y tecnologías web.",
  "About_Para2": "En adición a nuestros esfuerzos de preservación, también proveemos de un paquete de programas altamente flexible para una fidedigna experiencia de navegación y reproducción del contenido preservado. Entre los programas que componen y hacen posible a Flashpoint podemos encontrar {a fully-featured launcher} que opera como la interfaz para la colección, {a proxy} que convence a los juegos de estar siendo ejecutados en la web, y {a sandbox} que posibilita la reproducción segura de contenido habilitado por plugins - todo este contenido siendo {open-source software}.",
  "About_Para3": "El proyecto {was originally started} por BlueMaxima en un intento por solventar la desaparición progresiva de juegos web previo a la muerte de Flash. Desde entonces el proyecto ha evolucionado en un esfuerzo internacional involucrando a cientos de contribuyentes comunitarios de todas partes del mundo, abarcando tanto juegos como animaciones creadas para diversos plugins de internet, frameworks y estándares.",
  "About_Para4": "Flashpoint Archive opera como un colectivo sin fines de lucro con la meta de promover esfuerzos destinados a la preservación y accesibilidad de juegos, animaciones y otras experiencias digitales interactivas de la web. Si deseas apoyarnos o averiguar más sobre como somos financiados y donde son utilizados estos fondos, porfavor utiliza el botón de Donación en la barra lateral izquierda, o visita nuestra {Open Collective page}.",
  "Search_Collection": "Buscar en la Colección",
  "Request_Archival": "Solicitar Contenido para ser Archivado"
}