{
  "News_Title": "Noticias",
  "News_Para1": "Todos los sucesos de notoriedad en la historia del desarrollo de Flashpoint a la fecha de Octubre 2019.\nDesliza el cursor sobre el código de una versión para obtener una explicación de Bluemaxima, el fundador del proyecto.",
  "News_Para2": "Un registro de modificaciones abarcando cada versión publicada anterior al cambio a un sistema basado en componentes puede ser encontrada {here}. Para descargas directas de versiones anteriores de Flashpoint Ultimate, dirigirse a las cuentas de Internet Archive pertenecientes a Bluemaxima y Dri0m, {here} y {here}, respectivamente.",
  "News_Flashpoint_Started": "El proyecto Flashpoint de Bluemaxima da inicio.",
  "News_Flashpoint_0": "Flashpoint Zero es publicado.",
  "News_Flashpoint_1": "Flashpoint versión Uno es publicado.",
  "News_Was_Released": "fue lanzado",
  "News_Flashpoint_3_0": "\"Llaves del Reino\"",
  "News_Flashpoint_3_0_Meta": "Esta versión introdujo el software \"Redirector\", la cual sería la última pieza del puzzle necesaria para hacer funcionar al servidor - permitiéndonos preservar 99,9% de juegos Flash sin necesidad de hackear. Las llaves al reino de la preservación Flash, si gustan.",
  "News_Flashpoint_3_1": "\"Noche de Apertura\"",
  "News_Flashpoint_3_1_Meta": "Esta versión fue la primera en incluir Flashpoint Theatre (aunque fue en una instancia distinta de Launchbox en ese momento).",
  "News_Flashpoint_3_2": "\"Conmoción y Pavor\"",
  "News_Flashpoint_3_2_Meta": "Esta versión fue la primera en soportar la adición de títulos Shockwave.",
  "News_Flashpoint_3_3": "\"Ultra HD\"",
  "News_Flashpoint_3_3_Meta": "Nombrada en honor al hecho de llegado este punto, superamos la cifra de 4.000 juegos en la colección, Hombre, como vuela el tiempo.",
  "News_Flashpoint_4_0": "\"El Infinito Viviente\"",
  "News_Flashpoint_4_0_Meta": "Esta versión introdujo Flashpoint Infinity, el cual permite a los usuarios transmitir juegos a través del internet. El nombre es derivado del álbum discográfico de la banda \"Soilwork\", publicado en 2013 bajo el mismo nombre.",
  "News_Flashpoint_4_1": "\"Javalidad\"",
  "News_Flashpoint_4_1_Meta": "Esta fue la versión que añadió soporte para \"Java applets\". Darkmoe tuvo la idea tras el nombre.",
  "News_Flashpoint_5_0": "\"Ir Al Lanzamiento.\"",
  "News_Flashpoint_5_0_Meta": "El programa de lanzamiento que todos conocemos y amamos fue presentado en esta versión.",
  "News_Flashpoint_5_1": "\"El Gran Filtro\"",
  "News_Flashpoint_5_1_Meta": "Las \"Playlists\" fueron añadidas en esta versión. (un filtro, si prefieren). El nombre fue derivado de la Reproducción Extendida \"RE\" de Mesarthim. El Gran Filtro.",
  "News_Flashpoint_5_2": "\"Tipo III\"",
  "News_Flashpoint_5_2_Meta": "El \"Gran Filtro\" y \"Tipo III\" son las dos RE's de Mesarthim que a menudo van juntas. No se nos ocurrió ningún otro nombre cuando lo requeríamos.",
  "News_Flashpoint_5_3": "\"Revolución\"",
  "News_Flashpoint_5_3_Meta": "Esta versión fue lanzada en cercanía al aniversario de 1 año de Flashpoint, y sentimos que verdaderamente fue una revolución. (Adicionalmente hacemos notar que originalmente el plan inicial era que se llamase \"Orbit\", pero en retrospectiva, ese era un nombre estúpido para el concepto.)",
  "News_Flashpoint_5_4": "\"Recombinación\"",
  "News_Flashpoint_5_4_Meta": "Esta versión mudó a las animaciones junto a los juegos, los cuales previamente se encontraban en carpetas separadas con clientes separados.\n\"Recombinación\" y \"74%\" también son nombres derivados de dos canciones en el álbum de Mesarthim titulado \"El Parámetro Densidad\".",
  "News_Flashpoint_5_4_1": "\"74%\"",
  "News_Flashpoint_5_4_1_Meta": "Un rápido set de parches realizados en conjunto al lanzamiento de la versión 5,4. No es como si Flashpoint 5,4 solo estuviese un 74% completado al momento que lo lanzamos.",
  "News_Flashpoint_5_5": "\"Hierro y Cobre\"",
  "News_Flashpoint_5_5_Meta": "Bluemaxima se encontraba jugando un poquito mucho de \"Deus Ex\" en este momento.",
  "News_Flashpoint_6_0": "\"Alineamiento\"",
  "News_Flashpoint_6_0_Meta": "Otra referencia a Mesarthim!",
  "News_Flashpoint_6_1": "\"Preservaciónware\"",
  "News_Flashpoint_6_1_Meta": "Un juego de palabras con los términos de programática comúnmente utilizados en tecnología, tales como \"Freeware\" y \"Shareware\".",
  "News_Flashpoint_6_2": "\"El Gran Escape de Moe\"",
  "News_Flashpoint_6_2_Meta": "El miembro del personal Darkmoe procuró una cantidad verdaderamente irreal de juegos del género Escapar-del-Cuarto en esta versión.",
  "News_Flashpoint_6_3": "\"Estamos Hablando Sobre Juegos Flash, No Sobre Filosofía Abstracta\"",
  "News_Flashpoint_6_3_Meta": "Nombrada en honor a una cita fuera de contexto de nosamu, un miembro del personal.",
  "News_Old_Releases_Title": "\"Línea de Tiempo Retroactiva de Lanzamientos\"",
  "News_Old_Releases_Description": "Debido a una columna de noticias que solo existió desde Diciembre de 2019, la gran mayoría de los lanzamientos hasta ese punto no habían sido catalogados.\nEsta sección da cuenta de las versiones faltantes.",
  "News_Is_Available": "ya está disponible!",
  "News_Grab_Download": "Puedes obtenerla en la {downloads page}",
  "News_Flashpoint_Update_October_2019": "La actualización de estado de Flashpoint para Octubre de 2019 se encuentra ahora disponible en Medium. Revísala {here}.",
  "News_Flashpoint_Update_November_2019": "La actualización de estado de Flashpoint para Octubre de 2019 se encuentra ahora disponible en Medium. Revísala {here}.",
  "News_Flashpoint_7_0": "\"Ocho Mil Horas\"",
  "News_Flashpoint_7_0_Meta": "Ocho Mil Horas era en promedio el tiempo que le quedaba de vida a Flash al momento del lanzamiento.",
  "News_Flashpoint_7_1": "\"Permanece en el Objetivo\"",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7,0, de acuerdo a nuestros estándares, se lanzó en estado de desastre. 7,1 fue una actualización densamente compuesta por correcciones de errores.",
  "News_Featured_Kotaku_Link": "¡Hemos sido destacados en Kotaku!",
  "News_Featured_Kotaku_Rest": "Este es un logro masivo. ¡Gracias por todo vuestro apoyo!",
  "News_Flashpoint_Update_March_2020": "La actualización de estado de Flashpoint para Marzo de 2020 se encuentra ahora disponible en Medium. Revísala {here}.",
  "News_Flashpoint_Update_April_2020": "La actualización de estado de Flashpoint para Abril de 2020 se encuentra ahora disponible en Medium. Revísala {here}.",
  "News_Flashpoint_8_0": "\"301\"",
  "News_Flashpoint_8_0_Meta": "Esta versión vio la decomisión del software \"Redirector\", el cual fue previamente utilizado para hacer funcionar nuestro servidor. El código de HTTP \"301\" se refiere a algo \"movido de manera permanente\", como, algo que ya no redirecciona.",
  "News_Flashpoint_Update_June_2020": "La mini-actualización de estado de Flashpoint para Junio de 2020 se encuentra ahora disponible en Medium. Revísala {here}.",
  "News_Flashpoint_8_1": "\"Espíritu de Aventura\"",
  "News_Flashpoint_8_1_Meta": "Nombrada en referencia a una línea del entonces reciente, álbum \"Realidad del Aether\", de \"Los Vikingos Campesinos del Infierno\". Para ser específico, la canción \"Una Palabra Vacía\".",
  "News_Flashpoint_Update_August_2020": "La actualización de estado de Flashpoint para Agosto de 2020 se encuentra ahora disponible en Medium. Revísala {here}.",
  "News_Flashpoint_8_2": "\"Aproximándonos al Planeta Nueve\"",
  "News_Flashpoint_8_2_Meta": "Un \"portmanteau\" (un poco forzado, debo admitir) de \"Aproximándonos a la versión nueve.\" y \"Planeta Nueve\", el RE de Mesarthim.",
  "News_Flashpoint_9_0": "\"Puesta de Sol Gloriosa\"",
  "News_Flashpoint_9_0_Meta": "Nombrada en referencia a \"Amanecer Glorioso\", la canción conocida por aparecer en \"Age of War\". Esta fue la última versión en ser lanzada previo a la muerte de Flash, por lo tanto \"Puesta de Sol\".",
  "News_Flashpoint_Update_April_2021": "La actualización de estado de Flashpoint para Abril de 2021. Revísala {here}.",
  "News_Flashpoint_10_0": "\"Ausencia\"",
  "News_Flashpoint_10_0_Meta": "Esta sería la primera versión en ser lanzada en una era de internet post-Flash, por lo tanto se le dio el nombre \"Ausencia\". También coincidentemente este es el nombre de la última canción de la RE de Mesarthim llamada \"Solución Vacío\".",
  "News_Flashpoint_10_1": "\"Ausencia II\"",
  "News_Flashpoint_10_1_Meta": "Adelante, adivina.",
  "News_Flashpoint_11": "Ups, Solo Complementos!",
  "News_Flashpoint_11_Meta": "Es un meme, porque la versión 11 incluyó tres docenas de complementos nuevos.",
  "News_Flashpoint_11_1": "\"Operación Flor de Cerezo\"",
  "News_Flashpoint_11_1_Meta": "Una referencia al juego Muv-Luv (cómpralo en Steam).",
  "News_Flashpoint_12": "\"Ajolote\"",
  "News_Flashpoint_12_meta": "Son lindos y son geniales."
}