{
  "News_Title": "Noticias",
  "News_Description": "Todos los eventos destacables en la historia de Flashpoint desde octubre de 2019.",
  "News_Flashpoint_Started": "El proyecto Flashpoint fue iniciado por BlueMaxima.",
  "News_Flashpoint_0": "Se lanzó Flashpoint Zero oficialmente.",
  "News_Flashpoint_1": "Se lanzó la Flashpoint Version Uno.",
  "News_Was_Released": "fue lanzado",
  "News_Flashpoint_3_0": "Llaves del Reino",
  "News_Flashpoint_3_0_Meta": "Esta versión introdujo el Redirector, que fue la última pieza del rompecabezas en lograr que la configuración del servidor funcionara - permitiéndonos preservar el 99.9 % de los juegos Flash sin métodos de hackeo. Las llaves al reino de la preservación del contenido Flash, si lo prefieres así.",
  "News_Flashpoint_3_1": "Noche de estreno",
  "News_Flashpoint_3_1_Meta": "Esta versión fue la primera en tener Flashpoint Theatre (aunque era una instancia separada de LaunchBox en ese momento).",
  "News_Flashpoint_3_2": "Shock and Awe",
  "News_Flashpoint_3_2_Meta": "Esta versión fue la primera en soportar títulos de Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Nombrado tras el hecho de que superamos los 4.000 juegos en la colección en este punto. El tiempo vuela.",
  "News_Flashpoint_4_0": "El infinito viviente",
  "News_Flashpoint_4_0_Meta": "Esta versión introdujo Flashpoint Infinity, que permite a la gente transmitir juegos desde Internet. Este nombre fue tomado del album de 2013 de Soilwork con el mismo nombre.",
  "News_Flashpoint_4_1": "Javality",
  "News_Flashpoint_4_1_Meta": "Esta versión introdujo soporte para applets de Java. El nombre se le ocurrió a DarkMoe.",
  "News_Flashpoint_5_0": "Go For Launch",
  "News_Flashpoint_5_0_Meta": "El lanzador que todos conocemos y amamos se introdujo en esta versión.",
  "News_Flashpoint_5_1": "El gran filtro",
  "News_Flashpoint_5_1_Meta": "Aquí se introdujeron las playlists (o filtros, si lo prefieres). El nombre se tomó del EP de Mesarthim, \"The Great Filter\".",
  "News_Flashpoint_5_2": "Tipo III",
  "News_Flashpoint_5_2_Meta": "\"The Great Filter\" y \"Type III\" son dos EPs de Mesarthimm que a menudo se ponen juntos. No apareció ningún otro nobre cuando lo necesitamos.",
  "News_Flashpoint_5_3": "Revolución",
  "News_Flashpoint_5_3_Meta": "Esta versión fue lanzada cerca del primer año de Flashpoint, y sentimos que era una verdadera revolución. (Originalmente iba a llamarse \"Órbita\", pero era un nombre tonto para el concepto.)",
  "News_Flashpoint_5_4": "Recombinación",
  "News_Flashpoint_5_4_Meta": "Esta versión juntó las animaciones con los juegos, que anteriormente estaban en carpetas separadas y en clientes separados. \"Recombinación\" y \"74%\" también son los nombres de dos canciones en el album de Mesarthim \"The Density Parameter\".",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Fue un conjunto de parches rápidos creados mientras se subía la versión 5.4. Esto no significa que Flashpoint 5.4 estuviera al 74 % cuando lo lanzamos.",
  "News_Flashpoint_5_5": "Hierro y Cobre",
  "News_Flashpoint_5_5_Meta": "BlueMaxima estaba jugando un poquito en exceso al Deus Ex en ese momento.",
  "News_Flashpoint_6_0": "Alineación",
  "News_Flashpoint_6_0_Meta": "¡Otra referencia a Mesarthim!",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "Un juego de palabras con términos de software habitualmente usados, como \"freeware\" y \"shareware\".",
  "News_Flashpoint_6_2": "La Gran Huída de Moe",
  "News_Flashpoint_6_2_Meta": "El miembro del equipo DarkMoe realizó la curación de una cantidad inmensa de juegos de la categoría Escape Room.",
  "News_Flashpoint_6_3": "Hablamos de Juegos Flash, no de Filosofía Abstracta",
  "News_Flashpoint_6_3_Meta": "Nombrado así por una improvisación de nosamu, un miembro del equipo.",
  "News_Old_Releases_Title": "Línea de tiempo retroactiva de versiones",
  "News_Old_Releases_Description": "Debido a que la columna de noticias existe desde diciembre de 2019, la mayoría de las versiones lanzadas hasta ese punto no fueron catalogadas. Esta sección tiene en cuenta dichas versiones.",
  "News_Is_Available": "ya está disponible!",
  "News_Grab_Download": "Descárgalo desde la {downloads page}",
  "News_Flashpoint_Update_October_2019": "La actualización de estado de Flashpoint para octubre de 2019 ya está disponible en Medium. Revísalo {here}.",
  "News_Flashpoint_Update_November_2019": "La actualización de estado de Flashpoint para noviembre de 2019 ya está disponible en Medium. Revísalo {here}.",
  "News_Flashpoint_7_0": "Ocho Mil Horas",
  "News_Flashpoint_7_0_Meta": "Cerca de ocho mil horas, aproximadamente, fue el tiempo de vida que le quedaba a Flash cuando se lanzó esta versión.",
  "News_Flashpoint_7_1": "Mantener el Objetivo",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0, según nuestros estándares. fue un desastre. La versión 7.1 fue un enorme parche de solución de errores.",
  "News_Featured_Kotaku_Link": "¡Hemos aparecido en Kotaku!",
  "News_Featured_Kotaku_Rest": "Este es un hito enorme. ¡Gracias por todo el apoyo!",
  "News_Flashpoint_Update_March_2020": "La actualización de estado de Flashpoint para marzo de 2020 ya está disponible en Medium. Revísalo {here}.",
  "News_Flashpoint_Update_April_2020": "La actualización de estado de Flashpoint para abril de 2020 ya está disponible en Medium. Revísalo {here}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Esta versión vio el final del software Redirector, anteriormente usado para hacer funcionar al servidor. El código HTTP 301 fue \"movido permanentemente\", ya que no volvió a redireccionar.",
  "News_Flashpoint_Update_June_2020": "La actualización de estado de Flashpoint para junio de 2020 ya está disponible en Medium. Revísalo {here}.",
  "News_Flashpoint_8_1": "Espíritu de Aventura",
  "News_Flashpoint_8_1_Meta": "Nombrado por una línea del reciente album de Aether Realm: Redneck Vikings from Hell. Específicamente, la canción \"One Hollow Word\".",
  "News_Flashpoint_Update_August_2020": "La actualización de estado de Flashpoint para agosto de 2020 ya está disponible en Medium. Revísalo {here}.",
  "News_Flashpoint_8_2": "Acercándose al Planeta Nueve",
  "News_Flashpoint_8_2_Meta": "El nombre fue extraido de \"Approaching versioon nine\" y Planet Nine, el EP de Mesarthim.",
  "News_Flashpoint_9_0": "Glorioso Atardecer",
  "News_Flashpoint_9_0_Meta": "Nombrado por \"Glorious Morning\", una canción mayormente conocida por ser la canción principal del juego Age of War. Esta fue la última versión lanzada antes de la muerte de Flash, por eso el \"atardecer\".",
  "News_Flashpoint_Update_April_2021": "La actualización de estado de Flashpoint para abril de 2021 ya está disponible en Medium. Revísalo {here}.",
  "News_Flashpoint_10_0": "Ausencia",
  "News_Flashpoint_10_0_Meta": "Esta fue la primera versión en lanzarse tras la muerte de Flash, por eso el nombre \"Ausencia\". También fue el nombre de la última canción del album de Mesarthim \"Vacuum Solution\".",
  "News_Flashpoint_10_1": "Ausencia II",
  "News_Flashpoint_10_1_Meta": "Venga, adivina.",
  "News_Flashpoint_11": "Ups, Cuántos Plugins!",
  "News_Flashpoint_11_Meta": "Es un meme, porque la versión 11 añadió tres docenas de plugins nuevos."
}