{
  "Platforms_Title": "Plataformas Compatibles",
  "Platforms_Description1": "Flashpoint es compatible con varios juegos y animaciones creados para un sin fin de plugins de navegador y otros - no solo flash. Esta seccion contiene un vistaso por la historia de la tecnologia a partir de laversion 11. Para ver estatisticas actualizadas para cada una de las entradas porfavor visita la {Flashpoint Database}.",
  "Platforms_Description2": "Esto funciona como un medio para responder las preguntas \"¿qué?, ¿quién? ¿cuándo? ¿Dónde? y ¿Por qué?\" ademas funciona como un punto de inicio para investigar, esto no es un analisis profundo de la historia de cada plataforma. Intentamos mostrar datos exactos, aun asi pueden haber errores. asi que si este es el caso por favor ponte en contacto con nosotros.",
  "Platforms_By": "por",
  "Platforms_3D_Groove_GX_Description": "Fundada en 1998, The Groove Alliance fue la desarolladora de 3D Groove SX, un motor 3D basado en el motor shockwave. Luego en 2002, el motor dejaria de usar Shockwave para asi usar su propio motor llamado 3D Groove GX. Ambas variaciones podian ser usadas para el desarollo de juegos de navegador y aplicaciones de escritorio. Esto resulto ser un exito para The Groove Alliance, Acomulando una gran cantidad de empresas las cuales crearon juegos de alto perfil de series de television y otras marcas. En 2008 cuando el hype acabo, The Groove Alliance se transformo en OTOY, pero el sitio de 3D Groove se mantuvo en linea hasta 2009. Actualmente se desconocen las razones exactas del porque The Groove Alliance desaparecio, pero se sabe que hubieron peleas internas.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (antes conocido como 3D Life Player, Virtools Player, y NeMo Web Player, no ser confundido com 3DVIA Studio/Beta Player o 3DVIA Composer Player) fue un plugin de navegador hecho por Dassault Systèmes para reproducir experiencias 3D hechas en Virtools. Estaba diseñado para cosas avanzadas, como por ejemplo para aplicaciones 3D como entrenamientos basados en computadoras, tours virtuales y bienes raíces. 3DVIA Player tambien fue usado para hacer juegos de navegador, algunos de sus primeros usuarios con este fin fueron: el estudio ubicado en quebec. Sarbakan y la compañia de juegos ubicada en Amsterdam. Little Chicken. La ultima actualizacion, la version 5.0, fue lanzada en 2009. La pagina de descarga estuvo activa los siguientes años hasta que fue tomado de baja en 2016. Para entonces, habia sido instalado mas de 30 millones de veces.",
  "Platforms_AboutPeople_Description": "Aún no hay una descripción.",
  "Platforms_AboutTime_Description": "Aún no hay una descripción.",
  "Platforms_ActiveX_Controls_Description": "Lanzado en 1996 por Microsoft, ActiveX fue un framework que servia para encapsular programas como contenedores para usarlos en otros programas, llamado ActiveX Controls. Podia integrarse dentro de contenido HTML, y se podian crear controles para usarse en internet explorer, para asi reproducir los juegos de navegador. Despues del lanzamiento de Edge en 2015, este programa quedo obsoleto, y su uso para aplicaciones web habia acabado, siendo relegado a Internet Explorer 11 para compatibilidad con software antiguo.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Comenzó su desarrollo en 1996 bajo el nombre V30 por Rocket Science Games, posteriormente sería transferido a Attitude Software y siendo renombrado como 3D Anarchy, para finalmente ser vendido a Adobe en 2000 y ser renombrado en 2001, Atmosphere Player es un plugin web hecho para observar mundos 3D interactivos, similar al estándar VRML, creado en Atmosphere Builder.\nMayoritariamente fue concebido para galerías virtuales multimedia, las cuales podrían presentar imágenes, audio y video en conjunción a los propios modelos 3D. Cuando originalmente tuvo inicio como 3d Anarchy, el software aún se encontraba en estado Beta para el momento en que Adobe adquirió esta tecnología para continuar su desarrollo, tras lo que cuál pasaria los siguientes 3 años en testéo Beta, siendo la última versión lanzada la 1,0, en Febrero de 2004. En Diciembre de 2004 fue anunciado que Atmosphere sería descontinuado, con soporte al mismo siendo completamente cortado en Enero de 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (también conocido simplemente como Flash, y anteriormente como Macromedia Shockwave Flash Player) es un reproductor de animaciones de vectores y gráficos, a menudo incluyendo interactividad añadida. Fue utilizado como un conducto para juegos web debido a su nivél de compresión efectivo, bajo precio, facilidad de uso y extensa base de uso e instalación. Desarrollado en 1995 y originalmente lanzado por FutureWave en 1996, era capaz de poco más que animaciones básicas y botones con los que controlarlas. A medida que ganó popularidad, funciones más avanzadas fueron añadidas al reproductor, tales como el lenguaje de programación ActionScript. Sin embargo, a medida que los usuarios se volvieron más conscientes sobre sus potenciales riesgos de seguridad, y en conjunción con un auge en popularidad de HTML5 entre los diseñadores web, Adobe anunció el \"fin de vida\" para Flash, con fecha de 31 de Diciembre de 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (también conocido como Shockwave, y anteriormente como Macromedia Shockwave Flash Player o Shockwave Director Player) es un reproductor de medios interactivos lanzado en 1995. Construido a base de tecnología desarrollada con 10 años de anterioridad por Macromind, se convirtió en un plugin web solo tras su adquisición por Macromedia. A diferencia de Flash, Shockwave presentaba el lenguaje de programación Lingo, y soporte para C++ a través del uso de Xtras, otorgandole al reproductor un amplio rango de capacidades entre las cuales se incluía 3D. Vio amplio uso durante las etapas iniciales del internet y en juegos de CD-ROM, adquiriendo masiva popularidad. La plataforma vió un significante declive en su popularidad en respuesta a la adquisición de Macromedia a manos de Adobe, en favor de la utilización de Flash, el cuál se encontraba en un proceso de rápida expansión en términos de capacidades en adición a también ser propiedad de Adobe. Finalmente en Febrero de 2019, Adobe anunció su descontinuación y cortó el soporte a su desarrollo dos meses después.",
  "Platforms_Alambik_Plugin_Description": "Alambik Plugin es un reproductor web para contenido hecho en Alambik, una plataforma de desarrollo. Lanzado en 2001, era capaz de gráficos 2D y 3D, vectores y muchas otras aplicaciones prácticas. En 2002, Alambik sostuvo un concurso con premios para celebrar el lanzamiento de Alambik Script. En 2004, Alambik creó una nueva página web demo, sin embargo posterior a esto la compañia cayó en silencio y nunca lanzó nada nuevo para dicha plataforma, ni actualizó el plugin.",
  "Platforms_Ambulant_Description": "Ambulant es un reproducto para archivos SMIL, creado por numerosos participantes en coordinación mutua en CWI en Amsterdam, Países Bajos. El nombre parece ser referencial al término \"ambulación\", una palabra distinta para el acto de caminar; esto es reforzado por su logo, el cúal muestra a una persona caminando. SMIL fue una especificación hecha por W3C, el consorcio internacional web, sin embargo no logró alcanzar mucha popularidad.\nAmbulant intentó ser un reproductor de código abierto, u open source, que otorgase soporte a todos los archivos SMIL. Sin embargo el deseo de que todas sus partes fuesen de código abierto evitó que pudiesen soportar otros formatos de media con propiedad. Su desarrollo inicio en Abril de 2003 y la primera versión, \"AMBULANT/G\" fue lanzada en Julio del mismo año. La última versión estable, 2,6 fue lanzada en Febrero de 2015, sin embargo el trabajo en alcanzar una versión estable de Ambulant 2,7 continuó hasta Julio de 2016, cuando se realizó la última edición de su repositorio Github. Los desarrolladores de Ambulant continuan siendo activos en otros proyectos.",
  "Platforms_AnimaFlex_Description": "AnimaFlex fue un plugin de reproducción de gráficos que podía reproducir animaciones con un pequeño tamaño de archivo, realizados con RubberWeb Composer, pudiendo estirar y distorsionar imágenes. Era capáz de comenzar a reproducir animaciones antes de que el archivo total hubiese terminado de descargarse, en adición a ajustarse a la velocidad de conexiónes de internet más lentas. A pesar de su promesa, el mismo Rubberflex contaba con multiples productos distintos, todos capaces de exportación gif, compitiendo con su propiedad central, e incluso lanzaron FlexToGif para convertir archivos Plugin a Gif 2 días después del lanzamiento del plugin. Para el inicio de 1998, RubberWeb Composer cesó su distribución, dejando a AnimaFlex sin un programa autor.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics fue un programa de presentaciones creado en 1986 por Software Publishing Corporation (SPC) para MS-DPS PCs. Posterior a su transición a Windows en 1991, falló en preservar la relevancia de mercado que alguna vez tuvo y perdió contra Powerpoint. En 1996, Allegro New Media (Renombrados a Vizacom posteriormente durante ese año.) adquirió SPC y Serif. SPC creó ASAP WordPower, un programa que habilitaba la fácil creación de presentaciones de diapositivas, las cuales podrían ser publicadas en la web utilizando el plugin de ASAP WebShow. SPC se combinó con Serif en 1997. 1998 vió la revitalización de la marca Harvard, con la llegada del programa de autoría Harvard Graphics 98, y el plugin sería remplazado por uno nuevo, bajo el nombre Harvard Graphics Webshow. En el año 2000, Advanced Presentations, la nueva versión del programa de autoría, se exportaría al estándar Flash en lugar del formato propietario de plugin. Vizacom vendería Serif de vuelta a su equipo de manejo originario en 2001, lo que relegaría al rango de productos Harvard a programas de tipo legado, siendo soportado y posteriormente vendido hasta ser descontinuado en el año 2017.",
  "Platforms_Authorware_Web_Player_Description": "Authorwave Web Player fue creado por Macromedia en el año 1996 como una de las nuevas prestaciones de Authorware 3,5. Se creó como una forma de ejecutar programas interactivos desarrollados en base a Macromedia Authorware en la web. A diferencia de la mayoría de los plugins, el uso primario de Authorware era el auxiliar en proceso de e-learning o aprendizaje electrónico, llevando a su uso en negocios y el campo académico como una manera de reunir materiales de aprendizaje multimedia sin la necesidad de contar con experiencia en programación. La versión final del plugin fue publicada en 2004, previo a la adquisición de Macromedia por Adobe en 2005, tras lo cual su desarrollo se estancaría hasta el anuncio de su descontinuación en el año 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Aún no hay una descripción.",
  "Platforms_AXEL_Player_Description": "AXEL Player fue un plugin de contenido 3D interactivo creado por MindAvenue en 2002. Fue una conducto para modelos y animaciones originadas del programa de autoría AXELedge, y AXELpublisher, los cuales convertían archivos de otros programas 3D como 3ds Max. El programa fue recibido positivamente por críticos, a pesar de un par de limitaciones, una de ellas siendo la ausencia de muchos usuarios para el plugin. En 2005, MindAvenue fue adquirido por 20-20 Technologies, quienes se especializaban en diseño interior y programas de desarrollo de mueblería, y en 2006 su sitio web se convirtió en una página de redirección a 20-20. Posteriormente todos los productos de la marca AXEL incluyendo el presente plugin fueron descontinuados.",
  "Platforms_BitPlayer_Description": "BitPlayer fue una aplicación de escritorio basada en la tecnología Flash y Shockwave, creada en 1999 por la compañia Alemana BitMagic. Ofrecía cortos diarios, producidos de manera local y por clientes, que eran a menudo acompañados por publicidad y cuestionarios.\nInicialmente avaluada a $6 millones de dólares, cayó victima al crash dot-com en sucesión a sus publicistas, y cesó producción completamente en Enero de 2001. Al día de hoy, la mayoría de su contenido ha sobrevivido en la forma de archivos convertidos a SWF, a pesar de haber perdido la funcionalidad añadida que el reproductor originario ofrecía.",
  "Platforms_Blender_Description": "Blender es un programa de herramientas 3D creado en 1994 por el estudio de animación Alemán NeoGeo. Su primera versión fue lanzada en 1995. La compañía fue disuelta en 1998, pero el copropietario Ton Roosendaal crearía Not a Number Technologies (NaN) con el fin de continuar el desarrollo de Blender. La versión 2,0, también conocida como GameBlender, fue lanzada en el año 2000 y representó un punto de cambio en dirección a la interactividad y desarrollo de juegos. Debido a esto, el plugin de navegador fue lanzado en el año 2001, inicialmente en beta abierta, con una segunda beta lanzada en Enero de 2002. A pesar de un éxito temprano, hubieron problemas financieros y NaN cerraría sus puertas a comienzos del año 2002. Roosendaal entonces decidiría volver a Blender en un programa de código abierto y tuvo éxito en el proceso, luego de comprar de vuelta las acciones de sus inversores a través de crowdfunding. Intentos de continuar el desarrollo del plugin fueron hechos, pero su transformación a programa de codigo abierto resultó en la pérdida de componentes para el motor de juego; su restauración se convirtió en la prioridad máxima y el desarrollo del plugin se puso en pausa. La última versión se mantuvo disponible por un par de años-siempre dejando en claro que no habian planes para soportarla a futuro ni lanzar una nueva versión-antes de ser removida por completo en 2005.",
  "Platforms_Burster_Description": "Burster fue una implementación en 2010 del Blender Game Engine del año 2000. El proyecto fue un intento de revivir un plugin oficial lanzado en conjunción a Blender, el cual fue descontinuado debido a motivos de seguridad. Este mejoraba por sobre el original, tomando ventaja de la existencia de nuevas versiones del motor con el fin de lograr mejor desempeño y gráficos. La última versión fue lanzada en 2013, y tras 3 años sin ningúna actualización, Burster fue oficialmente descontinuado en 2016. El motor de juego como tal fue removido de Blender en 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin es una herramienta de productividad creada por Logic Pulse en 1996. Fue una nueva prestación añadida a la versión 3,2 de Calendar Quick, una aplicación de escritorio con funciones de calendario y programación. Le permitía a los usuarios publicar las mismas a través de una función de exportación a páginas de internet, las cuales podian ser vinculadas a otras personas y vistas a través del plugin. Posterior a la corrección de un bug de Y2K en 1999, el sitio web cayó en abandono sin ninguna actualización posterior, hasta que cesó su funcionamiento en el año 2001.",
  "Platforms_Cult3D_Description": "Cult3D fue un visualizador web para contenido 3D creado en base al programa de autoría Cult3D Designer. Disfrutó de éxito moderado, alcanzando los 6 millones de usuarios en 2001 y multitud de clientes notables, contando con la implementación de más opciones de importación para modelos 3D de otros programas a lo largo del tiempo. 5,3 fue su última versión, lanzada en el año 2002, con la última actualización ocurriendo en el año 2004, llegado este punto, la tecnología fue vendida a Mental Images GmbH. Posteriormente, Nvidia compraría Mental Images en 2007, transformándose en la subsidiario Nvidia Advanced Rendering Center. A pesar de que su sitio web recibiría actualizaciones, el plugin no recibiría ninguna, y llegado el inicio de 2011, dejaría de ser expuesta por completo como una opción viable, y la página de descargas solo en pos de usuarios que todavía poseían una licencia de autoría, para luego desaparecer llegado el año 2013.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion fue una línea de programas de RA (Realidad aumentada) que iniciaron su desarrollo en 1999 a manos de Total Immersion, quienes harían uso de cámaras de video para mostrar objetos 3D en tiempo real. Uno de estos programas sería D'Fusion @Home, lanzado en 2008, y posteriormente con un plugin en 2009. Aplicaciones para él fueron creadas usando el programa de autoría D'Fusion Studio, y su foco principal estuvo orientado a publicidd y experiencias transitorias. Para el año 2011, la tecnología encontraba problemas en alcanzar el uso popular. Aún teniendo acceso a una implementación Flash más accesible, y con un programa de autoría ahora en gratuidad, su adopción siguió siendo limitada. Siguiendo al auge del smartphone, TryLive fue desarrollada como otra solución basada en RA con la que facilmente previsualizar productos tales como muebleria y lentes, lo que la volvería exitosa a diferencia de la linea D'Fusion la cual recibiría ninguna actualización posterior al año 2013. En 2015, la compañia fue vendida a ACEP, una compañia de lentes.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Aún no hay una descripción.",
  "Platforms_DPGraph_Description": "Creado en 1999 por David Parker, DPGraph (Dynamic Photorealistic Graphing) es un programa ejecutable dedicado a mostrar gráficos a través de páginas web. Es capaz de animarlos y mostrar hasta 8 dimensiones, con control de variables. Funcionaba descargando un archivo en una página web que le comunicaría al navegador que ejecutase el programa para renderizar los gráficos. Una versión completa fue licenciada a diversas instituciones para su uso en salas de clase y de estudio para crear gráficos, al igual que fue liberada como un reproductor gratuito con el cual verlos. Posteriormente recibiría una actualización en 2016, y en 2019 la versión completa de DPGraph se volveria libre de uso para todos.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) fue un plugin de animación lanzado por Sharp en 2001. Diseñado con dispositivos móviles en mente tales como celulares y PDA's, fue lanzado para una limitada selección de modelos de celular exclusivamente en Japón, al igual que como un plugin de navegador. Se enorgullecía en el bajo tamaño de sus archivos y en poseer gráficos de vectores que cabían en todo tipo de pantallas móviles. La tecnología fue lanzada a audiencias Americanas en 2002 bajo el nombre SharpMotionART. Ningúna duraría mucho, ya que e-animator lanzaría su última actualización en 2003 y SharpMotionArt sería discontinuado en 2004.",
  "Platforms_Envoy_Description": "Envoy fue un formato de documentos desarrollado en 1993 por Tumbleweed Software, creado a través de la impresión virtual de estos en WordPerfect. Fue un competidor a Adobe Acrobat y su formato PDF. WordPerfect Corporation fue vendida a Novell en 1994, lo que incluía a Envoy, pero Tumbleweed continuaría trabajando con Novell, creando un plugin web en 1995 para visualizar archivos online. Novell vendería WordPerfect a Corel en 1996, pero retuvo propiedad de Envoy. Llegado 1999, Novell habría dejado de desarrollar Envoy, y Corel detendría el soporte para Envoy con el lanzamiento de WordPerfect 2000. Esto terminaría la colaboración entre Tumbleweed y Novell posterior a la adquisición de Envoy en 1994, y todo soporte por el plugin cesaría.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) es un plugin de animación ligero desarrollado por Sharp en 1997. Contó con múltiples versiones en el programa de autoría empaquetadas con computadoras Sharp y destinadas a distintas demográficas, con la principal siendo \"EVA Animator\". Una versión orientada a público infantil se lanzaría bajo el nombre “EVA Animator Kids”, en conjunto a un sitio web llamado エバキッズクラブ (EVA Kids Club) lanzado en 2000. Estos serían discontinuados en el año 2007 y reemplazados con la aplicación de nivel intermedio \"Eva Animator School II\" en el año 2007. La última actualización mayor al plugin vendría en el año 2002, con uno fix de bugs menor siguiendo en 2008, sin embargo mantendría una pequeña pero dedicada comunidad de usuarios, hasta que Sharp cerraría el sitio web central en 2016.",
  "Platforms_Flatland_Rover_Description": "Rover es un plugin 3D basado en lenguaje 3DML desarrollado en 1997 por Flatland. Usuarios podían crear \"Spots\" o \"Puntos\" con el programa de autoría Spotnik, hechos en base a \"Levels\" o \"Niveles\", conteniendo \"Blocks\" o \"Bloques\" para facilitar el diseño, y ejecutarlos con Rover, siendo disponible en forma de plugin de navegador al igual que programa independiente. Su desarrollo se mantuvo animado hasta el crash de la burbuja dot-com, cuando la mayoría de su equipo de desarrollo se desmantelaría, con una última actualización lanzada en el año 2005, y su sitio web siendo abandonado antes de cerrar completamente en el año 2012. Uno de sus anteriores desarrolladores, Michael Powers, decidió revivir el sitio web en 2014, crear un archivo del programa, y actualizarlo para permitir su ejecución en sistemas modernos. La app independiente de Rover fue rediseñada en 2017, pero el plugin no regresaría.",
  "Platforms_Formula_One_Description": "Aún no hay una descripción.",
  "Platforms_Fractal_Viewer_Description": "Aún no hay una descripción.",
  "Platforms_FreeHand_Description": "FreeHand fue una suite creativa de gráficos de vectores de 1988 creada por Altsys Corporation. Macromedia compró FreeHand en 1994, y continuaría su desarrollo. En Octubre de 1996, FreeHand 7,0 fue lanzada con un plugin para la web, llamado Shockwave para FreeHand. El plugin permitía que imagenes de vectores creadas por el programa pudiesen ser insertadas y visualizadas en una página web. En Noviembre de 1996, Macromedia compraría FutureSplash, otro plugin web de gráficos de vectores, la cual renombrarían a Flash.\nFreeHand 8,0 fue lanzada posteriormente en 1998, y ahora  exportaría a Flash, en lugar de al plugin de FreeHand. La última versión del programa, FreeHand MX, fue lanzada en 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "El plugin GoBit Games fue creado en 2008 por GoBit, un pequeño estudio independiento compuesto por antiguos empleados de PopCap. Su primero juego, Burguer Shop, sería lanzado en Octubre de 2007 y por demanda popular recibiría una demo web jugable 4 meses después, utilizando su entonces nuevo Games Plugin. Pasaría un año, y la demo sería reconstituida como un juego publicitario para Eggo, publicado en Shockwave.com el 1 de Febrero de 2009. El plugin fue abandonado poco tiempo después con el lanzamiento de Burguer Shop 2 - con su respectiva demo web ahora utilizando Flash - lo que dejaría a Burguer Shop y su reskin como los únicos juegos alguna vez creados para este plugin.",
  "Platforms_HotSauce_Description": "Meta Content Framework (MCF) fue un formato estructurante de metadata desarrollado por Apple Computer's Advanced Technology Group inicialmente en el año 1995, y en 1996 Project X se volvería un plugin experimental creado para su visualización a través del internet, posteriormente conocido como HotSauce, sería capaz de demostrar archivos de tipo sitemap en un espacio 3D. Llegado el final de 1996, más de 200 sitios web utilizaban HotSauce, para luego alcanzar más de 300, tras lo cual se formaría un contrato con NetCarta con el fin de crear una biblioteca compuesta por más de 30,000 sitios web capaces de ser navegados a través del uso del plugin. A pesar de que el estándar MFC ganaría un cierto éxito, la mayoría de los usuarios no veían una ventaja en este método de visualización 3D, y el proyecto como uno de muchos otros cancelados por Steve Jobs con su retorno a Apple en 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage es un lenguaje estándar para visualizar documentos a través de un navegador web. Originalmente desarrollado por Tim Berners-Lee a través del inicio de los 1990's (con raíces yendo tan atrás como los 1980's) HTML se volvería el método principal para compartir información a través del Internet, con sus capacidades siendo ampliamente expandidas por otros lenguajes tales como CSS y JavaScript. Fue lanzado por primera vez en 1993, y recibió actualizaciones subsecuentes en la forma de HTML2 en 1995, y tanto HTML3 como HTML4 en 1997. La última actualización a HTML4 se llevó a cabo en el año 2000, y en los años posteriores sus lenguajes añadidos serían generalmente ignorados como una plataforma para juegos, animaciones y otro contenido web, con desarrolladores optando en su lugar por tecnología basada en plugins, pero a medida que el internet evolucionaba, los plugins comenzaron a volverse obsoletos, de manera que un esfuerzo fue lanzado con el fin de actualizar el estándar, y como resultado en 2008 HTML seria lanzado. A medida que Flash y otros plugins pasarian de moda, HTML5 se volvió el estándar recomendado, con muchos desarrolladores habiendo cambiando sus proyectos a la familia HTML como resultado - o abandonado sus plugins completamente - en su lugar subiendo su contenido a sitios web como Youtube. {Nota: Por razones de brevedad, Flashpoint etiqueta toda entrada que no contiene contenido habilitado por frameworks o plugins como \"HTML\".}",
  "Platforms_HyperG_Description": "Hyper-G fue un Web Content Management System (WCMS) o Sistema de Manejo de Contenido Web basado en Gopher, desarrollado por el Institute for Information Processing and Computer Supported New Media (IICM) de Graz University of Technology, en Austria el año 1995. Fue una alternativa a los sistemas Hyperlink de la World Wide Web, haciendo uso de navegadores activados a Hyper-G, siendo capaz de visualizar modelos 3D de directorios y archivos, al igual que otros modelos a través de un visualizador integrado. Debido a estar basado en el ya potencialmente obsoleto modelo Gopher, el predecesor de la WWW evolucionaría posteriormente a Hyperwave en el año 1996, esto sin las capacidades extra que los navegadores activados para Hyper-G ofrecian, tal como funcionalidad 3D. La amplia mayoria de su contenido se encuentra perdída hoy por hoy, debido como sus archivos eran almacenados con Gopher.",
  "Platforms_Hypercosm_Player_Description": "Basado en tecnología en desarrollo desde 1989, Hypercosm es un reproductor de contenido 3D originalmente lanzado en 1999. La compañia propietaria realizaría una amplia inversión que finalmente no llegaría a buen puerto, y acabaría siendo una de las muchas víctimas del crash de burbuja dot-com, doblegándose en el año 2001. Sin embargo la compañia originaria sería comprada por ORBITEC, y gracias a un contrato con NASA, la compañia logró mantenerse a flota y rebotar de vuelta, pudiendo continuar su trabajo en nuevos proyectos hasta su re-estructuración en el año 2012, cuando fue puesta en pausa por ORBITEC hasta que un socio de negocios demostrase interés en trabajar con dicha tecnología. Tal cosa nunca sucedió, llevando a que Hypercosm cerrara sus puertas en el año 2016.",
  "Platforms_Illuminatus_Description": "Aún no hay una descripción.",
  "Platforms_iPix_Description": "Aún no hay una descripción.",
  "Platforms_Java_Plugin_Description": "Lanzados en conjunción con el lenguaje de programación Java en la forma de una de sus funciones, Java Applets fueron pequeñas aplicaciones de Windows integradas en paginas web con el fin de capacitarlas con funcionalidad interactiva extra. Fueron creadas para tener compatibilidad cruzada con otros sistemas operativos y navegadores, al igual que para ser mas poderosas que el estándar HTML. Producto de esto permanecería como una alternativa capaz por más de 10 años, sin embargo con la llegada de 2013, la tecnología soportante de Applets comenzaría a perder su soporte en la mayoría de los navegadores, volviendose imposible de usar en muchos de ellos, lo que conduciría a su desuso llegado el año 2017, y su total remoción de Java SE 11 en el año 2018.",
  "Platforms_JCAMPDX_Description": "Aún no hay una descripción.",
  "Platforms_Lightning_Strike_Description": "Aún no hay una descripción.",
  "Platforms_LiveMath_Plugin_Description": "El plugin LiveMath es una aplicación para matemática interactiva, especializada en crear una ventana que pudiese contener formulas, gráficos, y otras funciones matemáticas a ser insertas en una página web.\nOriginalmente fue lanzada bajo el nombre Theorist en 1989 por Prescience Corporation, con el plugin web siendo lanzado en el año 1994, posteriormente sería renombrado a MathView en 1997 luego de ser adquirida por Waterloo Maple, para posteriormente ser comprada por MathMonkeys y renombrada a LiveMath en 1999. En el año 2014, en presencia de crecientes problemas de incompatibilidad con nuevos navegadores, el plugin fue retirado, siendo remplazado por una versión standalone o independiente de visualización llamada LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Aún no hay una descripción.",
  "Platforms_MHSV_Description": "Siendo originalmente lanzado en estado alpha bajo el nombre VSV ({V}irtual {S}pace {V}iewer), y posteriormente siendo renombrado a MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), fue un plugin desarrollado por ParaGraph que permitía la visualización de mundos 3D interactivos hechos utilizando el programa de autoría VHSB ({V}irtual {H}ome {S}pace {B}uilder), el cual podía crear tanto mundos MHSV interactivos, como mundos estáticos VRML. En 1996, el desarrollo del estándar VRML 2,0 añadiría otro grado de interactividad, y ParaGraph actualizaría VHSB con el fin de permitir la creación de mundos VRML 2,0, sin embargo ParaGraph decidiría trabajar conjunto con Silicon Graphics y su reproductor visualizador Cosmo VRML 2,0, adaptando VHSB para que trabajase de manera más armoniosa con este, abandonando a MHSV en el proceso. Silicon Graphics adquiriría ParaGraph en 1997 para create Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Desarrollado por Microsoft en respuesta a Flash y Java, y lanzado en 2007, Silverlight es una herramienta multimedia que se enfoca en la transmisión de video, siendo notable por ser utilizada por Netflix. Versiones posteriores añadirian mayores capacidad para otras aplicaciones. Disfrutó de un decente grado de popularidad, con un grado de adopción de 64,7% en el año 2011. Sin embargo, en 2012 y con el anuncio del fin de la era NPAPI, el lanzamiento de Windows 8 y el inicio de la era de adopción de HTML5, Microsoft descontinuaría el programa, y en 2015 junto al lanzamiento de Windows 10, entró en una etapa de fin-de-vida, siendo completamente discontinuado en Octubre de 2021.",
  "Platforms_NoteWorthy_Composer_Description": "Aún no hay una descripción.",
  "Platforms_O2C_Player_Description": "Parte de la linea de o2c (objects to see, u objetos que ver), el o2c Player fue un plugin web 3D desarrollado en 1999 con el fin de mostrar objetos y escenas, fue desarrollado por la compañia Alemana mb Software AG. La compañia posteriormente vendería la tecnología o2c a ELECO plc en 2003, quienes diseñaron y lanzaron una versión 2,0 del reproductor o2c en 2005, brindando con esto una mucho mejor aceleración 3D y rendimiento, y sería calificada como una herramienta CAD para Arquitectos. El soporte para mayor diversidad de navegadores fue añadida, pero ya no se lanzarían actualizaciones mayores para este, en su lugar las actualizaciones consistirían primariamente de soluciones a bugs. Desde el año 2021, el plugin sigue estando disponible para descarga, pero Elcosoft ha enfocado su atención a una implementación en Unity WebGL de la tecnología.",
  "Platforms_Octree_View_Description": "Habiendo comenzado como un plugin antiguo llamado PicTree Viewer o Picview, sería posteriormente rediseñado como el nuevo plugin Fastview previo a ser renombrado en el año 1999, Octree View es un visualizador de objetos 3D basado en tecnología Voxel, en desarrollo desde al menos el año 1980, el cual hace uso de camaras especiales y escáners laser para crear imágenes. La compañia a cargo continuaría haciendo uso de su tecnología y de dicho plugin, sin embargo en el año 2007 su sitio web dejaría de ser actualizado, permaneciendo al día de hoy sin actividad.",
  "Platforms_Pixound_Description": "Pixound fue un plugin artístico de música, lanzado en 1996 como parte de un proyecto conjunto entre Hologramophone Research y Frankfurt Balkind Partners. Actuaría en la forma de un teclado MIDI que utilizaba los valores de tonalidad de imágenes para producir distintas notas y tonos. En el año 2003 Hologramophone cambiaría su nombre a Techné Media. Para el año 2005, el plugin fue abandonado en favor de desarrollar una aplicación independiente de uso exclusivo para para Mac OS X. Posteriormente se volvería una app de iOS en 2011.",
  "Platforms_Play3D_DeepV_Description": "Play3D fue un plugin 3D lanzado en 1996 por Heads Off, solo para ser renombrada y re-lanzada el año siguiente bajo el nombre DeepV. Más allá de un puñado de ejemplos. La aplicación vio poco uso a lo largo de su vida útil. El sitio web del programador fue dado de baja en 2001.",
  "Platforms_PointPlus_Description": "Pointplus fue un plugin destinado a la inserción de presentaciones de tipo Powerpoint en la web, desarrollada por Net-Scene, fue lanzada en Mayo del año 1996 para Windows NT y 95. Se posicionó a si mismas como una alternativa al entonces más complejo Macromedia Shockwave, siendo pensada con usuarios de nivel novato en mente, con el fin de permitirles usar el estándar PowerPoint. Llegado Noviembre del mismo año, un visualizador Java habia sido diseñado que contaba con funciones de compatibilidad cruzada entre plataformas y esto sin requerir ningún plugin. Se mantendría como una alternativa para casos especializados, sin embargo la linea del producto dejaría de recibir actualizaciones en 1997. El sitio web se apagaría por completo a comienzos del año 2001.",
  "Platforms_PopCap_Plugin_Description": "El plugin PopCap fue un plugin diseñado con el propósito de demostrar las demos de juegos creadas por el equipo de diseño de PopCap. Durante sus inicios, la compañia en cuestión utilizaba Java para sus demos de juegos online debido a su alta accesibilidad. Posteriormente sin embargo, la atención se enfocaría al desarrollo de un plugin propietario de la compañia que pasaría a estar disponible como un controlador de ActiveX y un plugin de Firefox tradicional. Esto le daría a PopCap el beneficio de poseer su propia plataforma propietaria para la distribución de sus demos. Sin embargo, su baja utilización tanto por la clientela como por PopCap misma llevaría a que los diseñadores optarían por utilizar en su lugar a la más popular alternativa, Flash llegado el año 2007.",
  "Platforms_ProtoPlay_Description": "ProtoPlay fue un plugin destinado a demostrar prototipos para interacción de los consumidores con productos, y la simulación de sus propiedades. Lanzado en el año 1996, hizo uso del programa de autoría Altia Design para crear aplicaciones, consistentes de sprites en 2D con elementos interactivos. El plugin era más utilitario que otra cosa en naturaleza, y no fue publicitado de manera activa al año 2003, existiendo en su lugar como una propiedad que se encontraba disponible de ser requerida. Altia Design y el plugin siguieron recibiendo actualizaciones para mejor su funcionalidad, y en el año 2007 una nueva herramienta de Photoshop sería creada bajo el nombre de PhotoPro, permitiendo crear apps de plugin. En 2009, Altia Inc. cambiaría su enfoque al diseño de interfaces de usuario, dejando atrás su prototipado de software, y a ProtoPlay en el proceso.",
  "Platforms_Pulse_Player_Description": "Comenzando su desarrollo en 1997 bajo el nombre 3rd Degree, Pulse Player fue un plugin 3D con un foco en animación. Originalmente lanzado en 1999 con respaldo y financiamiento de multitud de miembros experimentados en el campo del contenido de internet, sería utilizado por variados clientes notables. El plugin fue comercializado como una plataforma tanto creativa como divertida, y pareció experimentar éxito, sin embargo al inicio del año 2001 hubo un cambio en el foco al que la compañia apuntaba, y cambiarian su imagen en búsqueda de un foco más serio como herramienta educacional y de negocios. En 2003, 5,2 fue la última versión lanzada, y poco tiempo después su soporte sería finalizado.",
  "Platforms_REBOL_Plugin_Description": "REBOL es un lenguaje de programación diseñado a lo largo de 20 años y lanzado en 1997, en 2004 un prototipo experimental para un plugin web de REBOL sería creado, en conjunto con una página conteniendo diversos ejemplos. El plugin iniciaría como ActiveX para Internet Explorer exclusivamente, sin embargo en 2006 una version plugin para otros navegadores seria lanzada. A pesar de esto, y poco tiempo después, la última actualización sería lanzada, dejandolo en estado beta como un prototipo inseguro.",
  "Platforms_ShiVa_Web_Player_Description": "Creado por Stonetrip, y llamado Ston3D Web Player previo a 2007, ShiVa Web Player fue un plugin de contenido web 3D destinado a ejecutar programas hechos en ShiVa 3D Engine. Permitía la visualización de escenas 3D complejas con iluminación y físicas, a la vez que requería poco poder de procesamiento. Stonetrip posteriormente se renombraría en 2013 a ShiVa Technologies SAS y se enfocaría exclusivamente en el motor gráfico.\nCon la remoción de NPAPI de la mayoría de los navegadores, el soporte para el plugin se redujo, llevando a que la URL de multitud de archivos nucleares del proyecto se apagase en 2018, y como resultado rompiendo el funcionamiento de la mayoria de sus juegos, finalmente en 2019 su descarga sería removida del sitio web de ShiVa.",
  "Platforms_Show_It_Description": "Show It! fue un plugin lanzado en 1997 en conjunto con WordPerfect Suite 8 como una de las características clave de Corel Presentations 8, un competidor de PowerPoint. Cuando los usuarios exportasen con la opción de Internet Publisher, serían capaces de exportar las presentaciones ya fuese en la forma de una exposición de diapositivas estáticas, o como un proyector inserto utilizando un archivo propietario que funcionaria igual que la aplicación de escritorio original, preservando toda funcionalidad, que el plugin requiriese. Continuaría siendo soportado en WordPerfect Office 2000 con Presentations 9, pero para el año 2001, el soporte por el plugin fue desfasado de Presentations 10 en WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Aún no hay una descripción.",
  "Platforms_Squeak_Etoys_Description": "Squeak fue una plataforma de fuente-abierta, lanzada en el año 2001, con el fin de crear contenido educativo y de entretenimiento. Los usuarios podrían crear pequeñas aplicaciones destinadas a ser usadas por niños de diferentes grupos etarios, desde los más jovenes, llamados \"Etoys\", a usuarios mayores con grados \"Omniuser\" y \"Expert\". En el año 2008 cambiaría su nombre a Etoys, y modificaría su enfoque hacia los niños más jovenes. Etoys 5 fue la última versión del plugin, lanzada en 2012. El desarollo de una versión del programa para JavaScript dio inicio en 2013 por preocupaciones relacionadas a seguridad, dejando el plugin originario en estado de abandono y reemplazo.",
  "Platforms_Superscape_Viscape_Description": "Lanzado en 1996 por el entonces pionero del 3D Superscape con el apoyo de Intel, y originalmente llamado VisNet, Viscape fue un plugin 3D que poseía una distintiva ventaja de interactividad con sus mundos, a diferencia de los modelos estáticos de VRML 1,0. Disfrutó de un breve momento de popularidad, e inicialmente no hubieron planes de contemplar soporte para VRML, sin embargo con VRML97 implementando interactividad, una actualización denominada Viscape Universal fue lanzada en 1998, añadiendo soporte para VRML con el fin de manteneser relevante. Esto probaría no ser suficiente, y con problemas financieros y asociaciones fallidas a la vuelta de la esquina, en adición a usuarios llamando al plugin anticuado e incómodo de utilizar, sus esfuerzos de revivir al plugin se dificultarían.\nSi bien la última actualización fue lanzada en el año 2000, su tecnología seguiría siendo utilizada en la serie Superscape's Lego Creator lanzada el año siguiente.\nSe llevaría a cabo un intento de actualización, integrando el plugin con Java Applets, bajo el nombre Vislite, sin embargo la compañia terminaría enfocandose en desarrollo de juegos móviles y alcanzarían éxito moderado antes de ser comprados por Glu Mobile en 2008.",
  "Platforms_Surround_Video_Description": "Aún no hay una descripción.",
  "Platforms_SVF_Viewer_Description": "Aún no hay una descripción.",
  "Platforms_Tcl_Plugin_Description": "Desarrollado por un equipo pequeño y lanzado en 1988, Tool Command Language (Tcl, pronunciado como \"tickle\" o \"cosquilleo\") es un lenguaje dinámico de programación de fuente-abierta. En 1994, Sun Microsystems incorporaría al equipo creativo con el fin de desarrollar la tecnología. Uno de los resultados de este proceso fue un plugin desarrollado en 1996 que era capaz de ejecutar Applets Tcl (\"Tclets\") insertados en páginas web. Para finales de 1997, el desarrollo de Tcl's fue derivado a una compañia independiente llamada Scriptics, para posteriormente ser derivado nuevamente a Tcl Core Team en el año 2000.\nSi bien el desarrollo de dicho lenguaje continúa avanzando aún en el presente, el desarrollo del plugin se ha ralentizado de manera exponencial a pesar de no haber sido oficialmente discontinuado. La última versión, 3.1.0, fue lanzada en el año 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer fue un plugin multimedia desarrollado por Parable Corporation en 1997, quienes posteriormente cambiarían su nombre a ThingWorld en 1998. Este crearía recursos llamados \"Things\" o \"Cosas\" que podrían opcionalmente ser protegidos contra robo o manipulación y poseerían una ID única con crédito a ser compartido entre sitios web, utilizando una programación simple y modular, para crear cosas simples como imágenes, o más complejas como animationes e incluso juegos interactivos, hechos en base al programa de autoría ThingMaker o convirtiendo archivos de Shockwave Director a través de ThingConverter. Era relativamente popular, incluso llegando a obtener contratos con Microsoft y muchas otras compañias en 1999, sin embargo para finales del 2000, la compañia realizaría una reducción de staff y comenzarían a contemplar una fusión con una agrupación desconocida con el fin de vender la tecnología. El sitio web se cerraría en 2002.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine es un motor de juego multiplataforma que fue pensado teniendo como objetivo el hacer el diseño de videojuegos en un proceso más accesible, y es el programa de tercera-fuente para diseño de videojuegos más popular en el mundo. Creado en conjunción al mismísimo Unity y siendo implementado en su primer parche en 2005, Unity Web Player fue una herramienta que permitiría jugar juegos Unity en un entorno web. Se mantuvo como una plataforma popular para juegos 3D, sin embargo con la remoción del soporte a NPAPI en 2016, el plugin fue abandonado en favor de Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual Webmap fue una herramienta para visualizar mapas interactivos insertados en una página web. Era compatible con variedad de archivos de mapa de diversos programas de autoría, era capaz de mostrar información detallada sobre sectores, y permitir al usuario tomar medidas. Posterior a su lanzamiento en 1997, no se realizarían más avanzas con la tecnología, manteníendose estanca hasta que su página web se cerraría en 2004.",
  "Platforms_Vitalize_Description": "Creado en 1997 por Corel con el fin de mostrar contenido hecho con su programa de autoría multimedia Click&Create, Vitalize! fue un plugin de bajo ancho de banda dedicado a juegos web simples con un énfasis en jugabilidad, mercadotécnia y publicidad. Distribuido con la ayuda de Europress, se enorgullecía en ser \"fácil de aprender y usar a diferencia de Java o Shockwave.\" En algún momento de 1999 los anteriormente empleados de Corel se desprenderían con el fin de crear Clickteam, grupo que retomaría el desarrollo de este plugin en 2000 con el lanzamiento de la version 2,0. La última versión 4,0 fue lanzada en 2007/2008, y se mantuvo disponible en su sitio web hasta 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage es un estándar 3D y el primero en ser creado para la web. Cuando fue inicialmente especificado en Noviembre de 1994, el formato solo podria representar modelos estáticos sin ninguna interactividad. El problema fue solucionado en 1997 cuando la versión 2.0, mejor conocida como VRML97 fue publicada. A pesar de nunca haber llegado a ver uso masivo, se volvería la opción más popular para 3D basado en uso de internet al momento de su lanzamiento, previo a ser reemplazado por X3D en el año 2001 (el cual sería retrogradamente compatible con mundos VRML). Dado que fue un tipo de formato para archivos y no un plugin como tal, muchas distintas implementaciones han sido hechas a base de VRML, a menudo añadiendo sus propias características no estándar.",
  "Platforms_X3D_Description": "Aún no hay una descripción.",
  "Platforms_Xara_Plugin_Description": "Xara Plugin fue un visor de gráficos vectorizados, utilizando un formato propietario de bajo ancho de banda. Fue lanzado en estado beta y posteriormente como lanzamiento completo en el año 1996, siendo capaz de visualizar archivos de tipo Flare construidos con CORELXara en la web. Posteriormente en 1997 Xara Webster fue lanzado específicamente para realizar los gráficos web del plugin. En 1992, 2.08a fue la última versión lanzada. En el año 2000, Xara Webster fue remplazado por XaraX, el cúal era capaz de exportar a Flash, otro plugin de vectores, por lo cual el soporte para su propia opción propietaria fue cancelado, y terminó siendo relegado al archivo de programas de tipo legado.",
  "Platforms_Coming_Soon": "Próximamente",
  "Platforms_Coming_Soon_Description": "Juegos y animaciones creadas en estas plataformas estarán disponibles en la próxima actualización.",
  "Platforms_Common_Ground_Description": "Aún no hay una descripción.",
  "Platforms_DjVu_Description": "Aún no hay una descripción.",
  "Platforms_Jamagic_Description": "Aún no hay una descripción.",
  "Platforms_Jutvision_Description": "Aún no hay una descripción.",
  "Platforms_mBed_Description": "Aún no hay una descripción.",
  "Platforms_MrSID_Description": "Aún no hay una descripción.",
  "Platforms_PanoramIX_Description": "Aún no hay una descripción.",
  "Platforms_Petz_Player_Description": "Aún no hay una descripción.",
  "Platforms_Sibelius_Scorch_Description": "Aún no hay una descripción.",
  "Platforms_Sizzler_Description": "Aún no hay una descripción.",
  "Platforms_Ulead_COOL_360_Description": "Aún no hay una descripción.",
  "Platforms_VReam_WIRL_Description": "Aún no hay una descripción."
}
