{
  "FAQ_Title": "よくある質問",
  "FAQ_Question1": "元々は「BlueMaxima's Flashpoint」という名前だったのじゃないですか？",
  "FAQ_Answer1": "そうです。BlueMaximaさんが2023年1月にプロジェクトを辞めたときまで、その名前を使っていました。",
  "FAQ_Question2": "どのオペレーティングシステムがサポートされていますか？",
  "FAQ_Answer2": "Windows 8を除き、Windows 7 SP1 以降はサポートされています。MacOSやLinuxの版もありますが、インストールするのが大変で、実行できる規格はただほんのわずかです。",
  "FAQ_Question3": "Flashpointを使うことには、セキュリティーの危険性がありますか？",
  "FAQ_Answer3": "危険性がないと思います。Infinity版のダウンロード機能を除き、このアプリケーションスイートはインターネットに接続しません。Flashpoint Secure Playerによって行われたレジストリの変更はゲームを閉じるとたんに削除されます。新しいキュレーションは全部、まず強いウイルス対策ソフトを持っているPCでチェックしています。それに、Flashpointのランチャーやバックエンドは無料でオープンソースのソフトウェアです。\nコレクションの安全性を確認するために一生懸命努力していますが、あるウイルス対策ソフト（Avast、AVG等）がFlashpointの重要なコンポネントを脅威と間違うことがあります。そのような問題がある方はこのトラブルシューティング情報ページ（{read this page}）を読んでください。",
  "FAQ_Question4": "ゲーム・アニメーションはどれくらい持ってますか？",
  "FAQ_Answer4": "Flashpointは現在、{}以上のゲーム、{}以上のアニメーション動画を持っています。Flashpointをダウンロードすることなしに、コレクションを検索することができます。コレクションの検索は{こちら}。",
  "FAQ_Question5": "Flashpointはどのブラウザ規格を保存していますか？",
  "FAQ_Answer5": "Flashpointのデータベースの{statistics page}に記載してある規格で作成したゲームとアニメーションを保存しています。",
  "FAQ_Question6": "Nitromeのゲームを持っていますか？",
  "FAQ_Answer6": "Nitromeのゲームをコレクションから削除するよう法人に要請されていました。Nitromeのゲームをプレイしたい方はぜひ公式サイト（{website}）に行ってください。Flashはもう使えないゲームの場合は、{HTML5-compatible catalog}を見てみてください。\n{Flashpoint does not condone harassment over Nitrome's decision.}（Flashpointは、この判断によってNitromeに脅かしをすること等を容認してはいません。）",
  "FAQ_Question7": "どうやってゲームやアニメーション動画の追加を依頼しますか？",
  "FAQ_Answer7": "この記事（{this article}）を全部読み、最後のリンクをアクセスしてください。",
  "FAQ_Question8": "自分でゲームやアニメーションを追加できますか？",
  "FAQ_Answer8": "できます！キュレーターの申請を作るには、{キュレーションのチュートリアル}に書いてある指示に従ってください。受理されると、自由にキュレーションを投稿することができるようになります。",
  "FAQ_Question9": "寄付以外に手伝いたいです（プログラミング、テスティング等）。どうやって手伝うことができますか？",
  "FAQ_Answer9": "詳しくはまず{Discordのサーバー}に参加してください。作業や情報交換の大半がそこで行われます。",
  "FAQ_Question10": "Flashpointはオープンソースですか？",
  "FAQ_Answer10": "そうですがそうではないです。ランチャーなどのカスタムで開発したコンポーネントのソースは{GitHub}で入手できます。Flashpointのアプリに含まれているソフトウェアのソースは、それぞれの公式サイトで入手できます（含まれているソフトウェアのソースを編集していません）。プラグインのバイナリならオープンソースではないが、そうでなければこれほど努力をするのが必要はないでしょう。",
  "FAQ_Question11": "Flashpointのロゴを利用してもいいですか？クリエイティブ・コモンズで利用ですか？",
  "FAQ_Answer11": "利用できます。ロゴは{CC-BY 4.0}ライセンスの素材です。クレジットのため、FlashpointやSeiradeさんを表示することが任意です。ソースファイルは{こちら}。",
  "FAQ_Question12": "どうやって寄付することができますか?",
  "FAQ_Answer12": "Flashpointは、非営利団体として活動しています。寄付する方法と寄付金の行方については{Open Collectiveのページ}をご覧ください。",
  "FAQ_Question13": "Flashpointのアプリには何か機能していません。",
  "FAQ_Answer13": "マニュアル（{manual}）に書いてあるトラブルシューティングの手順に従ってください。問題が解決していない場合は、Discordで聞いてください。",
  "FAQ_Question14": "何かの理由で、Flashpointのコレクションからゲーム・アニメーションを削除したいです。",
  "FAQ_Answer14": "Discordや{メール}で知らせてください。歴史を保存するためにそのエントリーを削除しないようにあたなを説得してみますが、無理にしません。",
  "FAQ_Question15": "別の質問があります",
  "FAQ_Answer15": "追加の質問ページ（{extended FAQ}）を読んでください。まだ質問が答えていない場合は、Discordのサーバーに参加して、そこに聞いてください。"
}