{
  "Platforms_Title": "Supported Platforms",
  "Platforms_Description1": "Flashpoint supports games and animations created for a variety of web plugins and standards - not just Flash. This page contains an overview of each technology, alongside their entry counts as of version 11.",
  "Platforms_Description2": "This serves as a \"Who? When? What?\" summary & starting point for further research, it is not a comprehensive history of each platform. We try our best to present accurate facts, but errors are still possible. Please contact us with relevant information for corrections.",
  "Platforms_By": "tarafından",
  "Platforms_Entries": "Entries",
  "Platforms_Entry": "Entry",
  "Platforms_3D_Groove_GX_Description": "Founded in 1998, The Groove Alliance was the developer of 3D Groove SX, a Shockwave-enabled 3D game engine. Later on in 2002, the engine would branch out from Shockwave and into its own thing called 3D Groove GX. Both variations could be used for the development of online games and desktop applications. This proved to be a success for the company, amassing a large corporate user base and leading to the creation of several high-profile titles for TV shows and other big properties. After the hype fizzled out, The Groove Alliance was reshaped into OTOY in 2008, but the 3D Groove website stayed online until 2009. The exact cause of the original company’s demise is unknown, but internal struggles were confirmed to have taken place.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (formerly 3D Life Player, Virtools Player, and NeMo Web Player, not to be confused with 3DVIA Studio/Beta Player or 3DVIA Composer Player) was a browser plugin by Dassault Systèmes for the playback of 3D experiences made in Virtools. It was meant for advanced, practical applications of 3D such as computer based training, virtual tours and real estate. 3DVIA Player was also used for webgames, with some of its primary users for this purpose being Quebec-based game studio Sarbakan and the Amsterdam-based Little Chicken Game Company. The last update, version 5.0, was released in 2009. The download page would stay up for the coming years until it was taken down in 2016. By then, it had been installed more than 30 million times.",
  "Platforms_AboutPeople_Description": "No description yet.",
  "Platforms_AboutTime_Description": "No description yet.",
  "Platforms_ActiveX_Controls_Description": "Released in 1996 by Microsoft, ActiveX was a software framework which served as a standard that allowed encapsulating programs as containers for use in other unrelated programs, called ActiveX Controls. They could be embedded into HTML content, and single purpose Controls could be created specifically for use in Internet Explorer, for the purpose of webgame playback. After the launch of Edge in 2015, the software was deprecated, and its use for web applications has seemingly ceased, being relegated to Internet Explorer 11 for legacy software support.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Starting development in 1996 as V3O by Rocket Science Games, later transferred to Attitude Software being renamed 3D Anarchy, and then sold to Adobe in 2000 and rebranded in 2001, Atmosphere Player is a web plugin made for viewing interactive 3D worlds, similar to the VRML standard, created in Atmosphere Builder. It was mostly intended for virtual media galleries, which could present images/audio/video and the 3D models themselves. When it first started as 3D Anarchy, the software was still in Beta when Adobe acquired the tech for further development, where it spent the next 3 years in beta testing, and the last release version 1.0 of the Player was released in February 2004. In December 2004 it was announced that Atmosphere would be discontinued, with support being cut in January 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (also just Flash, formerly Macromedia Shockwave Flash Player) is a player for vector animations and graphics, often with added interactivity. It was used as a medium for webgames due to its effective compression, low price, ease of use and large install base. Developed in 1995 and first introduced by FutureWave in 1996, it was capable of little more than basic animations and buttons to control them. As it gained popularity, more advanced features were added to the player, such as the ActionScript programming language. However, as people grew wary of its potential security concerns, and HTML5 spiked in popularity among web developers, Adobe announced Flash’s End-of-Life date to be December 31st, 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (also Shockwave, formerly Macromedia Shockwave Player or Shockwave Director Player) is a player for interactive media released in 1995. Built on technology that had been in development 10 years earlier by MacroMind, it became a web plugin only after its acquisition by Macromedia. Unlike Flash, Shockwave featured the Lingo scripting language and C++ support through the use of Xtras, giving the player a wide range of capabilities including 3D. It saw widespread use on the early internet and on CD-ROM games, and gained mainstream popularity. The platform saw a significant decrease in popularity following Adobe's acquisition of Macromedia in favor of Flash, which was rapidly expanding feature-wise and was now owned by Adobe as well. Finally in February 2019, Adobe announced its discontinuation and cut support two months later.",
  "Platforms_Alambik_Plugin_Description": "The Alambik Plugin is a web player for content made with Alambik, a development platform. Released in 2001, it was capable of 2D and 3D graphics, vectors and many other applications. In 2002, Alambik held a contest with prizes to celebrate the release of Alambik Script. In 2004, Alambik created a new demos website, but after that the company went silent and never released anything new for the platform or updated the plugin.",
  "Platforms_Ambulant_Description": "Ambulant is a player for SMIL files, made by numerous individuals coordinating at CWI in Amsterdam, Netherlands. The name appears to reference “ambulation”, another word for walking; this is further supported by the logo appearing to be someone walking. SMIL was a specification made by W3C, the international web consortium, but failed to gain much popularity. Ambulant attempted to be an open source player that supports all SMIL files. However, the desire to make all parts open source prevented them from supporting some proprietary media formats. Development began in April 2003 and the first version, “AMBULANT/G” was released in July of that year. The last stable version, 2.6, was released in February 2015, however work on an unstable build of Ambulant 2.7 continued until July 2016, when the last commit to their Github repo was made. The developers of Ambulant are still active on other projects.",
  "Platforms_AnimaFlex_Description": "AnimaFlex was a graphics playback plugin that could play animations with a small file size, made with RubberWeb Composer, that could stretch and distort images. It could start playing animations before the whole file was downloaded and adjust to slower internet speeds. Despite its promises, RubberFlex itself had several other products, all exporting gifs, competing with their proprietary option, and even launched FlexToGif to convert Plugin files to gifs 2 days after the plugin. By the start of 1998, RubberWeb Composer ceased distribution, leaving AnimaFlex without an authoring program.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics was a presentations program created in 1986 by Software Publishing Corporation (SPC) for MS-DOS PCs. After their transition to Windows in 1991, it failed to regain the market share it had and lost to PowerPoint. In 1996 Allegro New Media (renamed to Vizacom later that year) bought SPC and Serif. SPC created ASAP WordPower, a program to easily create slideshows, that could be published on the web using the ASAP WebShow plugin. SPC merged with Serif in 1997. 1998 saw the Harvard brand revitalised with the Harvard Graphics 98 authoring program, and the plugin was replaced with a new one called Harvard Graphics WebShow. In 2000 Advanced Presentations, the new version of the authoring software, exported to the Flash standard instead of the proprietary plugin format. Vizacom sold Serif back to their original management in 2001, which relegated the Harvard range to legacy software, being supported and sold until being discontinued in 2017.",
  "Platforms_Authorware_Web_Player_Description": "The Authorware Web Player was created by Macromedia in 1996 as one of the new features of Authorware 3.5. It was made as a way to run interactive programs developed with Macromedia Authorware on the web. Unlike most web plugins, Authorware’s primary purpose was to aid e-learning, leading to its use in businesses and in the academic field as a way to assemble multimedia learning material without the need of programming experience. The final version of the plugin was released in 2004, prior to the acquisition of Macromedia by Adobe in 2005, after which development stalled until the announcement of its discontinuation in 2007.",
  "Platforms_Autodesk_MapGuide_Description": "No description yet.",
  "Platforms_AXEL_Player_Description": "AXEL Player was an interactive 3D content plugin created by MindAvenue in 2002. It was a way for models and animations on the AXELedge web authoring program, and AXELpublisher, which converted files from other 3D software like 3ds Max. The software was well received by critics, despite a couple of limitations, one being the lack of many users for the Plugin. In 2005, MindAvenue was acquired by 20-20 Technologies, who specialized in interior design and furniture development software, and in 2006 their website became a page directing to 20-20. All AXEL branded products including the plugin were discontinued.",
  "Platforms_BitPlayer_Description": "BitPlayer was a desktop application based on Flash and Shockwave technology, created in 1999 by Dutch company BitMagic. It offered daily shorts, produced in-house and by clients, that were accompanied by advertisements and quizzes. Initially valued at $6 million, it was taken victim to the dot-com crash following its advertisers and ceased production in January 2001. Much of its content has since survived as converted SWF files despite losing the extra functionality the custom player offered.",
  "Platforms_Blender_Description": "No description yet.",
  "Platforms_Burster_Description": "Burster was a 2010 implementation of the Blender Game Engine from 2000. The project was an attempt at reviving an official plugin launched with Blender, which was discontinued due to security concerns. It improved upon the original, taking advantage of newer versions of the engine for better performance and graphics. The last version was launched in 2013, and after 3 years of no updates, Burster was officially discontinued in 2016. The game engine itself was removed from Blender in 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin is a productivity tool made by Logic Pulse in 1996. It was a new feature added to version 3.2 of Calendar Quick, a calendar & scheduling desktop application. It let users publish them using the export function into internet pages that could be linked to other people and viewed with the plugin. After fixing a Y2K bug in 1999, the website was left abandoned with no further updates, and went down in 2001.",
  "Platforms_Cult3D_Description": "Cult3D was a web viewer for 3D content made using the Cult3D Designer authoring program. It enjoyed moderate success, with 6 million users by 2001 and several notable clients using it, and more importing options for 3D models from other programs being added. 5.3 was the last version released in 2002, with the last update to the plugin being in 2004, when the technology was sold to Mental Images GmbH. Nvidia later bought Mental Images in 2007, becoming the subsidiary Nvidia Advanced Rendering Center. Despite updating the website, the plugin received no updates and starting 2011, it stopped being showcased as a viable option, and the downloads page was kept up because of users that still had an authoring licence, later being taken down in 2013.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion was a line of AR (augmented reality) programs that started development in 1999 by Total Immersion that made use of video cameras to display 3D objects in real time. One of those programs was D'Fusion @Home, released in 2008, with a plugin later in 2009. Applications for it were created using the authoring program, D'Fusion Studio, and its main focus was on marketing and short experiences. By 2011, the tech struggled to reach widespread adoption. Even with more accessible Flash implementation and the authoring software becoming free, its adoption was still very limited. Following the rise of smartphones, TryLive was developed as another AR-based solution to easily preview products such as furniture and eyewear, which became successful unlike the D'Fusion line which received no further updates after 2013. In 2015, the company was sold to ACEP, an eyewear company.",
  "Platforms_DeltaPoint_WebAnimator_Description": "No description yet.",
  "Platforms_DPGraph_Description": "Created in 1999 by David Parker, DPGraph (Dynamic Photorealistic Graphing) is an executable program dedicated to displaying graphs from web pages. They can animate and show up to 8 dimensions, with control of variables. It worked by downloading a file in a webpage that would tell the browser to run the program and render the graphs. A full version was licenced to several learning institutions for use in classrooms and study to create graphs, as well as a free player to view them. It was last updated in 2016, and in 2019 the full version of DPGraph became free to use by anyone.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) was an animation plugin released by Sharp in 2001. Designed with mobile devices such as phones and PDAs in mind, it released for select phone models exclusively in Japan as well as a browser plugin. It took pride in its small file size and vector graphics that fit any mobile screen. The technology was released to US audiences in 2002 under the name SharpMotionART. Neither lasted long, as e-animator released its last update in 2003 and SharpMotionART was discontinued in 2004.",
  "Platforms_Envoy_Description": "Envoy was a document format developed in 1993 by Tumbleweed Software, created by virtually printing them in WordPerfect. It was a competitor to Adobe Acrobat and its PDF format. WordPerfect Corporation was sold to Novell in 1994, which included Envoy, but Tumbleweed continued working with Novell, creating a web plugin in 1995 to view files online. Novell sold WordPerfect to Corel in 1996, but retained ownership of Envoy. By 1999, Novell had stopped developing Envoy, and Corel dropped support for Envoy from WordPerfect 2000. This ended the collaboration Tumbleweed had with Novell after the 1994 acquisition of Envoy, and support for the plugin was dropped.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) is a lightweight animation plugin developed by Sharp in 1997. It had several versions of the authoring software bundled with Sharp computers and for different demographics, the main one being “EVA Animator”. A more kid friendly “EVA Animator Kids”, with a エバキッズクラブ (EVA Kids Club) website was launched in 2000. These were discontinued in 2007 and replaced with an intermediate level “EVA Animator School II”. The last major update to the plugin came in 2002 with one minor fix in 2008, but despite this it maintained a small community of users, until Sharp shut down the main website in 2016.",
  "Platforms_Flatland_Rover_Description": "Rover is a 3D plugin based on the 3DML language developed in 1997 by Flatland. Users could create “Spots” with the Spotnik authoring program, made of “Levels” containing “Blocks” for ease of development, and run them with Rover, available as a browser plugin and a standalone program. Development was lively until the dot-com crash, when most of the team disbanded, with the last update released in 2005, and the website being abandoned before going down in 2012. One of the former developers, Michael Powers, decided in 2014 to revive the website, create an archive of the software, and to update it to run on modern systems. The standalone Rover app was revised in 2017, but the plugin didn’t return.",
  "Platforms_Formula_One_Description": "No description yet.",
  "Platforms_Fractal_Viewer_Description": "No description yet.",
  "Platforms_FreeHand_Description": "FreeHand was a vector graphics creative suite from 1988 created by Altsys Corporation. Macromedia bought FreeHand in 1994, and continued developing it. In October 1996, FreeHand 7.0 was launched with a plugin for the web, called Shockwave for FreeHand. The plugin allowed vector images created by the program to be embedded and viewed in a web page. In November 1996, Macromedia bought FutureSplash, another vector graphics web plugin, which was renamed to Flash.  FreeHand 8.0 was released in 1998, and now exported to Flash, instead of the FreeHand plugin. The last new version of the program, FreeHand MX, was released in 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "The GoBit Games Plugin was created in 2008 by GoBit, a small independent studio composed of former PopCap employees. Their first game, Burger Shop, was released in October 2007 and by popular demand received a web demo 4 months later using their then-new Games Plugin. A year passed and the demo was reworked as an advergame for Eggo, published by Shockwave.com on February 1, 2009. The plugin was abandoned shortly afterwards with the release of Burger Shop 2 - its respective web demo using Flash instead - leaving Burger Shop and its reskin to be the only games ever created for it.",
  "Platforms_HotSauce_Description": "A Meta Content Framework (MCF) was a metadata structuring format developed by Apple Computer's Advanced Technology Group starting in 1995, and in 1996 Project X would become an experimental plugin created to view them on the internet, later called HotSauce, which showcased sitemaps in a 3D space. At the end of 1996, 200+ websites used HotSauce, later growing to 300+, and a deal with NetCarta was reached to create a library of over 30.000 websites to navigate using the plugin. Although the MCF standard gained some praise, most users didn’t see an advantage to this 3D navigation method, and the project ended up as one of the many canceled when Steve Jobs came back to Apple in 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage is a standard for the displaying of documents through a web browser. Originally developed by Tim Berners-Lee throughout the early 1990s (with roots going as far back as 1980,) HTML became the premier method of sharing information through the Internet, its capabilities being expanded upon by other languages such as CSS and JavaScript. It first launched in 1993, and received subsequent updates with HTML2 in 1995, and both HTML3 and HTML4 in 1997. The last update to HTML4 was in 2000, and in the years after its conjoined languages were largely ignored as a platform for games, animations and other web content, with developers opting for plugin-based technology instead, but as technology and the internet evolved, plugins started becoming outdated, so an effort was made to update the standard, and in 2008 HTML5 was launched. As Flash and other plugins fell out of style, HTML5 became the recommended standard, many have shifted their projects to the HTML family - or abandoned proprietary plugins altogether - instead uploading their content to websites such as YouTube. {Note: For brevity reasons, Flashpoint labels any entry that doesn't contain frameworks or plugin-enabled content as \"HTML\".}",
  "Platforms_HyperG_Description": "Hyper-G was a Gopher based Web Content Management System (WCMS), developed by the Institute for Information Processing and Computer Supported New Media (IICM) from Graz University of Technology, Austria in 1995. It was an alternative to the Hyperlinks of the World Wide Web, making use of Hyper-G enabled Browsers, which could display 3D models of directories and files, as well as other models, with a built-in viewer. Due to it being based on the increasingly obsolete Gopher, the predecessor to the WWW, it later evolved into Hyperwave in 1996, without the extra capabilities Hyper-G browsers offered, such as the 3D functions. The vast majority of its content is now lost due to how the files were stored with Gopher.",
  "Platforms_Hypercosm_Player_Description": "Based on technology in development since 1989, Hypercosm is a 3D-content web player which launched in 1999. The company made a hefty investment that didn’t pay back, being one of the many victims of the dot-com crash, folding in 2001. However, the company was bought by ORBITEC, and thanks to a contract with NASA, the company managed to bounce back somewhat, and continued working on new projects until a restructuring in 2012, when it was put on hold by ORBITEC until a new business partner was interested in working with the tech. Such never happened, leading to Hypercosm shutting down in 2016.",
  "Platforms_Illuminatus_Description": "No description yet.",
  "Platforms_iPix_Description": "No description yet.",
  "Platforms_Java_Plugin_Description": "Released alongside the Java programming language as one of its functions, Java Applets were small application windows embedded onto pages for extra interactive features. They were made to be cross compatible on different operating systems and browsers, as well as be more powerful than standard HTML. It remained a capable option for more than 10 years, but beginning in 2013 the technology underlying the Applets started becoming unsupported on major browsers, with many becoming unusable, leading to them being deprecated in 2017 and being removed from Java SE 11 in 2018.",
  "Platforms_JCAMPDX_Description": "No description yet.",
  "Platforms_Lightning_Strike_Description": "No description yet.",
  "Platforms_LiveMath_Plugin_Description": "The LiveMath plugin is an application for interactive math, creating a window that could contain notes, formulas, graphs and other mathematical functions, to embed on a web page. Originally launched as Theorist in 1989 by Prescience Corporation, with the web plugin being launched in 1994, it was then renamed to MathView in 1997 after being bought by Waterloo Maple, before being bought by MathMonkeys and renamed to LiveMath in 1999. In 2014, with increasing problems and incompatibility with the latest browsers, the plugin was retired, being replaced by a standalone viewer called LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "No description yet.",
  "Platforms_MHSV_Description": "Launching as an alpha called VSV ({V}irtual {S}pace {V}iewer) and later renamed to MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), it was a plugin developed by ParaGraph that allowed for interactive 3D worlds made using the VHSB ({V}irtual {H}ome {S}pace {B}uilder) authoring program, which could create both interactive MHSV and standard static VRML worlds. In 1996, the development of the VRML 2.0 standard added interactivity, and ParaGraph updated VHSB to allow creation of VRML 2.0 worlds, but ParaGraph decided to work with Silicon Graphics and their viewer Cosmo VRML 2.0 player, adapting VHSB to work better with it, abandoning MHSV in the process. Silicon Graphics acquired ParaGraph in 1997 to create Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Developed by Microsoft as a response to Flash and Java, and launched in 2007, Silverlight is a multimedia tool that focused on video streaming, notable for being used by Netflix. Later versions added more capabilities for other applications. It enjoyed a decent amount of popularity, with an adoption rate of 64.7% in 2011. However, in 2012 with the announcement of the end of NPAPI, the release of Windows 8, and the beginning of HTML5 adoption, Microsoft deprecated the software, and in 2015 with the release of Windows 10, it entered End-of-Life, being discontinued in October 2021.",
  "Platforms_NoteWorthy_Composer_Description": "No description yet.",
  "Platforms_O2C_Player_Description": "Part of the o2c (objects to see) line, the o2c Player was a 1999 web 3D plugin for showcasing objects and scenes, developed by German company mb Software AG. The company sold the o2c technology to ELECO plc in 2003, who developed and launched in 2005 Version 2.0 of the o2c player, bringing much better performance with 3D acceleration, and was branded more as a CAD tool for Architects. Support for more browsers was added, but no major updates were made to it, consisting mostly of bug fixes. As of 2021 the plugin is still available for download, but Elcosoft has moved onto a Unity WebGL implementation of the tech.",
  "Platforms_Octree_View_Description": "Starting as an older plugin called PicTree Viewer or PicView, then redeveloped as the new Fastview plugin before being renamed in 1999, Octree View is a 3D object viewer based on Voxel technology in development since at least 1980, which makes use of special cameras and laser scanners to create images. The company continued making use of their technology and of the plugin, but in 2007, their website stopped being updated, leaving it up without further activity.",
  "Platforms_Pixound_Description": "Pixound was an artistic music plugin, launched in 1996 as a joint venture by Hologramophone Research and Frankfurt Balkind Partners. It acted as a MIDI keyboard that used the color values of images to produce different notes and pitches. In 2003 Hologramophone changed its name to Techné Media. By 2005, the plugin was dropped in favor of a standalone application for Mac OS X exclusively. It later became an iOS app in 2011.",
  "Platforms_Play3D_DeepV_Description": "Play3D was a 3D plugin released in 1996 by Heads Off, only to be rebranded and rereleased within the following year as DeepV. Besides a handful of examples, the plugin saw little use throughout its lifetime. The developer website went down in 2001.",
  "Platforms_PointPlus_Description": "PointPlus was a plugin for embedding PowerPoint presentations on the web, developed by Net-Scene it released in May of 1996 for Windows NT and 95. It positioned itself as an alternative to the more complex Macromedia Shockwave, for entry level users to use the PowerPoint standard. By November, a Java viewer had been developed that was cross platform compatible and didn’t require any plugins. It was kept as an option for specialised cases, but the product line stopped receiving updates in 1997. The website shut down in early 2001.",
  "Platforms_PopCap_Plugin_Description": "The PopCap Plugin was a plugin to showcase the game demos created by developer PopCap. In its early days, the company used Java for its online game demos due to its accessibility. Later on, however, development was shifted to an in-house plugin that was available as an ActiveX control and a traditional Firefox plugin. This gave PopCap the benefit of having their own proprietary platform for demo distribution. However, its underutilization both by customers and PopCap themselves led the developer to switch to the more popular Flash by 2007.",
  "Platforms_ProtoPlay_Description": "ProtoPlay was a plugin intended to showcase prototypes for consumer interaction with products and a simulation of their features. Released in 1996, it made use of the Altia Design authoring program to create applications, consisting of 2D sprites with interactive elements. The plugin was more utilitarian in nature, and it wasn’t actively advertised starting in late 2003, existing more as a feature that was available if needed. Altia Design and the plugin kept getting updates to improve functionality, and in 2007 a new tool that allowed Photoshop to create plugin apps called PhotoProto was released. In 2009, Altia Inc. shifted its focus to designing user interfaces, leaving behind the prototyping aspect of the software, and ProtoPlay along with it.",
  "Platforms_Pulse_Player_Description": "Starting development in 1997 under the name 3rd Degree, Pulse Player was a 3D plugin with a focus on animation. It was first released in 1999 with funding and backing from several experienced members in the field of internet media, and was used by several notable clients. The plugin was marketed as a fun and creative media platform, and appeared to be successful, but at the start of 2001 there was a shift in what the company wanted to pursue, rebranding the Player as a more serious business and educational tool. In 2003, 5.2 was the last version launched, and shortly after support was cut.",
  "Platforms_REBOL_Plugin_Description": "REBOL is a programming language designed over 20 years and released in 1997, and in 2004 an experimental prototype for a REBOL web plugin was created, alongside a page containing several examples. The plugin started out as ActiveX for Internet Explorer only, but later in 2006 a plugin version for other browsers was released. Shortly after this however, the last update was made, leaving it in a beta as an unsecure prototype.",
  "Platforms_ShiVa_Web_Player_Description": "Created by Stonetrip, and named Ston3D Web Player before 2007, ShiVa Web Player was a 3D web content plugin for running software made in the ShiVa 3D Engine. It allowed complex 3D scenes with lighting and physics while having low processing requirements. Stonetrip later renamed themselves in 2013 to ShiVa Technologies SAS and focused exclusively on the engine. With the removal of NPAPI from most browsers, support for the plugin diminished, leading to the URLs of several core files going down in 2018 and breaking most games, and in 2019 its download was removed from ShiVa’s website.",
  "Platforms_Show_It_Description": "Show It! was a plugin introduced in 1997 with WordPerfect Suite 8 as one of the features of Corel Presentations 8, a PowerPoint competitor. When exporting with the Internet Publisher option, they could export the presentations as either a static image slideshow, or as an embedded projector using a proprietary file that functioned just like the original desktop app, preserving all features, which needed the plugin. It continued to be supported in WordPerfect Office 2000 with Presentations 9, but by 2001, support for the plugin option was dropped from Presentations 10 in WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "No description yet.",
  "Platforms_Squeak_Etoys_Description": "Squeak was an open source platform, launched in 2001, for creating entertainment and educational content. Users could create small applications meant for children of different age groups, from the youngest, called \"Etoys\", to \"Omniuser\", and \"Expert\". It was renamed to Etoys in 2008 and shifted more towards younger children. Etoys 5 was the last version of the plugin, released in 2012. Development on a JavaScript version of the program started in 2013 after security concerns, leaving the plugin abandoned and replaced by it.",
  "Platforms_Superscape_Viscape_Description": "Launched in 1996 by early 3D pioneer Superscape with support from Intel, and originally called VisNet, Viscape was a 3D plugin that had the distinct advantage of interactivity with worlds, unlike the static models of VRML 1.0. It enjoyed a brief period of popularity, and at first there were no plans to support VRML, but with VRML97 implementing interactivity, an update named Viscape Universal was released in 1998, adding VRML support to remain relevant. This proved to not be enough, with financial trouble and failed partnerships, and reviewers calling the plugin dated and cumbersome despite their efforts at a revival. Although the last update was released in 2000, its tech continued to be utilized in Superscape's Lego Creator series for the following year. An attempt was made to update it by embedding the plugin inside Java Applets, called Vislite, but in the end the company then refocused on mobile game development and achieved moderate success before being purchased by Glu Mobile in 2008.",
  "Platforms_Surround_Video_Description": "No description yet.",
  "Platforms_SVF_Viewer_Description": "No description yet.",
  "Platforms_Tcl_Plugin_Description": "Developed by a small team and launched in 1988, Tool Command Language (Tcl, pronounced “tickle”) is an open source dynamic programming language. In 1994, Sun Microsystems brought the team in to develop the tech further. One of the outcomes of this venture was a 1996 plugin that could run Tcl applets (“Tclets”) embedded in pages. In late 1997, Tcl’s development was spun off to an independent company called Scriptics, and spun off once again into Tcl Core Team in 2000. While development of the language remains lively to this day, work on the plugin has slowed to a crawl despite not being officially discontinued. The latest version, 3.1.0, was released in 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer was a 1997 multimedia plugin made by Parable Corporation, who later changed names to ThingWorld in 1998. It made “Things”, assets that could optionally be protected against stealing or tampering and have a unique ID with credit to share around websites, using simple modular programming, to create things such as images, animations and even interactive games, made using the ThingMaker authoring program or converting Shockwave Director files using ThingConverter. It was relatively popular, even getting deals with Microsoft in and several others in 1999, but at the end of 2000, the company reduced staff and was in talks with an unknown party for a merger to sell the tech. The website shut down in 2002.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine is a cross-platform game engine that aimed to make game development more accessible, and is the most popular third-party game development software amongst developers worldwide. Created alongside Unity itself and implemented in the first patch in 2005, Unity Web Player was a tool to play Unity games on the web. It remained a popular platform for 3D games, but with the removal of NPAPI support in 2016, the plugin was dropped in favor of Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap was a tool to visualise interactive maps embedded in a web page. It was compatible with several map files from different authoring programs, could display detailed information about sectors and it let you do measurements. After its launch in 1997, no more developments were made with the technology, staying the same until the page went down in 2004.",
  "Platforms_Vitalize_Description": "Created in 1997 by Corel for displaying content made with their Click&Create multimedia authoring program, Vitalize! was a low bandwidth plugin dedicated to simple web games with an emphasis on gaming, marketing and advertising. Distributed with the help of Europress, it took pride in being “easy to learn and use unlike Java or Shockwave.” Sometime in 1999 the former Corel employees left to create Clickteam, which then took over development in 2000 with version 2.0. The latest version 4.0 was released in 2007/2008, and was available on their website until 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage is an open 3D standard and the very first created for the web. When it was initially specified in November 1994, the format could only represent static models with no interactivity. This problem was solved in 1997 when version 2.0, better known as VRML97, was published. Despite never seeing mainstream use, it would become the most popular option for internet-based 3D upon its launch before being superseded in 2001 by X3D (which was backwards compatible with VRML worlds). As it was a file format and not a plugin in itself, many different implementations have been made of VRML, often adding their own non-standard features.",
  "Platforms_X3D_Description": "No description yet.",
  "Platforms_Xara_Plugin_Description": "The Xara Plugin was a vector graphics viewer, using a proprietary low bandwidth format. It launched a beta and later full release in 1996, being able to view Flare files made with CORELXara on the web. Later in 1997 Xara Webster was launched to specifically make the web graphics for the plugin. In 1999, 2.08a was the last version released. In 2000, Xara Webster was replaced by XaraX which could export to Flash, another vector plugin, so support for their own proprietary option was dropped, and it was relegated to the legacy software archive.",
  "Platforms_Coming_Soon": "Coming Soon",
  "Platforms_Coming_Soon_Description": "Games and animations created on these platforms will be available in the next update.",
  "Platforms_Common_Ground_Description": "No description yet.",
  "Platforms_DjVu_Description": "No description yet.",
  "Platforms_Jamagic_Description": "No description yet.",
  "Platforms_Jutvision_Description": "No description yet.",
  "Platforms_mBed_Description": "No description yet.",
  "Platforms_MrSID_Description": "No description yet.",
  "Platforms_PanoramIX_Description": "No description yet.",
  "Platforms_Petz_Player_Description": "No description yet.",
  "Platforms_Sibelius_Scorch_Description": "No description yet.",
  "Platforms_Sizzler_Description": "No description yet.",
  "Platforms_Ulead_COOL_360_Description": "No description yet.",
  "Platforms_VReam_WIRL_Description": "No description yet."
}