{
  "Discord_Title": "Discord",
  "Discord_Intro": "Vă rugăm să citiți regulile înainte de a vă alătura serverului nostru de Discord (disponibile și în {#rules-and-faq}, odată ce ați intrat):",
  "Discord_Rule1": "Urmați regulile Discord, dar și pe ale noastre: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Respectați pe ceilalți. Fiți rezonabil, nu jigniți, nu provocați, nu vă impuneți opiniile și nu menționați repetat persoane sau roluri. De asemenea, nu trimiteți mesaje private membrilor serverului (inclusiv administratorilor) fără permisiunea lor.",
  "Discord_Rule3": "Scrieți despre subiecte corespunzătoare canalului ales. Citiți descrierea acestora, în special dacă nu sunteți sigur de scopul lor. Dacă un administrator vă cere să mutați mesajul în alt canal, vă rugăm să vă conformați.",
  "Discord_Rule4": "Distribuirea conținutului listat spre vânzare de către proprietar sau șters din Flashpoint la cererea proprietarului nu este permisă.",
  "Discord_Rule5": "{Nu trimiteți e-mail-uri dezvoltatorilor de jocuri dându-vă drept Flashpoint sau în care promovați Flashpoint, fără acordul administratorilor.} Nu dorim a se risipi șansa de a contacta un dezvoltator.",
  "Discord_Rule6": "Promovarea dv. sau altor afiliați prin invitații Discord, legături YouTube, proiecte în scopul profitului sau alte mesaje similare sunt interzise, cu excepția cazului în care este în contextul Flashpoint sau al arhivei digitale.",
  "Discord_Rule7": "Conținutul nepotrivit la locul de muncă corespund în {#nsfw-lounge} și nicăieri altundeva. Sperăm ca existența canalului să fie suficientă pentru a înțelege asta.",
  "Discord_Rule8": "Discursul politic nu este binevenit. Purtați-l altundeva sau abțineți-vă din a-l purta.",
  "Discord_Curation_Exception": "(Reparațiile - discuții specifice lor și conținutului lor - sunt singurele excepții ale regulilor 7 și 8.)",
  "Discord_Sanctions": "Administratorii au dreptul de a avertiza / muți / exclude temporar sau permanent utilizatorii care încalcă aceste reguli, în funcție de severitatea regulii încălcate. Încurajăm administratorii să fie înțelegători la prima încălcare a regulilor sau în situații accidentale, însă încălcarea mai multor reguli va duce la pedepse mai aspre.",
  "Discord_Agreed": "Am citit regulile și doresc să mă alătur serverului!"
}