{
  "FAQ_Title": "Întrebări frecvente",
  "FAQ_Question1": "Nu se numea acest proiect BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Da - proiectul a funcționat cu BlueMaxima în denumire până la retragerea sa din proiect în ianuarie 2023.",
  "FAQ_Question2": "Ce sisteme de operare suportați?",
  "FAQ_Answer2": "Flashpoint suportă Windows 7 SP1 și versiuni mai noi (cu excepția versiunii standard a Windows 8). Versiuni pentru MacOS și Linux sunt, de asemenea, disponibile; însă acestea necesită pași suplimentari pentru instalare și pot rula doar câteva dintre cele mai populare tehnologii de browser.",
  "FAQ_Question3": "Flashpoint prezintă probleme de securitate?",
  "FAQ_Answer3": "Nu din câte știm noi. Întreaga noastră suită de aplicații (mai puțin tehnica de descărcare a jocurilor din varianta Infinity) nu se poate conecta la internetul deschis; orice modificări de registru făcute de Flashpoint Secure Player sunt eliminate odată ce jocul este închis; toate curațiile primite sunt trecute printr-un PC cu un program antivirus competent și actualizat; și, cel mai important, lansatorul și toate mecanismele interne ale Flashpoint {are free and open-source}. Am făcut tot posibilul pentru a ne asigura că această colecție este cât se poate de sigură, dar, în ciuda eforturilor noastre, anumite programe antivirus precum Avast și AVG tind să detecteze componente importante ca fiind periculoase. Dacă ești afectat de această problemă, {read this page} pentru instrucțiuni de depanare.",
  "FAQ_Question4": "Câte jocuri/animații sunt în proiect?",
  "FAQ_Answer4": "Flashpoint oferă în prezent peste {} jocuri și {} animații. Puteți căuta colecția fără a descărca Flashpoint {here}.",
  "FAQ_Question5": "Ce platforme de browser păstrează Flashpoint?",
  "FAQ_Answer5": "Păstrăm jocurile și animațiile care rulează pe fiecare platformă listată în baza de date Flashpoint {statistics page}.",
  "FAQ_Question6": "Unde sunt jocurile de pe site-ul Nitrome?",
  "FAQ_Answer6": "Nitrome ne-a cerut politicos să scoatem conținutul lor din colecția noastră. Dacă vrei să joci jocurile lor, fă acest lucru la {website} lor, și dacă Flash nu este o opțiune, urmărește creșterea {HTML5-compatible catalog}. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "Cum pot solicita un joc/animație?",
  "FAQ_Answer7": "Poți face o cerere prin citirea {this article} până la capăt, apoi urmând link-urile din partea de jos.",
  "FAQ_Question8": "Pot adăuga eu însumi un joc/animație?",
  "FAQ_Answer8": "Da! Urmați instrucțiunile enumerate în {curation tutorial} pentru a-ți configura audiția de curator. Odată acceptată, poți trimite cât de multe curații dorești.",
  "FAQ_Question9": "Vreau să contribui într-un alt mod (scriere de cod, testare, etc). Cum pot ajuta?",
  "FAQ_Answer9": "Alătură-te {Discord server} pentru mai multe detalii. Majoritatea muncii noastre și a comunicării se întâmplă acolo.",
  "FAQ_Question10": "Este Flashpoint open source?",
  "FAQ_Answer10": "Da...oarecum. Sursele pentru tehnologia noastră personalizată, cum ar fi lansatorul, sunt toate disponibile la {GitHub} nostru. Sursele software-ului pe care îl includem în Flashpoint sunt disponibile pe site-urile lor respective (noi nu modificăm sursa niciunui software pe care îl includem). Fișierele binare pentru plugin-urile web nu sunt open source, dar dacă ar fi fost, nu am fi aici.",
  "FAQ_Question11": "Pot folosi logo-ul/este disponibil sub Creative Commons?",
  "FAQ_Answer11": "Da - logo-ul intră sub licența {CC-BY 4.0}. Pentru atribuire, puteți, opțional credita Seirade și Flashpoint. Fișierele sursă pot fi găsite {here}.",
  "FAQ_Question12": "Unde pot dona către proiect?",
  "FAQ_Answer12": "Flashpoint Archive funcționează ca un colectiv non-profit. Puteți găsi mai multe detalii despre cum să donezi și unde se duc banii tăi pe {Open Collective page}.",
  "FAQ_Question13": "Flashpoint nu funcționează cum trebuie!",
  "FAQ_Answer13": "Urmărește pașii de depanare enumerați în {manual}. Dacă încă mai ai probleme, cere ajutor pe Discord-ul nostru.",
  "FAQ_Question14": "Vreau ca un joc/animație să fie eliminat din Flashpoint dintr-un motiv sau altul.",
  "FAQ_Answer14": "Alertează-ne, fie prin Discord-ul nostru sau {directly by email}. Probabil vom încerca să te convingem să ne lași să păstrăm jocul tău de dragul istoriei, dar nu suntem nerezonabili.",
  "FAQ_Question15": "Am o altă întrebare.",
  "FAQ_Answer15": "Consultă secțiunea {extended FAQ}. Dacă întrebarea ta nu își are răspunsul acolo, alătură-te Discord-ului nostru."
}