{
  "FAQ_Title": "Întrebări frecvente",
  "FAQ_Question1": "Nu se numea acest program „BlueMaxima's Flashpoint“?",
  "FAQ_Answer1": "Ba da. Programul a fost denumit astfel până la retragerea lui BlueMaxima în ianuarie 2023.",
  "FAQ_Question2": "Ce sistem de operare necesită programul?",
  "FAQ_Answer2": "Flashpoint rulează pe Windows 7 SP1 sau mai recent (exceptând versiunea de bază a Windows 8). Sunt disponibile și versiuni pentru MacOS și Linux; însă acestea necesită pași suplimentari pentru instalare și nu acceptă decât unele tehnologii de navigator web.",
  "FAQ_Question3": "Este Flashpoint un program sigur?",
  "FAQ_Answer3": "Din câte știm, da. Pachetul de aplicații nu se conectează la Internet, exceptând programul de descărcare din varianta Infinity. Orice modificări în registru făcute de Flashpoint Secure Player sunt anulate odată cu închiderea jocului. Toate reparațiile primite sunt trecute printr-un PC cu un program de protecție performant. Lansatorul și toate mecanismele interne ale Flashpoint {sunt gratuite și au sursă liberă}. Am făcut tot posibilul pentru ca această colecție să fie cât se poate de sigură, dar, în ciuda eforturilor noastre, anumite programe de protecție, precum Avast și AVG, marchează diverse componente ca fiind periculoase. Dacă întâmpinați această problemă, {citiți instrucțiunile de depanare (en.)}.",
  "FAQ_Question4": "Câte jocuri / animații sunt disponibile în proiect?",
  "FAQ_Answer4": "Flashpoint oferă în prezent peste {} jocuri și {} animații. Puteți căuta în biblioteca noastră fără a descărca Flashpoint {aici}.",
  "FAQ_Question5": "Ce tehnologii web sunt arhivate de Flashpoint?",
  "FAQ_Answer5": "Arhivăm jocurile și animațiile care rulează pe platformele listate în {pagina de statistici Flashpoint (en.)}.",
  "FAQ_Question6": "Unde sunt jocurile de pe site-ul Nitrome?",
  "FAQ_Answer6": "Nitrome ne-a rugat să eliminăm conținutul lor din biblioteca noastră. Dacă doriți să vă jucați acele jocuri, le puteți accesa pe {site-ul lor}. Dacă nu puteți instala Adobe Flash, Nitrome dezvoltă o {bibliotecă compatibilă cu HTML5}. {Flashpoint nu susține hărțuirea Nitrome din cauza deciziei lor!}",
  "FAQ_Question7": "Cum pot solicita adăugarea unui joc / unei animații?",
  "FAQ_Answer7": "Puteți face o cerere în urma citirii {acestui articol (en.)} până la capăt. Urmați apoi legăturile web de la final.",
  "FAQ_Question8": "Pot adăuga și eu un joc / o animație?",
  "FAQ_Answer8": "Desigur! Urmați pagina {Curation Tutorial (en.)} pentru a înțelege bazele. Odată acceptată prima reparație, puteți trimite oricâte doriți.",
  "FAQ_Question9": "Doresc să contribui altfel (scriere de cod, testare, etc). Se poate?",
  "FAQ_Answer9": "Alăturați-vă {serverului Discord} pentru mai multe detalii. Majoritatea activității și discuțiilor noastre se desfășoară acolo.",
  "FAQ_Question10": "Este sursa Flashpoint liberă?",
  "FAQ_Answer10": "Mai mult sau mai puțin… Sursele pentru tehnologia scrisă de noi, cum ar fi lansatorul, sunt disponibile pe {pagina noastră de GitHub}. Sursele programelor incluse în Flashpoint sunt disponibile pe site-urile autorilor respectivi (noi nu modificăm sursa lor). Sursele pentru plugin-urile web nu sunt libere, iar, dacă ar fi fost, nu am fi în această situație.",
  "FAQ_Question11": "Pot folosi sigla? Are licență Creative Commons?",
  "FAQ_Answer11": "Da, sigla are licență {CC-BY 4.0}. Dacă doriți, puteți cita ca autori pe Seirade și Flashpoint. Fișierele sursă pot fi găsite {aici}.",
  "FAQ_Question12": "Unde pot dona?",
  "FAQ_Answer12": "Flashpoint Archive funcționează ca un colectiv non-profit. Detalii despre cum puteți dona și unde se duc banii găsiți pe {platforma Open Collective (en.)}.",
  "FAQ_Question13": "Întâmpin probleme cu Flashpoint!",
  "FAQ_Answer13": "Urmăriți pașii de depanare enumerați în {manual (en.)}. Dacă mai întâmpinați probleme, cereți ajutor pe serverul nostru Discord.",
  "FAQ_Question14": "Vreau ca un joc / o animație să fie eliminat(ă) de pe Flashpoint.",
  "FAQ_Answer14": "Aduceți-ne la cunoștință: fie pe serverul nostru Discord, fie {direct prin email}. Vom încerca să vă convingem să ne dați voie să le păstrăm, de dragul istoriei, dar suntem înțelegători.",
  "FAQ_Question15": "Mai am întrebări.",
  "FAQ_Answer15": "Consultați pagina {extended FAQ (en.)}. Dacă întrebarea dv. nu a primit răspuns nici acolo, întrebați pe serverul nostru Discord."
}