{
  "About_Welcome": "Bine ați venit",
  "About_Title": "Flashpoint Archive este un efort al comunității pentru păstrarea jocurilor și a animațiilor de pe web.",
  "About_Para1": "Istoria și cultura internetului sunt importante, iar internetul evoluează într-un ritm atât de rapid încât ceea ce este standard astăzi, mâine ar putea fi depășit. Acest proiect este dedicat păstrării cât mai multor experiențe ale acestor platforme, astfel încât să nu se piardă în timp. Începând cu decembrie 2017, {peste {} jocuri și animații} au fost păstrate pe peste o sută de plugin-uri de browser și tehnologii web.",
  "About_Para2": "Pe lângă eforturile noastre de conservare, oferim, de asemenea, un pachet de software extrem de flexibil pentru o navigare de încredere și pentru o redare a conținutului conservat. Printre software-ul care stă la baza Flashpoint se numără {a fully-featured launcher} care acționează ca un frontend pentru colecție, {a proxy} care păcălește jocurile să creadă că ele rulează pe web, și {a sandbox} care permite redarea securizată a conținutului activat de plugin-uri - toate acestea sunt {open-source software}.",
  "About_Para3": "Proiectul {was originally started} de BlueMaxima într-o încercare de a preveni dispariţia jocurilor web înainte de moartea plugin-ului Flash. Între timp, acest proiect a evoluat într-un demers major care a implicat sute de contribuabili ai comunității din întreaga lume, incluzând atât jocuri, cât și animații create pentru numeroase plugin-uri, framework-uri și standarde pe internet.",
  "About_Para4": "Flashpoint Archive funcționează ca o organizație non-profit, cu scopul de a continua eforturile de conservare și accesibilitate a jocurilor; a animațiilor și a altor experiențe digitale interactive de pe internet. Dacă doriţi să ne sprijiniţi sau să aflaţi mai multe despre modul în care suntem finanţaţi şi unde sunt cheltuite aceste fonduri, te rugăm să folosești butonul Donează în bara laterală stângă sau să vizitezi {Open Collective page}.",
  "Search_Collection": "Căutare colecție",
  "Request_Archival": "Solicitați conținut pentru arhivare"
}