{
  "About_Welcome": "Bun venit!",
  "About_Title": "Flashpoint Archive este un efort al comunității pentru păstrarea jocurilor și a animațiilor de pe web.",
  "About_Para1": "Istoria și cultura internetului sunt importante, iar internetul evoluează într-un ritm atât de rapid, încât ceea ce azi e răspândit mâine ar putea fi scos din uz. Acest proiect se dedică colecționării câtor mai multe trăiri datorate fostelor platforme web, astfel încât să nu fie pierdute în timp. Din decembrie 2017, {peste {} (de) jocuri și animații} bazate pe peste o sută de plugin-uri și tehnologii web au fost strânse la un loc, aici.",
  "About_Para2": "Pe lângă colecția largă, oferim și un pachet software flexibil pentru răsfoirea și redarea precisă și corectă a conținutului. La baza pachetului Flashpoint stau {lansatorul bogat în funcționalități}, care prezintă o interfață pentru răsfoirea colecției, {un redirecționator} care înșală jocurile spre a crede că rulează pe web, și {un sistem de delimitare} care permite redarea corectă și în siguranță a conținutului prin plugin-uri. Toate aceste componente sunt {sursă liberă}.",
  "About_Para3": "Proiectul {a fost inițiat} de BlueMaxima cu scopul de a surprinde fenomenul de dispariție a jocurilor web înainte de retragerea plugin-ului Flash. De atunci, proiectul a devenit o mișcare amplă, bazată pe devotamentul a sute de colaboratori din întreaga lume, care a ajuns să includă nu numai jocuri, ci și animații create pentru numeroase plugin-uri, framework-uri și standarde de internet.",
  "About_Para4": "Flashpoint Archive nu funcționează în scopul obținerii unui profit, ci pentru a dezvolta eforturile de conservare și accesare a jocurilor, a animațiilor și a altor tipuri de conținut interactiv de pe internet. Dacă doriți să ne sprijiniți sau să aflați mai multe despre modul în care suntem finanțați și cum sunt cheltuite aceste fonduri, vă rugăm să folosiți butonul „Donații“ din bara laterală sau vizitați {platforma Open Collective (en.)}.",
  "Search_Collection": "Căutați în baza de date",
  "Request_Archival": "Solicitați conținut pentru arhivare"
}