{
  "News_Title": "Știri",
  "News_Para1": "Toate evenimentele notabile din istoria Flashpoint începând cu octombrie 2019. Plasați cursorul deasupra numelui de cod al unei versiuni pentru o explicație de la BlueMaxima, fondatorul proiectului.",
  "News_Para2": "{Aici} găsiți un jurnal al modificărilor realizate în fiecare versiune de dinaintea comutării la sistemul modular. Pentru descărcări directe ale versiunilor mai vechi de Flashpoint Ultimate, consultați conturile din Internet Archive ale {BlueMaxima} și {Dri0m}.",
  "News_Flashpoint_Started": "Bluemaxima's Flashpoint a început.",
  "News_Flashpoint_0": "Flashpoint Zero a fost lansat.",
  "News_Flashpoint_1": "Flashpoint Versiunea Unu a fost lansat.",
  "News_Was_Released": "a fost lansat",
  "News_Flashpoint_3_0": "Cheile împărăției",
  "News_Flashpoint_3_0_Meta": "Versiunea care a introdus Redirector, programul care a completat puzzle-ul serverulului local - permite păstrarea a 99,9% de jocuri Flash fără a le modifica. „Cheile împărăției“ Flash.",
  "News_Flashpoint_3_1": "Noaptea premierei",
  "News_Flashpoint_3_1_Meta": "Versiunea care a introdus „Teatrul Flashpoint“ (deși se afla în LaunchBox la momentul respectiv).",
  "News_Flashpoint_3_2": "Șoc și devotament",
  "News_Flashpoint_3_2_Meta": "Versiunea care a introdus compatibilitate pentru jocuri Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Denumit după depășirea numărului de 4.000 de jocuri arhivate. Doamne, cum trece timpul.",
  "News_Flashpoint_4_0": "The Living Infinite",
  "News_Flashpoint_4_0_Meta": "Versiunea care a introdus Flashpoint Infinity. Numele este inspirat din albumul formației Soilwork din 2013.",
  "News_Flashpoint_4_1": "Javalitate",
  "News_Flashpoint_4_1_Meta": "Versiunea care a introdus compatibilitate pentru applet-urile Java. DarkMoe a propus numele (en. „Javality“).",
  "News_Flashpoint_5_0": "Pregătit de lansare",
  "News_Flashpoint_5_0_Meta": "Versiunea care a introdus bine-cunoscutul lansator.",
  "News_Flashpoint_5_1": "The Great Filter",
  "News_Flashpoint_5_1_Meta": "Listele de jocuri au fost adăugate. Numele este inspirat din EP-ul grupului Mesarthim, „The Great Filter“.",
  "News_Flashpoint_5_2": "Type III",
  "News_Flashpoint_5_2_Meta": "„The Great Filter“ și „Type III“ sunt două EP-uri ale grupului Mesarthim care sunt adesea puse laolaltă. Niciun alt nume nu ne-a venit prin minte la momentul respectiv.",
  "News_Flashpoint_5_3": "Revoluție",
  "News_Flashpoint_5_3_Meta": "Această versiune a fost lansată aproape de aniversarea de 1 an a Flashpoint și am simțit că a fost cu adevărat o revoluție. (Inițial, se dorea să fie denumită „Orbit“, dar a fost un nume nepotrivit pentru concept.)",
  "News_Flashpoint_5_4": "Recombination",
  "News_Flashpoint_5_4_Meta": "Această versiune a mutat animațiile împreună cu jocurile, care anterior erau în dosare separate și clienți separați.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Reparații rapide asupra lansatorului efectuate în versiunea 5.4. Să nu credeți că Flashpoint 5.4 era doar 74% gata la momentul lansării: „Recombination“ și „74%“ sunt titlurile a două piese din albumul „The Density Parameter“, al Mesarthim.",
  "News_Flashpoint_5_5": "Fier și cupru",
  "News_Flashpoint_5_5_Meta": "BlueMaxima se juca puțin prea mult Deus Ex pe atunci.",
  "News_Flashpoint_6_0": "Alignment",
  "News_Flashpoint_6_0_Meta": "Din nou Mesarthim!",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "Un joc de cuvinte bazat pe termeni adesea folosiți în tehnologie, precum „freeware“ sau „shareware“.",
  "News_Flashpoint_6_2": "Marea evadare a lui Moe",
  "News_Flashpoint_6_2_Meta": "DarkMoe reparase și adăugase incredibil de multe jocuri „Escape the Room“ în această versiune.",
  "News_Flashpoint_6_3": "Vorbim despre jocuri Flash, nu filosofie abstractă",
  "News_Flashpoint_6_3_Meta": "Numit după o replică spontană a lui nosamu, membru al comunității Flashpoint.",
  "News_Old_Releases_Title": "Cronologia lansărilor mai vechi",
  "News_Old_Releases_Description": "Din cauza faptului că nu găsisem o cale de a transmite facil știri înainte de decembrie 2019, majoritatea schimbărilor rămăseseră neînregistrate. Această secțiune încearcă să compenseze pentru lipsa respectivă.",
  "News_Is_Available": "este disponibil.",
  "News_Grab_Download": "Descărcați-o {aici}",
  "News_Flashpoint_Update_October_2019": "Stadiul Flashpoint din data de octombrie 2019 este disponibil pe Medium, {aici}.",
  "News_Flashpoint_Update_November_2019": "Stadiul Flashpoint din data de noiembrie 2019 este disponibil pe Medium, {aici}.",
  "News_Flashpoint_7_0": "Opt mii de ore",
  "News_Flashpoint_7_0_Meta": "Cam atât mai avea de trăit Flash la momentul lansării.",
  "News_Flashpoint_7_1": "Rămâneți pe fir",
  "News_Flashpoint_7_1_Meta": "După standardele noastre, Flashpoint 7.0 a fost un dezastru. 7.1 a reparat multe probleme.",
  "News_Featured_Kotaku_Link": "Am fost prezentați de Kotaku!",
  "News_Featured_Kotaku_Rest": "Aceasta este o realizare masivă. Vă mulțumim tuturor pentru sprijin!",
  "News_Flashpoint_Update_March_2020": "Stadiul Flashpoint din data de martie 2020 este disponibil pe Medium, {aici}.",
  "News_Flashpoint_Update_April_2020": "Stadiul Flashpoint din data de aprilie 2020 este disponibil pe Medium, {aici}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Această versiune marchează sfârșitul dezvoltării oficiale a programului „Redirector“. Codul HTTP 301 înseamnă „mutat permanent“. În cazul Redirector - în proiectul nostru -, datorită sursei sale libere.",
  "News_Flashpoint_Update_June_2020": "Stadiul Flashpoint din data de iunie 2020 este disponibil pe Medium, {aici}.",
  "News_Flashpoint_8_1": "Spirit de aventură",
  "News_Flashpoint_8_1_Meta": "Denumită după un vers din atunci-recentul album al Aether Realm, numit „Redneck Vikings from Hell“. Mai exact, din melodia „One Hollow Word“.",
  "News_Flashpoint_Update_August_2020": "Stadiul Flashpoint din data de august 2020 este disponibil pe Medium, {aici}.",
  "News_Flashpoint_8_2": "Aproape de planeta nouă",
  "News_Flashpoint_8_2_Meta": "Un joc de cuvinte (puțin tras de coadă) dintre „aproape de versiunea nouă“ și „Planet Nine“, EP-ul lui Mesarthim.",
  "News_Flashpoint_9_0": "Apus glorios",
  "News_Flashpoint_9_0_Meta": "Denumit după „Glorious Morning“, cântecul cunoscut pentru prezența în Age of War. Ultima versiune lansată înainte de scoaterea din uz a Flash, de unde și „apus“.",
  "News_Flashpoint_Update_April_2021": "Stadiul Flashpoint din data de aprilie 2021 este disponibil pe Medium, {aici}.",
  "News_Flashpoint_10_0": "Absență",
  "News_Flashpoint_10_0_Meta": "Prima versiune lansată într-un Internet fără Flash, de unde numele „Absență“. De asemenea, coincidența face ca acest nume să fie numele ultimei piese din EP-ul „Vacuum Solution“ al Mesarthim.",
  "News_Flashpoint_10_1": "Absență II",
  "News_Flashpoint_10_1_Meta": "Ghici.",
  "News_Flashpoint_11": "Hopa, toate plugin-urile!",
  "News_Flashpoint_11_Meta": "E o glumă, deoarece versiunea 11 a adăugat o mulțime de plugin-uri noi.",
  "News_Flashpoint_11_1": "Operațiunea „Floare de cireș“",
  "News_Flashpoint_11_1_Meta": "O referință la jocul „Muv-Luv“ (cumpărați-l de pe Steam).",
  "News_Flashpoint_12": "Axolot",
  "News_Flashpoint_12_meta": "Sunt drăguți și mișto."
}