{
  "Platforms_Title": "Platforme Suportate",
  "Platforms_Description1": "Flashpoint suportă jocuri și animații create pentru o varietate de plugin-uri și standarde web - nu doar Flash. Această pagină conține o imagine de ansamblu a istoricului fiecărei tehnologii începând cu versiunea 11. Statisticile actualizate pentru numărul de jocuri/animații al fiecărei platforme pot fi vizualizate la {Flashpoint Database}.",
  "Platforms_Description2": "Această pagină servește ca un \"Cine? Când? Care??\" al fiecărei platforme. Rezumatul și punctul de plecare pentru cercetările ulterioare, nu este o istorie cuprinzătoare a fiecărei platforme. Încercăm pe cât posibil să prezentăm date exacte, dar erori încă se pot întâmpla. Vă rugăm să ne contactați cu informații relevante pentru corecții.",
  "Platforms_By": "de",
  "Platforms_3D_Groove_GX_Description": "Înființată în 1998, Alianța Groove a fost dezvoltatorul 3D Groove SX, un motor de jocuri 3D ce era compatibil cu Shockwave. Mai târziu în 2002, motorul nu mai folosea Shockwave şi a devenit propriul lucru numit 3D Groove GX. Ambele variații puteau fi utilizate pentru dezvoltarea jocurilor online și a aplicațiilor desktop. Aceasta s-a dovedit a fi un succes pentru companie, colectând o bază mare de utilizatori din corporații și crearea mai multor titluri importante pentru emisiunile TV și alte proprietăți importante. După ce entuziasmul s-a stins, Alianța Groove a fost reorganizată în OTOY în 2008, dar site-ul 3D Groove a rămas online până în 2009. Cauza exactă a căderii companiei în cauză este necunoscută, dar s-a confirmat existența unor lupte interne.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (fostul 3D Life Player, Virtools Player şi NeMo Web Player, a nu fi confundat cu 3DVIA Studio/Beta Player sau 3DVIA Composer Player) a fost un plugin de browser de la Dassault Systèmes pentru redarea de experiențe 3D realizate în Virtools. Acesta a fost conceput pentru aplicaţii 3D avansate, practice precum antrenarea pe calculator, tururi virtuale şi imobiliare. 3DVIA Player a fost, de asemenea, utilizat pentru jocuri web, cu câţiva dintre utilizatorii principali în acest scop fiind studioul de jocuri din Quebec, Sarbakan, şi compania de jocuri Little Chicken din Amsterdam. Ultima actualizare, versiunea 5.0, a fost publicată în 2009. Pagina de descărcare va fi menținută în următorii ani până la închiderea ei în 2016. Până atunci, acest plugin fusese instalat de mai mult de 30 de milioane de ori.",
  "Platforms_AboutPeople_Description": "Nici o descriere momentan.",
  "Platforms_AboutTime_Description": "Nici o descriere momentan.",
  "Platforms_ActiveX_Controls_Description": "Lansat în 1996 de Microsoft, ActiveX a fost un framework software care a servit ca un standard ce permitea încapsularea programelor drept containere pentru utilizarea acestora în alte programe fără vreo legătură cu acestea, denumite ActiveX Controls. Ele pot fi încorporate în conținut HTML, și puteau fi create Controls cu un singur scop pentru a fi utilizate în Internet Explorer, cu scopul de a juca jocuri web. După lansarea browserului Edge în 2015, programul d a devenit învechit, iar utilizarea sa pentru aplicațiile web a încetat, aparent, fiind retrogradat la Internet Explorer 11 pentru suport de software vechi.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Pornind dezvoltarea în 1996 ca V3O fiind realizat de Rocket Science Games, a fost ulterior transferat în Attitude Software fiind redenumit 3D Anarchy, şi apoi vândut la Adobe în 2000 şi rebranduit în 2001, Atmosphere Player este un plugin web realizat pentru a vizualiza lumile 3D interactive, similar standardului VRML, creat în Atmosphere Builder. Era destinat în principal galeriilor media virtuale, care prezentau imagini/audio/video și modelele 3D însele. Când a început ca 3D Anarchy, software-ul era încă în Beta când Adobe a achiziționat tehnologia pentru dezvoltarea ulterioară. unde a petrecut următorii 3 ani în testare beta. Ultima versiune, versiunea 1.0 a player-ului a fost lansată în februarie 2004. În decembrie 2004 s-a anunţat întreruperea plugin-ului şi tăierea suportului în ianuarie 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (de asemenea doar Flash, fost Macromedia Shockwave Flash Player) este un jucător pentru animaţiile vector şi grafice, adesea cu interactivitate adăugată. Acesta a fost utilizat ca un mediu pentru jocurile web, datorită compresiei sale efective, prețului scăzut, facilității de utilizare și bazei mari de instalare. Dezvoltat în 1995 şi introdus prima dată de FutureWave în 1996, acesta era capabil de puţin mai mult decât animaţiile de bază şi butoanele de control al acestora. Pe măsură ce a câştigat popularitate, au fost adăugate caracteristici mai avansate la player, cum ar fi limbajul de programare ActionScript. Cu toate acestea, pe măsură ce oamenii încep să aibă preocupări legate de securitate, și HTML5 a crescut în popularitate în rândul dezvoltatorilor de pe web, Adobe a anunțat data de încheiere a vieții Flash, data de 31 decembrie 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (de asemenea Shockwave, anterior Macromedia Shockwave Player sau Shockwave Director Player) este un jucător pentru conținut interactiv lansat în 1995. Construit pe tehnologie care a fost în dezvoltare cu 10 ani mai devreme de către MacroMind, a devenit un plugin web doar după achiziționarea sa de către Macromedia. Spre deosebire de Flash, Shockwave a folosit limba de scriere Lingo și suport C++ prin utilizarea Xtras, oferind jucătorului o gamă largă de capacități, inclusiv 3D. Acesta a fost utilizat pe scară largă pe internetul de la vremea aceea şi în jocurile CD-ROM şi a câştigat popularitat în rândul maselor. Platforma a înregistrat o scădere semnificativă a popularității ca urmare a achiziționării de către Adobe a Macromedia în favoarea Flash, care s-a extins rapid din punct de vedere a capabilităților și era deținut acum tot de Adobe. În final, în februarie 2019, Adobe a anunţat întreruperea sa şi a renunțat la suportul pentru acest plugin după două luni.",
  "Platforms_Alambik_Plugin_Description": "Plugin-ul Alambik este un web player pentru conţinutul realizat cu Alambik, o platformă de dezvoltare. Lansat în 2001, era capabil de grafică 2D şi 3D, vectori şi multe alte aplicaţii. În 2002, Alambik a organizat un concurs cu premii pentru a sărbători lansarea Alambk Script. În 2004, Alambik a creat un nou site dedicat demo-urilor, dar după aceea compania a tăcut și nu a mai lansat niciodată ceva nou pentru platformă sau nu a mai actualizat pluginul.",
  "Platforms_Ambulant_Description": "Ambulant este un player pentru fişierele SMIL, făcute de numeroşi indivizi coordonatori la CWI în Amsterdam, Olanda. Numele pare să facă referire la „ambulație”, un alt cuvânt pentru a merge pe jos; acest lucru este susținut în continuare de logo-ul care pare să fie o persoană care merge pe jos. SMIL a fost o specificaţie făcută de W3C, consorţiul internaţional de web, dar nu a reuşit să câştige multă popularitate. Ambulant a încercat să fie un player open source care suportă toate fișierele SMIL. Cu toate acestea, dorința de a face toate părțile cu sursă deschisă îi împiedică să sprijine anumite formate media brevetate. Dezvoltarea a început în aprilie 2003, iar prima versiune, „AMBULANT/G” a fost publicată în luna iulie a acelui an. Ultima versiune stabilă, 2.6, a fost publicată în februarie 2015, însă dezvoltare unei versiuni instabile a Ambulant 2.7 a continuat până în iulie 2016, când ultima dezvoltare de pe repo-ul lor Github a fost făcută. Dezvoltatorii Ambulant sunt încă activi pe alte proiecte.",
  "Platforms_AnimaFlex_Description": "AnimaFlex a fost un plugin de redare grafică care putea juca animaţii cu o dimensiune mică a fişierelor, făcute în RubberWeb Composer, care putea întinde şi distorsiona imaginile. Putea începe să ruleze animații înainte ca întregul fișier să fie descărcat și să se adapteze la viteze mai slabe de internet. În ciuda promisiunilor sale, RubberFlex în sine deţinea câteva alte produse, toate exportatoarele de gif-uri, concurează cu opțiunea lor proprietară, și chiar a lansat FlexToGif pentru a converti fișiere Plugin în gifuri la 2 zile după plugin. La începutul anului 1998, RubberWeb Composer a încetat distribuția, lăsând animaFlex fără un program de creație.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics a fost un program de prezentări creat în 1986 de Software Publishing Corporation (SPC) pentru PC-uri MS-DOS. După trecerea la Windows în 1991, aceasta nu a reușit să recâștige cota de piață pe care o deținea și a pierdut-o în favoarea PowerPoint. În 1996, Allegro New Media (redenumit în Vizacom mai târziu în acel an) a cumpărat SPC şi Serif. SPC a creat ASAP WordPower, un program pentru a crea cu uşurinţă slideshow-uri, care ar putea fi publicate pe web folosind plugin-ul ASAP WebShow. SPC a fuzionat cu Serif în 1997. În 1998 marca Harvard a fost revitalizată odată cu programul de creație Harvard Graphics 98, iar plugin-ul a fost înlocuit cu unul nou, numit Harvard Graphics WebShow. În 2000 Advanced Presentations, noua versiune a software-ului de creație, exporta în formatul Flash în locul formatului proprietar al plugin-ului. Vizacom a vândut Serif înapoi la managementul iniţial în 2001, care a retrogradat gama Harvard în programe învechite, fiind suportate și vândute până la întreruperea lor în 2017.",
  "Platforms_Authorware_Web_Player_Description": "Authorware Web Player a fost creat de Macromedia în 1996 ca una dintre noile caracteristici ale Authorware 3.5. Acesta a fost conceput ca un mod de a rula programe interactive dezvoltate cu Macromedia Authorware pe web. Spre deosebire de majoritatea plugin-urilor web, scopul principal al Autorware-ului a fost să ajute e-learning, utilizarea sa în întreprinderi și în domeniul academic ca modalitate de a creea materiale de învățare multimedia fără a avea nevoie de experiență în programare. Versiunea finală a plugin-ului a fost lansată în 2004, înainte de achiziţionarea Macromedia de către Adobe în 2005, după care dezvoltarea a stagnat până la anunțarea întreruperii sale în 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Nici o descriere momentan.",
  "Platforms_AXEL_Player_Description": "AXEL Player a fost un plugin de conținut 3D interactiv creat de MindAvenue în 2002. A fost o modalitate pentru modele și animații în programul AXELedge de creție web, și AXELpublisher, care convertea fișiere din alte programe 3D precum 3ds Max. Software-ul a fost bine primit de critici, în ciuda câtorva limitări, una dintre acestea fiind lipsa multor utilizatori pentru Plugin. În 2005, MindAvenue a fost achiziţionat de 20-20 Technologies care era specializat în design interior şi software de dezvoltare a mobilei, iar în 2006 site-ul lor a devenit o pagină care redirecţiona către 20-20. Toate produsele AXEL, inclusiv pluginul, au fost întrerupte.",
  "Platforms_BitPlayer_Description": "BitPlayer a fost o aplicație pentru desktop bazată pe tehnologia Flash and Shockwave creată în 1999 de compania olandeză BitMagic. Aceasta a oferit scurtmetraje zilnice, produse în casă şi de clienţi, care au fost însoţite de reclame şi chestionare. Evaluată iniţial la 6 milioane de dolari, aceasta a fost victima colapsului dot-com ca urmare a publicităţii sale şi şi-a încetat producţia în ianuarie 2001. O mare parte din conţinutul său a supravieţuit de atunci sub formă de fişiere SWF convertite, în ciuda pierderii funcţionalităţii suplimentare pe care playerul personalizat le oferea.",
  "Platforms_Blender_Description": "Blender este un software 3D creat în 1994 de studioul olandez de animaţie NeoGeo. Prima sa versiune a fost publicată în 1995. Compania a fost dizolvată în 1998, dar coproprietarul Ton Roosendaal a creat Not a Number Technologies (NaN) pentru dezvoltarea ulterioară a Blender. Versiunea 2.0, cunoscută și sub numele de GameBlender, a fost lansată în 2000 și a fost o schimbare către interactivitate și dezvoltare a jocurilor. Din această cauză, un plugin de browser a fost lansat în 2001, începând ca un beta deschis, cu o a doua versiune beta lansată în ianuarie 2002. În ciuda succesului iniţial, au existat probleme financiare, iar NaN a fost închis la începutul anului 2002. Roosendaal a decis apoi să facă din Blender un program cu sursă deschisă și a reușit ca după multifinanțare să răscumpere acțiunile de la investitori. Au fost făcute încercări de a continua dezvoltarea plugin-urilor, dar mutarea către open source a dus la lipsa componentelor pentru motorul de joc; restaurarea sa a fost prioritară și plugin-ul a fost pus pe pauză. Ultima versiune a fost păstrată pentru câțiva ani — declarând că nu exista sprijin pentru ea sau planuri pentru o nouă lansare la momentul respectiv — înainte de a fi eliminată în 2005.",
  "Platforms_Burster_Description": "Burster a fost o implementare în 2010 a motorului de joc Blender din 2000. Proiectul a reprezentat o încercare de a reînvia un plugin oficial lansat cu Blender, care a fost întrerupt din motive de securitate. A îmbunătățit originalul, profitând de versiunile mai noi ale motorului de joc pentru o performanță și o grafică mai bună. Ultima versiune a fost lansată în 2013 și, după 3 ani de absență a actualizărilor, Burster a fost întrerupt oficial în 2016. Motorul grafic în sine a fost eliminat din Blender în 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin este un instrument de productivitate realizat de Logic Pulse în 1996. A fost o nouă caracteristică adăugată la versiunea 3.2 a Calendar Quick, o aplicație de calendar și programare desktop. Permite utilizatorilor să le publice utilizând funcția de export în pagini de internet care puteau fi conectate la alte persoane și vizualizate cu plugin-ul. După ce a reparat o eroare Y2K în 1999, site-ul web a fost abandonat fără actualizări suplimentare şi a fost închis în 2001.",
  "Platforms_Cult3D_Description": "Cult3D a fost un vizualizator web pentru conținut 3D realizat folosind programul de creație Cult3D Designer. Acesta s-a bucurat de un succes moderat, cu 6 milioane de utilizatori până în 2001 şi cu câţiva clienţi remarcabili care l-au folosit, și mai multe opțiuni de import pentru modele 3D din alte programe adăugate. 5.3 A fost ultima versiune publicată în 2002, ultima actualizare la plugin fiind în 2004, când tehnologia a fost vândută către Mental Images GmbH. Nvidia a cumpărat ulterior Mental Images în 2007, devenind filiala Nvidia Advanced Rendering Center. În ciuda actualizării website-ului, plugin-ul nu a primit actualizări și începând din 2011, acesta a încetat să mai fie prezentat ca o opțiune viabilă, iar pagina de descărcări a fost ținută la curent din cauza utilizatorilor care aveau încă o licență de creație, fiind apoi închis în 2013.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion a fost o linie de programe AR (augmented reality) care au început dezvoltarea în 1999 de Immersion Total, care a folosit camere video pentru a afișa obiecte 3D în timp real. Unul dintre aceste programe a fost D'Fusion @Home, lansat în 2008, cu un plugin mai târziu în 2009. Cererile pentru acesta au fost create folosind programul de autor, D'Fusion Studio, iar principalul său obiectiv a fost marketingul şi experienţele scurte. Până în 2011, tehnologia s-a străduit să ajungă la o adoptare pe scară largă. Chiar și cu o implementare mai accesibilă a programului Flash și cu un program de creație gratuit, adoptarea acestuia era încă foarte limitată. Ca urmare a dezvoltării telefoanelor inteligente, TryLive a fost dezvoltat ca o altă soluție bazată pe AR pentru a previzualiza cu ușurință produse precum mobilă și ochelari, care a avut succes, spre deosebire de linia D'Fusion care nu a mai primit actualizări după 2013. În 2015, compania a fost vândută către ACEP, o companie de ochelari.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Nici o descriere momentan.",
  "Platforms_DPGraph_Description": "Creat în 1999 de David Parker, DPGraph (Dynamic PhotorealGraphing) este un program executabil dedicat afișării graficelor de pe paginile web. Poate anima şi prezenta până la 8 dimensiuni, cu controlul variabilelor. A funcționat prin descărcarea unui fișier într-o pagină web care i-ar spune browserului să ruleze programul și să redea graficele. O versiune completă a fost licențiată către mai multe instituții de învățare pentru a fi utilizată în sălile de clasă și pentru a studia crearea de grafice, precum și un player gratuit pentru a le vedea. A fost actualizat ultima dată în 2016, iar în 2019 versiunea completă a DPGraph a devenit liberă pentru utilizare de către oricine.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) a fost un plugin de animație lansat de Sharp în 2001. Conceput pentru dispozitive mobile precum telefoane și PDA-uri, a fost lansat pentru anumite modele de telefon exclusiv în Japonia, precum și un plugin de browser. S-a lăudat cu dimensiunea mică a fișierului și cu grafica vectorială care se potrivea cu orice ecran mobil. Tehnologia a fost pusă la dispoziţia publicului american în 2002 sub numele de SharpMotionART. Niciuna nu a durat mult, deoarece e-animatorul a lansat ultima actualizare în 2003, iar SharpMotionART a fost întrerupt în 2004.",
  "Platforms_Envoy_Description": "Envoy a fost un format de documente dezvoltat în 1993 de Tumbleweed Software, creat prin tipărirea lor virtuală în WordPerfect. Acesta a fost un concurent la Adobe Acrobat și la formatul său PDF. WordPerfect Corporation a fost vândut lui Novell în 1994, printre care şi Envoy, dar Tumbleweweed a continuat să lucreze cu Novell, creând un plugin web în 1995 pentru a vizualiza fișierele online. Novell a vândut WordPerfect către Corel în 1996, dar a păstrat dreptul de proprietate asupra Envoy. Până în 1999, Novell încetase dezvoltarea Envoy, iar Corel a renunţat la sprijinul Envoy din WordPerfect 2000. Acest lucru a pus capăt colaborării Tumbleweed cu Novell după achiziția Envoy din 1994, iar suportul pentru plugin a fost abandonat.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) este un plugin de animaţie uşor dezvoltat de Sharp în 1997. Acesta avea mai multe versiuni ale software-ului de creație, fiind inclus cu calculatoarele Sharp şi pentru diferite targete demografice, principala versiune fiind „EVA Animator”. În 2000 a fost lansat un site web mai prietenos cu copii numit EVA Kids Club. Acestea au fost întrerupte în 2007 şi înlocuite cu un nivel intermediar „EVA Animator School II”. Ultima actualizare majoră a plugin-ului a venit în 2002 cu o reparație minoră în 2008, Dar, în ciuda acestui fapt, a menținut o comunitate mică de utilizatori, până când Sharp a închis site-ul web principal în 2016.",
  "Platforms_Flatland_Rover_Description": "Rover este un plugin 3D bazat pe limbajul 3DML dezvoltat în 1997 de Flatland. Utilizatorii puteau crea „Spots” cu programul de creație Spotnik, alcătuit din „Niveluri” conținând „Blocuri” pentru ușurința dezvoltării, și să le ruleze cu Rover, disponibil ca un plugin pentru browsere și ca un program de sine stătător. Dezvoltarea a fost aprinsă până la prăbușirea dot-com, când cea mai mare parte a echipei s-a desființat, ultima actualizare fiind publicată în 2005, iar site-ul web a fost abandonat înainte de a fi închis în 2012. Unul dintre foștii dezvoltatori, Michael Powers, a decis în 2014 să relanseze site-ul web, creând o arhivă software şi actualizând-o pentru a rula pe sisteme moderne. Aplicația Rover de sine stătătoare a fost revizuită în 2017, dar plugin-ul nu a mai revenit.",
  "Platforms_Formula_One_Description": "Nici o descriere momentan.",
  "Platforms_Fractal_Viewer_Description": "Nici o descriere momentan.",
  "Platforms_FreeHand_Description": "FreeHand a fost o suită creativă de grafică vectorială din 1988 creată de Altsys Corporation. Macromedia a cumpărat FreeHand în 1994 şi a continuat dezvoltarea ei. În octombrie 1996, FreeHand 7.0 a fost lansat cu un plugin pentru web, numit Shockwave for FreeHand. Plugin-ul a permis ca imaginile vectoriale create de program să fie integrate şi vizualizate într-o pagină web. În noiembrie 1996, Macromedia a cumpărat FutureSplash, un alt plugin web pentru grafica vectorială, redenumit ulterior Flash. FreeHand 8.0 a fost lansat în 1998 şi acum exporta în Flash, în loc de plugin-ul FreeHand. Ultima nouă versiune a programului, FreeHand MX, a fost lansată în 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "Plugin-ul GoBit Games a fost creat în 2008 de GoBit, un mic studio independent compus din foşti angajaţi PopCap. Primul lor joc, Burger Shop, a fost lansat în octombrie 2007, iar datorită cererii populare a primit un demo web 4 luni mai târziu, utilizând noul lor plugin de la acea dată. A trecut un an şi demo-ul a fost relucrat ca un advergame pentru Eggo, publicat de Shockwave.com la 1 februarie 2009. Plugin-ul a fost abandonat la scurt timp după aceea cu lansarea Burger Shop 2 - demo-ul său web folosind Flash în schimb - lăsând Burger Shop şi reskinul său să fie singurele jocuri create vreodată pentru el.",
  "Platforms_HotSauce_Description": "A Meta Content Framework (MCF) a fost un format de structurare a metadatelor dezvoltat de Apple Computer's Advanced Technology Group începând din 1995, iar în 1996 Project X va deveni un plugin experimental creat pentru a le vizualiza pe internet, Mai târziu numit HotSauce, care a prezentat sitemaps într-un spațiu 3D. La sfârșitul anului 1996, 200 de site-uri au folosit HotSauce, crescând ulterior la 300+, și s-a ajuns la un acord cu NetCarta pentru a crea o bibliotecă de peste 30.000 site-uri web pentru navigare folosind pluginul. Deși standardul MCF a obținut unele laude, majoritatea utilizatorilor nu au văzut un avantaj la această metodă de navigare 3D, iar proiectul a fost în cele din urmă unul dintre multele proiecte anulate când Steve Jobs s-a întors la Apple în 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage este un standard pentru afișarea documentelor prin intermediul unui browser web. Dezvoltat inițial de Tim Berners-Lee la începutul anilor 1990 (cu rădăcini care datează încă din 1980), HTML a devenit principala metodă de partajare a informațiilor pe internet, capacitățile sale fiind extinse de alte limbaje, cum ar fi CSS și JavaScript. A fost lansat pentru prima dată în 1993 și a fost actualizat ulterior cu HTML2 în 1995 și cu HTML3 și HTML4 în 1997. Ultima actualizare a HTML4 a avut loc în anul 2000, iar în anii care au urmat, limbajele sale conlocuitoare au fost în mare parte ignorate ca o platformă pentru jocuri, animații și alte tipuri de conținut web, dezvoltatorii optând în schimb pentru tehnologia bazată pe plugin-uri, însă, pe măsură ce tehnologia și internetul au evoluat, plugin-urile au început să devină depășite, astfel că s-a făcut un efort pentru a actualiza standardul, iar în 2008 a fost lansat HTML5. Pe măsură ce Flash și alte plugin-uri s-au demodat, iar HTML5 a devenit standardul recomandat, mulți și-au mutat proiectele în familia HTML - sau au renunțat complet la plugin-urile proprietare - încărcând în schimb conținutul lor pe site-uri precum YouTube. {Notă: Din motive de concizie, Flashpoint etichetează drept \"HTML\" orice intrare care nu conține frameworkuri sau conținut activat de plugin-uri.}",
  "Platforms_HyperG_Description": "Hyper-G a fost un sistem Gopher de management al conţinutului web (WCMS), dezvoltat de Institutul pentru Prelucrarea Informaţiilor şi Informatică cu suport de presă (IICM) de la Universitatea de Tehnologie din Graz, Austria, în 1995. A fost o alternativă la Hyperlink-urile de pe World Wide Web, folosind Browser-uri pregătite Hyper-G, care putea afișa modele 3D de directoare și fișiere, precum și alte modele, cu un vizualizator integrat. Datorită faptului că se bazează pe Gopher-ul din ce în ce mai învechit, predecesorul WWW, a evoluat mai târziu în Hyperwave în 1996, fără capacitățiile suplimentare browsere oferite de browsere Hyper-G, cum ar fi funcțiile 3D. Marea majoritate a conținutului său este pierdut acum din cauza modului în care au fost stocate fișierele cu Gopher.",
  "Platforms_Hypercosm_Player_Description": "Bazat pe tehnologia în dezvoltare din 1989, Hypercosm este un player de web cu conținut 3D, care a fost lansat în 1999. Compania a făcut o investiţie consistentă care nu a avut rezultate financiare favorabile, fiind una din numeroasele victime ale accidentului dot-com, dispărând în 2001. Cu toate acestea, compania a fost cumpărată de ORBITEC, iar datorită unui contract încheiat cu NASA, compania a reușit să ricoșeze cumva, și a continuat să lucreze la noi proiecte până la o restructurare în 2012; când a fost suspendată de ORBITEC până când un nou partener de afaceri era interesat să lucreze cu această tehnologie. Acest lucru nu s-a întâmplat niciodată, ducând la închiderea Hypercosm în 2016.",
  "Platforms_Illuminatus_Description": "Nici o descriere momentan.",
  "Platforms_iPix_Description": "Nici o descriere momentan.",
  "Platforms_Java_Plugin_Description": "Lansate alături de limbajul de programare Java ca una dintre funcțiile sale, Applet-urile Java au fost aplicații mici în ferestre încorporate pe pagini pentru funcții interactive extra. Acestea au fost făcute să fie compatibile cu diferite sisteme de operare și browsere, precum și să fie mai puternice decât HTML-ul standard. A rămas o opțiune capabilă timp de peste 10 ani, dar începând din 2013 tehnologia de bază pentru Applets a început să nu mai fie suportată pe browserele mari; multe dintre acestea au devenit inutilizabile, ceea ce a dus la deprecierea lor în 2017 și la eliminarea din Java SE 11 în 2018.",
  "Platforms_JCAMPDX_Description": "Nici o descriere momentan.",
  "Platforms_Lightning_Strike_Description": "Nici o descriere momentan.",
  "Platforms_LiveMath_Plugin_Description": "Plugin-ul LiveMath este o aplicație pentru matematică interactivă, creând o fereastră care poate conține notițe, formule, grafice și alte funcții matematice, pentru a fi încorporate pe o pagină web. Lansat inițial ca Teorist în 1989 de Prescience Corporation, cu plugin-ul web lansat în 1994, a fost apoi redenumită la MathView în 1997, după ce a fost cumpărată de Waterloo Maple, înainte de a fi cumpărată de MathMonkeys şi redenumită în LiveMath în 1999. În 2014, odată cu creșterea problemelor și a incompatibilității cu cele mai recente browsere, plugin-ul a fost retras, fiind înlocuit de un vizualizator independent numit LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Nici o descriere momentan.",
  "Platforms_MHSV_Description": "Lansat ca o versiune alfa numită VSV ({V}irtual {S}irtual {S}pace {V}iewer) și redenumit ulterior MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), a fost un plugin dezvoltat de ParaGraph care permitea crearea de lumi 3D interactive cu ajutorul programului de creare VHSB ({V}irtual {H}ome {S}pace {B}uilder), care putea crea atât lumi interactive MHSV, cât și lumi VRML statice standard. În 1996, dezvoltarea standardului VRML 2.0 a adăugat interactivitate, iar ParaGraph a actualizat VHSB pentru a permite crearea de lumi VRML 2.0, dar ParaGraph a decis să lucreze cu Silicon Graphics și cu playerul lor de vizualizare Cosmo VRML 2.0, adaptând VHSB pentru a funcționa mai bine cu acesta, abandonând MHSV în acest proces. Silicon Graphics a achiziționat ParaGraph în 1997 pentru a crea Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Dezvoltat de Microsoft ca răspuns la Flash și Java, și lansat în 2007, Silverlight este un instrument multimedia care se concentrează pe streaming video, notabil pentru că a fost utilizat de Netflix. Versiunile ulterioare au adăugat mai multe capabilități pentru alte aplicații. S-a bucurat de o popularitate decentă, cu o rată de adoptare de 64.7% în 2011. Cu toate acestea, în 2012, odată cu anunţarea încheierii suportului pentru NPAPI, a lansării Windows 8 şi a începerii adoptării HTML5, Microsoft a renunțat la software și, în 2015, odată cu lansarea sistemului de operare Windows 10, acesta a intrat în „End-of-Life”, suportul fiind întrerupt în octombrie 2021.",
  "Platforms_NoteWorthy_Composer_Description": "Nici o descriere momentan.",
  "Platforms_O2C_Player_Description": "Parte a liniei o2c (obiecte de văzut), o2c Player a fost un plugin web 3D din 1999 pentru prezentarea obiectelor şi scenelor, dezvoltat de compania germană mb Software AG. Compania a vândut tehnologia o2c la ELECO plc în 2003, care a dezvoltat şi lansat în 2005 Versiunea 2.0 a player-ului o2c care a adus o performanță mult mai bună cu accelerare 3D, și a fost catalogat mai mult ca o unealtă CAD pentru Arhitecți. Suport pentru mai multe browsere a fost adăugat, dar nu au mai fost făcute actualizări majore, constând în mare parte în remedierea erorilor. Începând din 2021, plugin-ul este încă disponibil pentru descărcare, dar Elcosoft s-a îndreptat spre implementarea tehnologiei Unity WebGL.",
  "Platforms_Octree_View_Description": "Începând cu un plugin mai vechi numit PicTree Viewer sau PicView, apoi redezvoltat ca noul plugin Fastview înainte de a fi redenumit în 1999, Octree View este un vizualizator de obiecte 3D bazat pe tehnologia Voxel în dezvoltare încă din 1980, care utilizează scanere cu laser și camere speciale pentru a crea imagini. Compania a continuat să utilizeze tehnologia și pluginul, dar în 2007, site-ul lor web a încetat să mai fie actualizat, lăsându-l fără activitate suplimentară.",
  "Platforms_Pixound_Description": "Pixound a fost un plugin de muzică artistică, lansat în 1996 ca o societate mixtă de către Hologramophone Research şi Frankfurt Balkind Partners. A acţionat ca o tastatură MIDI care a folosit valorile culorilor imaginilor pentru a produce note şi înălțimi diferite. În 2003, Hologramophone şi-a schimbat numele în Techné Media. Până în 2005, plugin-ul a fost abandonat în favoarea unei aplicații de sine stătătoare exclusiv pentru Mac OS X. Mai târziu a devenit o aplicație iOS în 2011.",
  "Platforms_Play3D_DeepV_Description": "Play3D a fost un plugin 3D lansat în 1996 de către Heads Off, doar pentru a fi redenumit și relansat în anul următor ca DeepV. În afară de câteva exemple, plugin-ul a văzut puțină utilizare de-a lungul întregii vieți a acestui plugin. Site-ul dezvoltatorului a fost închis în 2001.",
  "Platforms_PointPlus_Description": "PointPlus a fost un plugin pentru încorporarea prezentărilor PowerPoint pe web, dezvoltat de Net-Scene și lansat în mai 1996 pentru Windows NT și 95. Acesta s-a poziționat ca o alternativă la mai complexa Macromedia Shockwave, pentru ca utilizatorii începători să poată utiliza standardul PowerPoint. Până în noiembrie, a fost creat un viewer Java compatibil cu multiple platforme și care nu necesita niciun plugin. Acesta a fost menţinut ca o opţiune pentru cazurile specializate, dar linia de produs a încetat să mai primească actualizări în 1997. Site-ul a fost închis la începutul anului 2001.",
  "Platforms_PopCap_Plugin_Description": "PopCap Plugin a fost un plugin pentru prezentarea de demo-uri a jocurilor create de dezvoltatorul PopCap. La început, compania a folosit Java pentru demo-urile sale online datorită accesibilității sale. Mai târziu, totuși, dezvoltarea a fost transferată la un plugin intern care a fost disponibil ca un control ActiveX și un plugin tradițional pentru Firefox. Acest lucru a oferit PopCap avantajul de a avea propria platformă brevetată pentru distribuția de demo-uri. Cu toate acestea, subutilizarea sa atât de către clienţi, cât şi de către PopCap i-a determinat pe dezvoltatori să treacă la mai popularul Flash până în 2007.",
  "Platforms_ProtoPlay_Description": "ProtoPlay a fost un plugin destinat prezentării prototipurilor pentru interacţiunea dintre consumator şi produse şi o simulare a caracteristicilor acestora. Publicat în 1996, a folosit programul de creație Altia Design pentru a crea aplicaţii, constând din personaje 2D cu elemente interactive. Plugin-ul a fost mai utilitar în natură, şi nu a fost promovat activ la sfârşitul anului 2003, existâmd mai mult ca o caracteristică care să fie disponibilă dacă este necesară. Altia Design și plugin-ul au continuat să primească actualizări pentru a îmbunătăți funcționalitatea, și în 2007 a fost lansată o nouă unealtă care a permis programului Photoshop să creeze aplicații pentru plugin numite PhotoProto. În 2009, Altia Inc. și-a mutat accentul pe proiectarea interfețelor pentru utilizatori, lăsând în urmă aspectul prototipizării software-ului și ProtoPlay odată cu el.",
  "Platforms_Pulse_Player_Description": "Începând dezvoltarea în 1997 sub numele de 3rd Degree, Pulse Player a fost un plugin 3D cu accent pe animaţie. Acesta a fost lansat pentru prima dată în 1999 cu finanţare şi sprijin din partea câtorva membri cu experienţă în domeniul presei prin internet, şi a fost folosit de mai mulţi clienţi notabili. Plugin-ul a fost comercializat ca o platformă media distractivă și creativă și a părut să aibă succes, dar la începutul anului 2001 a avut loc o schimbare în ceea ce priveşte direcția companiei, astfel s-a ajuns la redenumirea playerului ca un instrument mai serios de afaceri și educație. În 2003, a fost lansată ultima versiune 5.2 şi la scurt timp după aceea s-a renunţat la suport.",
  "Platforms_REBOL_Plugin_Description": "REBOL este un limbaj de programare conceput de mai mult de 20 de ani și publicat în 1997, iar în 2004 a fost creat un prototip experimental pentru un plugin web REBOL, alături de o pagină care conține mai multe exemple. Plugin-ul a început ca ActiveX doar pentru Internet Explorer, dar mai târziu în 2006 a fost lansată o versiune de plugin pentru alte browsere. Cu toate acestea, la scurt timp după aceasta a fost făcută ultima actualizare, lăsând-o în beta drept un prototip nesigur.",
  "Platforms_ShiVa_Web_Player_Description": "Creat de Stonetrip și numit Ston3D Web Player înainte de 2007, ShiVa Web Player a fost un plugin 3D de conţinut web care rula software-ul realizat în ShiVa 3D Engine. A permis scene 3D complexe cu iluminat şi fizică în timp ce avea cerinţe de procesare scăzute. Stonetrip ulterior s-a redenumit în 2013 în ShiVa Technologies SAS și s-a concentrat exclusiv pe motorul grafic. Cu eliminarea NPAPI din majoritatea browserelor, suportul pentru plugin s-a diminuat, ducând ca adresele URL ale mai multor fișiere de bază să fie șterse în 2018 și stricând majoritatea jocurilor, iar în 2019 descărcarea sa a fost eliminată de pe site-ul ShiVa.",
  "Platforms_Show_It_Description": "Show It! a fost un plugin introdus în 1997 odată cu WordPerfect Suite 8 ca una dintre caracteristicile Corel Presentations 8, un competitor PowerPoint. Atunci când se exportă cu opțiunea Internet Publisher, ei pot exporta prezentările fie ca slideshow, fie ca imagine statică, sau ca un proiector încorporat folosind un fișier proprietar care a funcționat exact ca aplicația desktop originală, păstrând toate caracteristicile, care au avut nevoie de plugin. Aceasta a continuat să fie sprijinită în WordPerfect Office 2000 cu Presentations 9, dar până în 2001, suportul pentru opțiunea plugin a fost abandonat din Presentations 10 în WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Nici o descriere momentan.",
  "Platforms_Squeak_Etoys_Description": "Squeak a fost o platformă open source, lansată în 2001, pentru a crea divertisment și conținut educațional. Utilizatorii puteau crea aplicații mici pentru copii de diferite grupe de vârstă, de la cei mai mici, numite \"Etoys\", la \"Omniuser\" și \"Expert\". Acesta a fost redenumit în Etoys în 2008 și a fost transferat mai mult către copii mai mici. Etoys 5 a fost ultima versiune a plugin-ului, lansată în 2012. Dezvoltarea unei versiuni JavaScript a programului a început în 2013 după probleme de securitate, lăsând plugin-ul abandonat și înlocuit cu aceasta.",
  "Platforms_Superscape_Viscape_Description": "Lansat în 1996 de pionerul în 3D, Superscape, cu suport de la Intel, şi iniţial numit VisNet, Viscape a fost un plugin 3D care a avut avantajul distinct al interactivităţii cu lumile, spre deosebire de modelele statice ale VRML 1.0. Acesta s-a bucurat de o scurtă perioadă de popularitate și, la început, nu au existat planuri de sprijinire a VRML ci de punere în aplicare a interactivității VRML97, o actualizare numită Viscape Universal a fost lansată în 1998, adăugând sprijinul VRML pentru a rămâne relevant. Acest lucru s-a dovedit a fi insuficient, cu probleme financiare şi parteneriate eşuate; și evaluatorii numesc plugin-ul datat și greoi în ciuda eforturilor lor de revigorare. Deşi ultima actualizare a fost publicată în 2000, tehnologia sa a continuat să fie utilizată în seria Superscape's Lego Creator, pentru anul următor. S-a încercat actualizarea prin încorporarea plugin-ului în interiorul Applet-urilor Java numit Vislite, însă, în cele din urmă, compania s-a reorientat către dezvoltarea de jocuri mobile și a obținut un succes moderat înainte de a fi achiziționată de Glu Mobile în 2008.",
  "Platforms_Surround_Video_Description": "Nici o descriere momentan.",
  "Platforms_SVF_Viewer_Description": "Nici o descriere momentan.",
  "Platforms_Tcl_Plugin_Description": "Dezvoltat de o echipă mică și lansat în 1988, Tool Command Language (Tcl, pronunțat „tickle”) este un limbaj de programare dinamică cu sursă deschisă. În 1994, Sun Microsystems a adus echipa pentru dezvoltarea ulterioară a tehnologiei. Unul dintre rezultatele acestui proiect a fost un plugin în 1996 care a putut rula applet-uri Tcl („Tclets”) încorporate în pagini. La sfârşitul anului 1997, dezvoltarea lui Tcl a fost transferată către o companie independentă numită Scriptics, şi reluată în Tcl Core Team în 2000. În timp ce dezvoltarea limbii de programare rămâne aprinsă până în această zi, lucrul la plugin-ul a încetinit foarte mult în ciuda faptului că nu a fost întrerupt oficial. Ultima versiune, 3.1.0, a fost publicată în 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer a fost un plugin multimedia din 1997 realizat de Parable Corporation, care și-a schimbat ulterior numele în ThingWorld în 1998. Acest plugin făcea „obiecte”, obiecte care puteau fi protejate în mod opțional împotriva furtului sau manipulării frauduloase și care au un ID unic cu creditare pentru a distribui pe site-uri web, utilizând programări modulare simple, pentru a crea lucruri cum ar fi imagini, animaţii şi chiar jocuri interactive, făcute folosind programul ThingMaker pentru creație sau de conversie a fişierelor Shockwave Director folosind ThingConverter. A fost relativ popular, chiar în 1999 au fost încheiate acorduri cu Microsoft şi cu alte câteva companii, dar la finalul anului 2000 compania a redus personalul şi a purtat discuţii cu un o companie necunoscuă pentru o fuziune în vederea vânzării tehnologiei. Site-ul web s-a închis în 2002.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine este un motor de jocuri cross-platform, al cărui scop este de a face dezvoltarea jocurilor mai accesibilă, și este cel mai popular software terț de dezvoltare a jocurilor printre dezvoltatori din întreaga lume. Creat împreună cu Unity însuşi şi şi implementat în primul patch în 2005, Unity Web Player a fost un instrument pentru a juca jocuri Unity pe web. A rămas o platformă populară pentru jocurile 3D, dar odată cu eliminarea suportului NPAPI în 2016, plugin-ul a fost abandonat în favoarea Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap a fost un instrument de vizualizare a hărţilor interactive integrate într-o pagină web. A fost compatibil cu mai multe fișiere de hartă din diferite programe de creație, a putut afișa informații detaliate despre sectoare și permitea să faceți măsurători. După lansarea sa în 1997, nu au mai fost realizate alte progrese cu această tehnologie, rămânând la fel până când pagina s-a închis în 2004.",
  "Platforms_Vitalize_Description": "Creat în 1997 de Corel pentru afișarea conținutului făcut cu programul de creație Click&Create multimedia, Vitalize! a fost un plugin cu lățime de bandă scăzută dedicat jocurilor web simple, cu accent pe jocuri, marketing și reclame. Distribuit cu ajutorul Europress, acesta s-a lăudat că este „ușor de învățat și de utilizat, spre deosebire de Java sau Shockwave. Cândva în 1999, foştii angajaţi ai Corel au plecat să creeze Clickteam, care apoi a preluat dezvoltarea în 2000 cu versiunea 2. Cea mai recentă versiune 4.0 a fost publicată în 2007/2008 și a fost disponibilă pe site-ul acestora până în 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage este un standard 3D deschis și chiar primul creat pentru web. Când a fost specificat inițial în noiembrie 1994, formatul a putut reprezenta doar modele statice fără interactivitate. Această problemă a fost rezolvată în 1997, când versiunea 2.0, cunoscută sub numele de VRML97, a fost publicată. În ciuda faptului că nu a fost foarte popular, va deveni cea mai populară opțiune pentru 3D bazat pe internet la lansarea sa, înainte de a fi înlocuită în 2001 de X3D (care era compatibil cu lumile VRML). Deoarece a fost un format de fișier și nu un plugin în sine, au fost efectuate numeroase implementări diferite ale VRML, adăugând adesea propriile lor caracteristici nestandardizate.",
  "Platforms_X3D_Description": "Nici o descriere momentan.",
  "Platforms_Xara_Plugin_Description": "Plugin-ul Xara a fost un vizualizator de grafică vectorială, folosind un format proprietar cu lățime mică de bandă. A lansată o versiune beta și ulterior una completă în 1996, fiind capabil să vizualizeze fișierele Flare făcute cu CORELXara pe web. Ulterior, în 1997, Xara Webster a fost lansat pentru a realiza grafica web a plugin-ului. În 1999, 2.08a a fost ultima versiune lansată. În 2000, Xara Webster a fost înlocuit cu XaraX care putea exporta în Flash, un alt plugin vectorial, astfel încât a fost abandonat sprijinul pentru propria opţiune de brevetare şi a fost retrogradată în arhiva de software istorică.",
  "Platforms_Coming_Soon": "În curând",
  "Platforms_Coming_Soon_Description": "Jocurile și animațiile create pe aceste platforme vor fi disponibile în următoarea actualizare.",
  "Platforms_Common_Ground_Description": "Nici o descriere momentan.",
  "Platforms_DjVu_Description": "Nici o descriere momentan.",
  "Platforms_Jamagic_Description": "Nici o descriere momentan.",
  "Platforms_Jutvision_Description": "Nici o descriere momentan.",
  "Platforms_mBed_Description": "Nici o descriere momentan.",
  "Platforms_MrSID_Description": "Nici o descriere momentan.",
  "Platforms_PanoramIX_Description": "Nici o descriere momentan.",
  "Platforms_Petz_Player_Description": "Nici o descriere momentan.",
  "Platforms_Sibelius_Scorch_Description": "Nici o descriere momentan.",
  "Platforms_Sizzler_Description": "Nici o descriere momentan.",
  "Platforms_Ulead_COOL_360_Description": "Nici o descriere momentan.",
  "Platforms_VReam_WIRL_Description": "Nici o descriere momentan."
}
