{
  "Platforms_Title": "Platforme Suportate",
  "Platforms_Description1": "Flashpoint suportă jocuri și animații create pentru o varietate de plugin-uri și standarde web - nu doar Flash. Această pagină conține o imagine de ansamblu a istoricului fiecărei tehnologii începând cu versiunea 11. Statisticile actualizate pentru numărul de jocuri/animații al fiecărei platforme pot fi vizualizate la {Flashpoint Database}.",
  "Platforms_Description2": "Această pagină servește ca un \"Cine? Când? Care??\" al fiecărei platforme. Rezumatul și punctul de plecare pentru cercetările ulterioare, nu este o istorie cuprinzătoare a fiecărei platforme. Încercăm pe cât posibil să prezentăm date exacte, dar erori încă se pot întâmpla. Vă rugăm să ne contactați cu informații relevante pentru corecții.",
  "Platforms_By": "de",
  "Platforms_3D_Groove_GX_Description": "Înființată în 1998, Alianța Groove a fost dezvoltatorul 3D Groove SX, un motor de jocuri 3D ce era compatibil cu Shockwave. Mai târziu în 2002, motorul nu mai folosea Shockwave şi a devenit propriul lucru numit 3D Groove GX. Ambele variații puteau fi utilizate pentru dezvoltarea jocurilor online și a aplicațiilor desktop. Aceasta s-a dovedit a fi un succes pentru companie, colectând o bază mare de utilizatori din corporații și crearea mai multor titluri importante pentru emisiunile TV și alte proprietăți importante. După ce entuziasmul s-a stins, Alianța Groove a fost reorganizată în OTOY în 2008, dar site-ul 3D Groove a rămas online până în 2009. Cauza exactă a căderii companiei în cauză este necunoscută, dar s-a confirmat existența unor lupte interne.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (fostul 3D Life Player, Virtools Player şi NeMo Web Player, a nu fi confundat cu 3DVIA Studio/Beta Player sau 3DVIA Composer Player) a fost un plugin de browser de la Dassault Systèmes pentru redarea de experiențe 3D realizate în Virtools. Acesta a fost conceput pentru aplicaţii 3D avansate, practice precum antrenarea pe calculator, tururi virtuale şi imobiliare. 3DVIA Player a fost, de asemenea, utilizat pentru jocuri web, cu câţiva dintre utilizatorii principali în acest scop fiind studioul de jocuri din Quebec, Sarbakan, şi compania de jocuri Little Chicken din Amsterdam. Ultima actualizare, versiunea 5.0, a fost publicată în 2009. Pagina de descărcare va fi menținută în următorii ani până la închiderea ei în 2016. Până atunci, acest plugin fusese instalat de mai mult de 30 de milioane de ori.",
  "Platforms_AboutPeople_Description": "Nici o descriere momentan.",
  "Platforms_AboutTime_Description": "Nici o descriere momentan.",
  "Platforms_ActiveX_Controls_Description": "Lansat în 1996 de Microsoft, ActiveX a fost un framework software care a servit ca un standard ce permitea încapsularea programelor drept containere pentru utilizarea acestora în alte programe fără vreo legătură cu acestea, denumite ActiveX Controls. Ele pot fi încorporate în conținut HTML, și puteau fi create Controls cu un singur scop pentru a fi utilizate în Internet Explorer, cu scopul de a juca jocuri web. După lansarea browserului Edge în 2015, programul d a devenit învechit, iar utilizarea sa pentru aplicațiile web a încetat, aparent, fiind retrogradat la Internet Explorer 11 pentru suport de software vechi.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Pornind dezvoltarea în 1996 ca V3O fiind realizat de Rocket Science Games, a fost ulterior transferat în Attitude Software fiind redenumit 3D Anarchy, şi apoi vândut la Adobe în 2000 şi rebranduit în 2001, Atmosphere Player este un plugin web realizat pentru a vizualiza lumile 3D interactive, similar standardului VRML, creat în Atmosphere Builder. Era destinat în principal galeriilor media virtuale, care prezentau imagini/audio/video și modelele 3D însele. Când a început ca 3D Anarchy, software-ul era încă în Beta când Adobe a achiziționat tehnologia pentru dezvoltarea ulterioară. unde a petrecut următorii 3 ani în testare beta. Ultima versiune, versiunea 1.0 a player-ului a fost lansată în februarie 2004. În decembrie 2004 s-a anunţat întreruperea plugin-ului şi tăierea suportului în ianuarie 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (de asemenea doar Flash, fost Macromedia Shockwave Flash Player) este un jucător pentru animaţiile vector şi grafice, adesea cu interactivitate adăugată. Acesta a fost utilizat ca un mediu pentru jocurile web, datorită compresiei sale efective, prețului scăzut, facilității de utilizare și bazei mari de instalare. Dezvoltat în 1995 şi introdus prima dată de FutureWave în 1996, acesta era capabil de puţin mai mult decât animaţiile de bază şi butoanele de control al acestora. Pe măsură ce a câştigat popularitate, au fost adăugate caracteristici mai avansate la player, cum ar fi limbajul de programare ActionScript. Cu toate acestea, pe măsură ce oamenii încep să aibă preocupări legate de securitate, și HTML5 a crescut în popularitate în rândul dezvoltatorilor de pe web, Adobe a anunțat data de încheiere a vieții Flash, data de 31 decembrie 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (de asemenea Shockwave, anterior Macromedia Shockwave Player sau Shockwave Director Player) este un jucător pentru conținut interactiv lansat în 1995. Construit pe tehnologie care a fost în dezvoltare cu 10 ani mai devreme de către MacroMind, a devenit un plugin web doar după achiziționarea sa de către Macromedia. Spre deosebire de Flash, Shockwave a folosit limba de scriere Lingo și suport C++ prin utilizarea Xtras, oferind jucătorului o gamă largă de capacități, inclusiv 3D. Acesta a fost utilizat pe scară largă pe internetul de la vremea aceea şi în jocurile CD-ROM şi a câştigat popularitat în rândul maselor. Platforma a înregistrat o scădere semnificativă a popularității ca urmare a achiziționării de către Adobe a Macromedia în favoarea Flash, care s-a extins rapid din punct de vedere a capabilităților și era deținut acum tot de Adobe. În final, în februarie 2019, Adobe a anunţat întreruperea sa şi a renunțat la suportul pentru acest plugin după două luni.",
  "Platforms_Alambik_Plugin_Description": "Plugin-ul Alambik este un web player pentru conţinutul realizat cu Alambik, o platformă de dezvoltare. Lansat în 2001, era capabil de grafică 2D şi 3D, vectori şi multe alte aplicaţii. În 2002, Alambik a organizat un concurs cu premii pentru a sărbători lansarea Alambk Script. În 2004, Alambik a creat un nou site dedicat demo-urilor, dar după aceea compania a tăcut și nu a mai lansat niciodată ceva nou pentru platformă sau nu a mai actualizat pluginul.",
  "Platforms_Ambulant_Description": "Ambulant este un player pentru fişierele SMIL, făcute de numeroşi indivizi coordonatori la CWI în Amsterdam, Olanda. Numele pare să facă referire la „ambulație”, un alt cuvânt pentru a merge pe jos; acest lucru este susținut în continuare de logo-ul care pare să fie o persoană care merge pe jos. SMIL a fost o specificaţie făcută de W3C, consorţiul internaţional de web, dar nu a reuşit să câştige multă popularitate. Ambulant a încercat să fie un player open source care suportă toate fișierele SMIL. Cu toate acestea, dorința de a face toate părțile cu sursă deschisă îi împiedică să sprijine anumite formate media brevetate. Dezvoltarea a început în aprilie 2003, iar prima versiune, „AMBULANT/G” a fost publicată în luna iulie a acelui an. Ultima versiune stabilă, 2.6, a fost publicată în februarie 2015, însă dezvoltare unei versiuni instabile a Ambulant 2.7 a continuat până în iulie 2016, când ultima dezvoltare de pe repo-ul lor Github a fost făcută. Dezvoltatorii Ambulant sunt încă activi pe alte proiecte.",
  "Platforms_AnimaFlex_Description": "AnimaFlex a fost un plugin de redare grafică care putea juca animaţii cu o dimensiune mică a fişierelor, făcute în RubberWeb Composer, care putea întinde şi distorsiona imaginile. Putea începe să ruleze animații înainte ca întregul fișier să fie descărcat și să se adapteze la viteze mai slabe de internet. În ciuda promisiunilor sale, RubberFlex în sine deţinea câteva alte produse, toate exportatoarele de gif-uri, concurează cu opțiunea lor proprietară, și chiar a lansat FlexToGif pentru a converti fișiere Plugin în gifuri la 2 zile după plugin. La începutul anului 1998, RubberWeb Composer a încetat distribuția, lăsând animaFlex fără un program de creație.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics was a presentations program created in 1986 by Software Publishing Corporation (SPC) for MS-DOS PCs. After their transition to Windows in 1991, it failed to regain the market share it had and lost to PowerPoint. In 1996 Allegro New Media (renamed to Vizacom later that year) bought SPC and Serif. SPC created ASAP WordPower, a program to easily create slideshows, that could be published on the web using the ASAP WebShow plugin. SPC merged with Serif in 1997. 1998 saw the Harvard brand revitalised with the Harvard Graphics 98 authoring program, and the plugin was replaced with a new one called Harvard Graphics WebShow. In 2000 Advanced Presentations, the new version of the authoring software, exported to the Flash standard instead of the proprietary plugin format. Vizacom sold Serif back to their original management in 2001, which relegated the Harvard range to legacy software, being supported and sold until being discontinued in 2017.",
  "Platforms_Authorware_Web_Player_Description": "The Authorware Web Player was created by Macromedia in 1996 as one of the new features of Authorware 3.5. It was made as a way to run interactive programs developed with Macromedia Authorware on the web. Unlike most web plugins, Authorware’s primary purpose was to aid e-learning, leading to its use in businesses and in the academic field as a way to assemble multimedia learning material without the need of programming experience. The final version of the plugin was released in 2004, prior to the acquisition of Macromedia by Adobe in 2005, after which development stalled until the announcement of its discontinuation in 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Nici o descriere momentan.",
  "Platforms_AXEL_Player_Description": "AXEL Player was an interactive 3D content plugin created by MindAvenue in 2002. It was a way for models and animations on the AXELedge web authoring program, and AXELpublisher, which converted files from other 3D software like 3ds Max. The software was well received by critics, despite a couple of limitations, one being the lack of many users for the Plugin. In 2005, MindAvenue was acquired by 20-20 Technologies, who specialized in interior design and furniture development software, and in 2006 their website became a page directing to 20-20. All AXEL branded products including the plugin were discontinued.",
  "Platforms_BitPlayer_Description": "BitPlayer was a desktop application based on Flash and Shockwave technology, created in 1999 by Dutch company BitMagic. It offered daily shorts, produced in-house and by clients, that were accompanied by advertisements and quizzes. Initially valued at $6 million, it was taken victim to the dot-com crash following its advertisers and ceased production in January 2001. Much of its content has since survived as converted SWF files despite losing the extra functionality the custom player offered.",
  "Platforms_Blender_Description": "Blender is a 3D software tool created in 1994 by Dutch animation studio NeoGeo. Its first version was released in 1995. The company was dissolved in 1998, but co-owner Ton Roosendaal created Not a Number Technologies (NaN) to further develop Blender. Version 2.0, also known as GameBlender, released in 2000 and was a shift towards interactivity and game development. Because of that, a browser plugin was released in 2001, starting as an open beta, with a second beta launched in January 2002. Despite early success, there was financial trouble and NaN shut down in early 2002. Roosendaal then decided to make Blender open source and succeeded after crowdfunding to buy back the shares from investors. Attempts to continue plugin development were made, but the move to open source resulted in missing components for the game engine; its restoration was top priority and the plugin was put on hold. The last version was kept available for a few years—stating there was no support for it or plans for a new release at the time—before being removed in 2005.",
  "Platforms_Burster_Description": "Burster was a 2010 implementation of the Blender Game Engine from 2000. The project was an attempt at reviving an official plugin launched with Blender, which was discontinued due to security concerns. It improved upon the original, taking advantage of newer versions of the engine for better performance and graphics. The last version was launched in 2013, and after 3 years of no updates, Burster was officially discontinued in 2016. The game engine itself was removed from Blender in 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin is a productivity tool made by Logic Pulse in 1996. It was a new feature added to version 3.2 of Calendar Quick, a calendar & scheduling desktop application. It let users publish them using the export function into internet pages that could be linked to other people and viewed with the plugin. After fixing a Y2K bug in 1999, the website was left abandoned with no further updates, and went down in 2001.",
  "Platforms_Cult3D_Description": "Cult3D was a web viewer for 3D content made using the Cult3D Designer authoring program. It enjoyed moderate success, with 6 million users by 2001 and several notable clients using it, and more importing options for 3D models from other programs being added. 5.3 was the last version released in 2002, with the last update to the plugin being in 2004, when the technology was sold to Mental Images GmbH. Nvidia later bought Mental Images in 2007, becoming the subsidiary Nvidia Advanced Rendering Center. Despite updating the website, the plugin received no updates and starting 2011, it stopped being showcased as a viable option, and the downloads page was kept up because of users that still had an authoring licence, later being taken down in 2013.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion was a line of AR (augmented reality) programs that started development in 1999 by Total Immersion that made use of video cameras to display 3D objects in real time. One of those programs was D'Fusion @Home, released in 2008, with a plugin later in 2009. Applications for it were created using the authoring program, D'Fusion Studio, and its main focus was on marketing and short experiences. By 2011, the tech struggled to reach widespread adoption. Even with more accessible Flash implementation and the authoring software becoming free, its adoption was still very limited. Following the rise of smartphones, TryLive was developed as another AR-based solution to easily preview products such as furniture and eyewear, which became successful unlike the D'Fusion line which received no further updates after 2013. In 2015, the company was sold to ACEP, an eyewear company.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Nici o descriere momentan.",
  "Platforms_DPGraph_Description": "Created in 1999 by David Parker, DPGraph (Dynamic Photorealistic Graphing) is an executable program dedicated to displaying graphs from web pages. They can animate and show up to 8 dimensions, with control of variables. It worked by downloading a file in a webpage that would tell the browser to run the program and render the graphs. A full version was licenced to several learning institutions for use in classrooms and study to create graphs, as well as a free player to view them. It was last updated in 2016, and in 2019 the full version of DPGraph became free to use by anyone.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) was an animation plugin released by Sharp in 2001. Designed with mobile devices such as phones and PDAs in mind, it released for select phone models exclusively in Japan as well as a browser plugin. It took pride in its small file size and vector graphics that fit any mobile screen. The technology was released to US audiences in 2002 under the name SharpMotionART. Neither lasted long, as e-animator released its last update in 2003 and SharpMotionART was discontinued in 2004.",
  "Platforms_Envoy_Description": "Envoy was a document format developed in 1993 by Tumbleweed Software, created by virtually printing them in WordPerfect. It was a competitor to Adobe Acrobat and its PDF format. WordPerfect Corporation was sold to Novell in 1994, which included Envoy, but Tumbleweed continued working with Novell, creating a web plugin in 1995 to view files online. Novell sold WordPerfect to Corel in 1996, but retained ownership of Envoy. By 1999, Novell had stopped developing Envoy, and Corel dropped support for Envoy from WordPerfect 2000. This ended the collaboration Tumbleweed had with Novell after the 1994 acquisition of Envoy, and support for the plugin was dropped.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) is a lightweight animation plugin developed by Sharp in 1997. It had several versions of the authoring software bundled with Sharp computers and for different demographics, the main one being “EVA Animator”. A more kid friendly “EVA Animator Kids”, with a エバキッズクラブ (EVA Kids Club) website was launched in 2000. These were discontinued in 2007 and replaced with an intermediate level “EVA Animator School II”. The last major update to the plugin came in 2002 with one minor fix in 2008, but despite this it maintained a small community of users, until Sharp shut down the main website in 2016.",
  "Platforms_Flatland_Rover_Description": "Rover is a 3D plugin based on the 3DML language developed in 1997 by Flatland. Users could create “Spots” with the Spotnik authoring program, made of “Levels” containing “Blocks” for ease of development, and run them with Rover, available as a browser plugin and a standalone program. Development was lively until the dot-com crash, when most of the team disbanded, with the last update released in 2005, and the website being abandoned before going down in 2012. One of the former developers, Michael Powers, decided in 2014 to revive the website, create an archive of the software, and to update it to run on modern systems. The standalone Rover app was revised in 2017, but the plugin didn’t return.",
  "Platforms_Formula_One_Description": "Nici o descriere momentan.",
  "Platforms_Fractal_Viewer_Description": "Nici o descriere momentan.",
  "Platforms_FreeHand_Description": "FreeHand was a vector graphics creative suite from 1988 created by Altsys Corporation. Macromedia bought FreeHand in 1994, and continued developing it. In October 1996, FreeHand 7.0 was launched with a plugin for the web, called Shockwave for FreeHand. The plugin allowed vector images created by the program to be embedded and viewed in a web page. In November 1996, Macromedia bought FutureSplash, another vector graphics web plugin, which was renamed to Flash.  FreeHand 8.0 was released in 1998, and now exported to Flash, instead of the FreeHand plugin. The last new version of the program, FreeHand MX, was released in 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "The GoBit Games Plugin was created in 2008 by GoBit, a small independent studio composed of former PopCap employees. Their first game, Burger Shop, was released in October 2007 and by popular demand received a web demo 4 months later using their then-new Games Plugin. A year passed and the demo was reworked as an advergame for Eggo, published by Shockwave.com on February 1, 2009. The plugin was abandoned shortly afterwards with the release of Burger Shop 2 - its respective web demo using Flash instead - leaving Burger Shop and its reskin to be the only games ever created for it.",
  "Platforms_HotSauce_Description": "A Meta Content Framework (MCF) was a metadata structuring format developed by Apple Computer's Advanced Technology Group starting in 1995, and in 1996 Project X would become an experimental plugin created to view them on the internet, later called HotSauce, which showcased sitemaps in a 3D space. At the end of 1996, 200+ websites used HotSauce, later growing to 300+, and a deal with NetCarta was reached to create a library of over 30.000 websites to navigate using the plugin. Although the MCF standard gained some praise, most users didn’t see an advantage to this 3D navigation method, and the project ended up as one of the many canceled when Steve Jobs came back to Apple in 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage is a standard for the displaying of documents through a web browser. Originally developed by Tim Berners-Lee throughout the early 1990s (with roots going as far back as 1980,) HTML became the premier method of sharing information through the Internet, its capabilities being expanded upon by other languages such as CSS and JavaScript. It first launched in 1993, and received subsequent updates with HTML2 in 1995, and both HTML3 and HTML4 in 1997. The last update to HTML4 was in 2000, and in the years after its conjoined languages were largely ignored as a platform for games, animations and other web content, with developers opting for plugin-based technology instead, but as technology and the internet evolved, plugins started becoming outdated, so an effort was made to update the standard, and in 2008 HTML5 was launched. As Flash and other plugins fell out of style, HTML5 became the recommended standard, many have shifted their projects to the HTML family - or abandoned proprietary plugins altogether - instead uploading their content to websites such as YouTube. {Note: For brevity reasons, Flashpoint labels any entry that doesn't contain frameworks or plugin-enabled content as \"HTML\".}",
  "Platforms_HyperG_Description": "Hyper-G was a Gopher based Web Content Management System (WCMS), developed by the Institute for Information Processing and Computer Supported New Media (IICM) from Graz University of Technology, Austria in 1995. It was an alternative to the Hyperlinks of the World Wide Web, making use of Hyper-G enabled Browsers, which could display 3D models of directories and files, as well as other models, with a built-in viewer. Due to it being based on the increasingly obsolete Gopher, the predecessor to the WWW, it later evolved into Hyperwave in 1996, without the extra capabilities Hyper-G browsers offered, such as the 3D functions. The vast majority of its content is now lost due to how the files were stored with Gopher.",
  "Platforms_Hypercosm_Player_Description": "Based on technology in development since 1989, Hypercosm is a 3D-content web player which launched in 1999. The company made a hefty investment that didn’t pay back, being one of the many victims of the dot-com crash, folding in 2001. However, the company was bought by ORBITEC, and thanks to a contract with NASA, the company managed to bounce back somewhat, and continued working on new projects until a restructuring in 2012, when it was put on hold by ORBITEC until a new business partner was interested in working with the tech. Such never happened, leading to Hypercosm shutting down in 2016.",
  "Platforms_Illuminatus_Description": "Nici o descriere momentan.",
  "Platforms_iPix_Description": "Nici o descriere momentan.",
  "Platforms_Java_Plugin_Description": "Released alongside the Java programming language as one of its functions, Java Applets were small application windows embedded onto pages for extra interactive features. They were made to be cross compatible on different operating systems and browsers, as well as be more powerful than standard HTML. It remained a capable option for more than 10 years, but beginning in 2013 the technology underlying the Applets started becoming unsupported on major browsers, with many becoming unusable, leading to them being deprecated in 2017 and being removed from Java SE 11 in 2018.",
  "Platforms_JCAMPDX_Description": "Nici o descriere momentan.",
  "Platforms_Lightning_Strike_Description": "Nici o descriere momentan.",
  "Platforms_LiveMath_Plugin_Description": "The LiveMath plugin is an application for interactive math, creating a window that could contain notes, formulas, graphs and other mathematical functions, to embed on a web page. Originally launched as Theorist in 1989 by Prescience Corporation, with the web plugin being launched in 1994, it was then renamed to MathView in 1997 after being bought by Waterloo Maple, before being bought by MathMonkeys and renamed to LiveMath in 1999. In 2014, with increasing problems and incompatibility with the latest browsers, the plugin was retired, being replaced by a standalone viewer called LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Nici o descriere momentan.",
  "Platforms_MHSV_Description": "Launching as an alpha called VSV ({V}irtual {S}pace {V}iewer) and later renamed to MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), it was a plugin developed by ParaGraph that allowed for interactive 3D worlds made using the VHSB ({V}irtual {H}ome {S}pace {B}uilder) authoring program, which could create both interactive MHSV and standard static VRML worlds. In 1996, the development of the VRML 2.0 standard added interactivity, and ParaGraph updated VHSB to allow creation of VRML 2.0 worlds, but ParaGraph decided to work with Silicon Graphics and their viewer Cosmo VRML 2.0 player, adapting VHSB to work better with it, abandoning MHSV in the process. Silicon Graphics acquired ParaGraph in 1997 to create Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Developed by Microsoft as a response to Flash and Java, and launched in 2007, Silverlight is a multimedia tool that focused on video streaming, notable for being used by Netflix. Later versions added more capabilities for other applications. It enjoyed a decent amount of popularity, with an adoption rate of 64.7% in 2011. However, in 2012 with the announcement of the end of NPAPI, the release of Windows 8, and the beginning of HTML5 adoption, Microsoft deprecated the software, and in 2015 with the release of Windows 10, it entered End-of-Life, being discontinued in October 2021.",
  "Platforms_NoteWorthy_Composer_Description": "Nici o descriere momentan.",
  "Platforms_O2C_Player_Description": "Part of the o2c (objects to see) line, the o2c Player was a 1999 web 3D plugin for showcasing objects and scenes, developed by German company mb Software AG. The company sold the o2c technology to ELECO plc in 2003, who developed and launched in 2005 Version 2.0 of the o2c player, bringing much better performance with 3D acceleration, and was branded more as a CAD tool for Architects. Support for more browsers was added, but no major updates were made to it, consisting mostly of bug fixes. As of 2021 the plugin is still available for download, but Elcosoft has moved onto a Unity WebGL implementation of the tech.",
  "Platforms_Octree_View_Description": "Starting as an older plugin called PicTree Viewer or PicView, then redeveloped as the new Fastview plugin before being renamed in 1999, Octree View is a 3D object viewer based on Voxel technology in development since at least 1980, which makes use of special cameras and laser scanners to create images. The company continued making use of their technology and of the plugin, but in 2007, their website stopped being updated, leaving it up without further activity.",
  "Platforms_Pixound_Description": "Pixound was an artistic music plugin, launched in 1996 as a joint venture by Hologramophone Research and Frankfurt Balkind Partners. It acted as a MIDI keyboard that used the color values of images to produce different notes and pitches. In 2003 Hologramophone changed its name to Techné Media. By 2005, the plugin was dropped in favor of a standalone application for Mac OS X exclusively. It later became an iOS app in 2011.",
  "Platforms_Play3D_DeepV_Description": "Play3D was a 3D plugin released in 1996 by Heads Off, only to be rebranded and rereleased within the following year as DeepV. Besides a handful of examples, the plugin saw little use throughout its lifetime. The developer website went down in 2001.",
  "Platforms_PointPlus_Description": "PointPlus was a plugin for embedding PowerPoint presentations on the web, developed by Net-Scene it released in May of 1996 for Windows NT and 95. It positioned itself as an alternative to the more complex Macromedia Shockwave, for entry level users to use the PowerPoint standard. By November, a Java viewer had been developed that was cross platform compatible and didn’t require any plugins. It was kept as an option for specialised cases, but the product line stopped receiving updates in 1997. The website shut down in early 2001.",
  "Platforms_PopCap_Plugin_Description": "PopCap Plugin a fost un plugin pentru prezentarea de demo-uri a jocurilor create de dezvoltatorul PopCap. La început, compania a folosit Java pentru demo-urile sale online datorită accesibilității sale. Mai târziu, totuși, dezvoltarea a fost transferată la un plugin intern care a fost disponibil ca un control ActiveX și un plugin tradițional pentru Firefox. Acest lucru a oferit PopCap avantajul de a avea propria platformă brevetată pentru distribuția de demo-uri. Cu toate acestea, subutilizarea sa atât de către clienţi, cât şi de către PopCap i-a determinat pe dezvoltatori să treacă la mai popularul Flash până în 2007.",
  "Platforms_ProtoPlay_Description": "ProtoPlay was a plugin intended to showcase prototypes for consumer interaction with products and a simulation of their features. Released in 1996, it made use of the Altia Design authoring program to create applications, consisting of 2D sprites with interactive elements. The plugin was more utilitarian in nature, and it wasn’t actively advertised starting in late 2003, existing more as a feature that was available if needed. Altia Design and the plugin kept getting updates to improve functionality, and in 2007 a new tool that allowed Photoshop to create plugin apps called PhotoProto was released. In 2009, Altia Inc. shifted its focus to designing user interfaces, leaving behind the prototyping aspect of the software, and ProtoPlay along with it.",
  "Platforms_Pulse_Player_Description": "Starting development in 1997 under the name 3rd Degree, Pulse Player was a 3D plugin with a focus on animation. It was first released in 1999 with funding and backing from several experienced members in the field of internet media, and was used by several notable clients. The plugin was marketed as a fun and creative media platform, and appeared to be successful, but at the start of 2001 there was a shift in what the company wanted to pursue, rebranding the Player as a more serious business and educational tool. In 2003, 5.2 was the last version launched, and shortly after support was cut.",
  "Platforms_REBOL_Plugin_Description": "REBOL is a programming language designed over 20 years and released in 1997, and in 2004 an experimental prototype for a REBOL web plugin was created, alongside a page containing several examples. The plugin started out as ActiveX for Internet Explorer only, but later in 2006 a plugin version for other browsers was released. Shortly after this however, the last update was made, leaving it in a beta as an unsecure prototype.",
  "Platforms_ShiVa_Web_Player_Description": "Created by Stonetrip, and named Ston3D Web Player before 2007, ShiVa Web Player was a 3D web content plugin for running software made in the ShiVa 3D Engine. It allowed complex 3D scenes with lighting and physics while having low processing requirements. Stonetrip later renamed themselves in 2013 to ShiVa Technologies SAS and focused exclusively on the engine. With the removal of NPAPI from most browsers, support for the plugin diminished, leading to the URLs of several core files going down in 2018 and breaking most games, and in 2019 its download was removed from ShiVa’s website.",
  "Platforms_Show_It_Description": "Show It! was a plugin introduced in 1997 with WordPerfect Suite 8 as one of the features of Corel Presentations 8, a PowerPoint competitor. When exporting with the Internet Publisher option, they could export the presentations as either a static image slideshow, or as an embedded projector using a proprietary file that functioned just like the original desktop app, preserving all features, which needed the plugin. It continued to be supported in WordPerfect Office 2000 with Presentations 9, but by 2001, support for the plugin option was dropped from Presentations 10 in WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Nici o descriere momentan.",
  "Platforms_Squeak_Etoys_Description": "Squeak was an open source platform, launched in 2001, for creating entertainment and educational content. Users could create small applications meant for children of different age groups, from the youngest, called \"Etoys\", to \"Omniuser\", and \"Expert\". It was renamed to Etoys in 2008 and shifted more towards younger children. Etoys 5 was the last version of the plugin, released in 2012. Development on a JavaScript version of the program started in 2013 after security concerns, leaving the plugin abandoned and replaced by it.",
  "Platforms_Superscape_Viscape_Description": "Launched in 1996 by early 3D pioneer Superscape with support from Intel, and originally called VisNet, Viscape was a 3D plugin that had the distinct advantage of interactivity with worlds, unlike the static models of VRML 1.0. It enjoyed a brief period of popularity, and at first there were no plans to support VRML, but with VRML97 implementing interactivity, an update named Viscape Universal was released in 1998, adding VRML support to remain relevant. This proved to not be enough, with financial trouble and failed partnerships, and reviewers calling the plugin dated and cumbersome despite their efforts at a revival. Although the last update was released in 2000, its tech continued to be utilized in Superscape's Lego Creator series for the following year. An attempt was made to update it by embedding the plugin inside Java Applets, called Vislite, but in the end the company then refocused on mobile game development and achieved moderate success before being purchased by Glu Mobile in 2008.",
  "Platforms_Surround_Video_Description": "Nici o descriere momentan.",
  "Platforms_SVF_Viewer_Description": "Nici o descriere momentan.",
  "Platforms_Tcl_Plugin_Description": "Developed by a small team and launched in 1988, Tool Command Language (Tcl, pronounced “tickle”) is an open source dynamic programming language. In 1994, Sun Microsystems brought the team in to develop the tech further. One of the outcomes of this venture was a 1996 plugin that could run Tcl applets (“Tclets”) embedded in pages. In late 1997, Tcl’s development was spun off to an independent company called Scriptics, and spun off once again into Tcl Core Team in 2000. While development of the language remains lively to this day, work on the plugin has slowed to a crawl despite not being officially discontinued. The latest version, 3.1.0, was released in 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer a fost un plugin multimedia din 1997 realizat de Parable Corporation, care și-a schimbat ulterior numele în ThingWorld în 1998. Acest plugin făcea „obiecte”, obiecte care puteau fi protejate în mod opțional împotriva furtului sau manipulării frauduloase și care au un ID unic cu creditare pentru a distribui pe site-uri web, utilizând programări modulare simple, pentru a crea lucruri cum ar fi imagini, animaţii şi chiar jocuri interactive, făcute folosind programul ThingMaker pentru creație sau de conversie a fişierelor Shockwave Director folosind ThingConverter. A fost relativ popular, chiar în 1999 au fost încheiate acorduri cu Microsoft şi cu alte câteva companii, dar la finalul anului 2000 compania a redus personalul şi a purtat discuţii cu un o companie necunoscuă pentru o fuziune în vederea vânzării tehnologiei. Site-ul web s-a închis în 2002.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine este un motor de jocuri cross-platform, al cărui scop este de a face dezvoltarea jocurilor mai accesibilă, și este cel mai popular software terț de dezvoltare a jocurilor printre dezvoltatori din întreaga lume. Creat împreună cu Unity însuşi şi şi implementat în primul patch în 2005, Unity Web Player a fost un instrument pentru a juca jocuri Unity pe web. A rămas o platformă populară pentru jocurile 3D, dar odată cu eliminarea suportului NPAPI în 2016, plugin-ul a fost abandonat în favoarea Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap a fost un instrument de vizualizare a hărţilor interactive integrate într-o pagină web. A fost compatibil cu mai multe fișiere de hartă din diferite programe de creație, a putut afișa informații detaliate despre sectoare și permitea să faceți măsurători. După lansarea sa în 1997, nu au mai fost realizate alte progrese cu această tehnologie, rămânând la fel până când pagina s-a închis în 2004.",
  "Platforms_Vitalize_Description": "Creat în 1997 de Corel pentru afișarea conținutului făcut cu programul de creație Click&Create multimedia, Vitalize! a fost un plugin cu lățime de bandă scăzută dedicat jocurilor web simple, cu accent pe jocuri, marketing și reclame. Distribuit cu ajutorul Europress, acesta s-a lăudat că este „ușor de învățat și de utilizat, spre deosebire de Java sau Shockwave. Cândva în 1999, foştii angajaţi ai Corel au plecat să creeze Clickteam, care apoi a preluat dezvoltarea în 2000 cu versiunea 2. Cea mai recentă versiune 4.0 a fost publicată în 2007/2008 și a fost disponibilă pe site-ul acestora până în 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage este un standard 3D deschis și chiar primul creat pentru web. Când a fost specificat inițial în noiembrie 1994, formatul a putut reprezenta doar modele statice fără interactivitate. Această problemă a fost rezolvată în 1997, când versiunea 2.0, cunoscută sub numele de VRML97, a fost publicată. În ciuda faptului că nu a fost foarte popular, va deveni cea mai populară opțiune pentru 3D bazat pe internet la lansarea sa, înainte de a fi înlocuită în 2001 de X3D (care era compatibil cu lumile VRML). Deoarece a fost un format de fișier și nu un plugin în sine, au fost efectuate numeroase implementări diferite ale VRML, adăugând adesea propriile lor caracteristici nestandardizate.",
  "Platforms_X3D_Description": "Nici o descriere momentan.",
  "Platforms_Xara_Plugin_Description": "Plugin-ul Xara a fost un vizualizator de grafică vectorială, folosind un format proprietar cu lățime mică de bandă. A lansată o versiune beta și ulterior una completă în 1996, fiind capabil să vizualizeze fișierele Flare făcute cu CORELXara pe web. Ulterior, în 1997, Xara Webster a fost lansat pentru a realiza grafica web a plugin-ului. În 1999, 2.08a a fost ultima versiune lansată. În 2000, Xara Webster a fost înlocuit cu XaraX care putea exporta în Flash, un alt plugin vectorial, astfel încât a fost abandonat sprijinul pentru propria opţiune de brevetare şi a fost retrogradată în arhiva de software istorică.",
  "Platforms_Coming_Soon": "În curând",
  "Platforms_Coming_Soon_Description": "Jocurile și animațiile create pe aceste platforme vor fi disponibile în următoarea actualizare.",
  "Platforms_Common_Ground_Description": "Nici o descriere momentan.",
  "Platforms_DjVu_Description": "Nici o descriere momentan.",
  "Platforms_Jamagic_Description": "Nici o descriere momentan.",
  "Platforms_Jutvision_Description": "Nici o descriere momentan.",
  "Platforms_mBed_Description": "Nici o descriere momentan.",
  "Platforms_MrSID_Description": "Nici o descriere momentan.",
  "Platforms_PanoramIX_Description": "Nici o descriere momentan.",
  "Platforms_Petz_Player_Description": "Nici o descriere momentan.",
  "Platforms_Sibelius_Scorch_Description": "Nici o descriere momentan.",
  "Platforms_Sizzler_Description": "Nici o descriere momentan.",
  "Platforms_Ulead_COOL_360_Description": "Nici o descriere momentan.",
  "Platforms_VReam_WIRL_Description": "Nici o descriere momentan."
}
