{
  "Source_Title": "Cod Sursă",
  "Source_Desc": "Software-ul care stă la baza Flashpoint este gratuit si cu sursă deschisă, evident excluzând majoritatea plugin-urilor/ tehnologiilor de browser (nu putem face prea multe despre acest lucru). Aplicațiile și utilitățile dezvoltate de colaboratorii de proiect pot fi găsite pe {GitHub team page}.",
  "Source_Developed_Projects_Title": "Software dezvoltat de colaboratorii Flashpoint",
  "Source_Developed_Projects_Desc": "Următoarele programe sunt disponibile sub licența de tip MIT:",
  "Source_Flashpoint_Launcher_Desc": "{Flashpoint Launcher}, un launcher extensibil bazat pe Electron și inspirat de LaunchBox.",
  "Source_Flashpoint_Proxy_Desc": "{Flashpoint Proxy}, un program ce permite comunicarea dintre un browser/projector și internetul simulat al Flashpoint.",
  "Source_Flashpoint_Secure_Player_Desc": "{Flashpoint Secure Player}, o aplicație avansată ce permite redarea conținutului bazat pe plugin-uri fără a face modificări permanente în registrul Windows.",
  "Source_Flashpoint_Component_Tools_Desc": "{Flashpoint Component Tools}, un set de aplicații care permite utilizatorului să descarce, să gestioneze și să elimine componente.",
  "Source_Flashpoint_OldCPUSimulator_Desc": "{OldCPUSimulator}, o unealtă care rulează aplicații cu viteze de ceas simulate.",
  "Source_Utilized_Projects_Title": "Software terț utilizat de Flashpoint",
  "Source_Utilized_Projects_Desc": "Următoarele programe cu sursă deschisă nu sunt dezvoltate de noi, dar sunt incluse în suita de programe Flashpoint:",
  "Source_Apache_Desc": "{Apache HTTP Server}, un server web lansat sub licența Apache-2.0.",
  "Source_Basilisk_Desc": "{Basilisk}, un browser web lansat sub licența MPL-2.0. Flashpoint utilizează o versiune modificată pe 32 de biți cu propriul său branding, care poate fi găsit {here}.",
  "Source_Chromium_Desc": "{Chromium}, un browser web lansat sub diverse licențe open-source.",
  "Source_PHP_Desc": "{PHP}, un limbaj de programare lansat sub licența PHP."
}