{
  "FAQ_Title": "Câu hỏi thường gặp",
  "FAQ_Question1": "Didn't this used to be called BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Yes - the project used to operate with BlueMaxima in the name until his retirement from the project in January 2023.",
  "FAQ_Question2": "Dự án hỗ trợ những hệ điều hành nào?",
  "FAQ_Answer2": "Flashpoint hỗ trợ Windows 7 SP1 trở lên (trừ Windows 8 gốc). Cũng có phiên bản dành cho MacOS và Linux, nhưng các phiên bản này chỉ chạy được một số công nghệ web phổ biến nhất và bạn sẽ cần tốn thêm chút công sức khi cài đặt.",
  "FAQ_Question3": "Flashpoint có gây nên nguy cơ bảo mật không?",
  "FAQ_Answer3": "Chúng tôi tin là không. Toàn bộ gói phần mềm (trừ công nghệ tải nội dung của bản Infinity) không thể kết nối internet; bất cứ thay đổi nào liên quan đến Registry do Flashpoint Secure Player thực hiện đều bị gỡ bỏ một khi bạn đóng trò chơi; mọi bản đóng góp đều được kiểm duyệt trên một máy vi tính có phần mềm diệt virus mạnh và đã cập nhật; hơn hết, trình khởi chạy và mã nguồn của Flashpoint {are free and open-source}. Chúng tôi đã cố hết sức để giữ Flashpoint an toàn nhất có thể, nhưng dù vậy thì một số phần mềm diệt virus như Avast hay AVG vẫn sẽ đánh dấu một số thành phần quan trọng của phần mềm là nguy hiểm. Nếu bạn đang gặp vấn đề như trên, {read this page} để biết cách xử lí.",
  "FAQ_Question4": "Có bao nhiêu trò chơi/hoạt hình trong dự án này?",
  "FAQ_Answer4": "Flashpoint currently offers over {} games and {} animations. You can search the collection without downloading Flashpoint {here}.",
  "FAQ_Question5": "What browser platforms does Flashpoint preserve?",
  "FAQ_Answer5": "We preserve games and animations running on every platform listed at the Flashpoint Database's {statistics page}.",
  "FAQ_Question6": "Các trò chơi của Nitrome đâu hết rồi?",
  "FAQ_Answer6": "Nitrome đã gửi yêu cầu rất lịch sự để nhờ chúng tôi xóa nội dung của họ khỏi Flashpoint. Nếu bạn muốn chơi game của Nitrome, hãy ghé thăm {website} của họ. Nếu trò chơi bạn cần không có bản Flash, hãy theo dõi  {HTML5-compatible catalog} của họ. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "Làm thế nào để nhờ lưu trữ một trò chơi/hoạt hình?",
  "FAQ_Answer7": "You can make a request by first reading {this article} all the way through, then following the links at the bottom.",
  "FAQ_Question8": "Tôi có thể tự đóng góp trò chơi/hoạt hình được không?",
  "FAQ_Answer8": "Yes! Follow the instructions listed in the {curation tutorial} to set up your curator audition. Once it's accepted, you can submit as many more curations as you desire.",
  "FAQ_Question9": "Tôi muốn đóng góp cho dự án bằng cách khác (lập trình, chạy thử nội dung...). Tôi có thể giúp được gì?",
  "FAQ_Answer9": "Mời bạn gia nhập {Discord server} để biết thêm thông tin. Chúng ta hầu như liên lạc và làm việc với nhau trên này.",
  "FAQ_Question10": "Flashpoint có phải một dự án mã nguồn mở không?",
  "FAQ_Answer10": "Có...và không. Mã nguồn cho các công nghệ nhà làm như trình khởi chạy của chúng tôi có trên {GitHub}. Mã nguồn của những phần mềm chúng tôi bỏ vào Flashpoint có trên những trang web của các phần mềm ấy (mà, chúng tôi không sửa mã nguồn của bất cứ phần mềm nào trong số này đâu). Các phần mềm mở rộng của trình duyệt tuy không phải phần mềm mã nguồn mở (vì nếu chúng là phần mềm mã nguồn mở sẵn thì chúng tôi đã không tồn tại rồi).",
  "FAQ_Question11": "Tôi có được dùng biểu trưng (logo) không? Biểu trưng có giấy phép Creative Commons không?",
  "FAQ_Answer11": "Yes - the logo falls under the {CC-BY 4.0} license. For attribution, you may optionally credit Seirade and Flashpoint. Source files can be found {here}.",
  "FAQ_Question12": "Tôi có thể quyên góp cho dự án này ở đâu?",
  "FAQ_Answer12": "Flashpoint Archive operates as a non-profit collective. You can find more details about how to donate and where your money goes on our {Open Collective page}.",
  "FAQ_Question13": "Flashpoint có lỗi!",
  "FAQ_Answer13": "Hãy làm theo các bước sửa lỗi trong {manual}. Nếu vẫn gặp trục trặc, hãy nhờ mọi người trong Discord giúp.",
  "FAQ_Question14": "Tôi muốn xóa một trò chơi/hoạt hình khỏi Flashpoint vì một lý do nào đó.",
  "FAQ_Answer14": "Hãy cho chúng tôi biết qua Discord hay {directly by email}. Có lẽ chúng tôi sẽ cố thuyết phục bạn cho phép giữ trò chơi để bảo tồn, nhưng chúng tôi sẽ cố gắng giải quyết hợp lí.",
  "FAQ_Question15": "Tôi còn câu hỏi khác.",
  "FAQ_Answer15": "Bạn nên đọc qua {extended FAQ}. Nếu vẫn chưa tìm thấy câu trả lời, hãy vào máy chủ Discord của chúng tôi."
}