{
  "About_Welcome": "Chào bạn",
  "About_Title": "Flashpoint là một dự án cộng đồng nhằm lưu giữ các trò chơi và đoạn phim hoạt hình trên mạng.",
  "About_Para1": "Lịch sử internet và văn hóa nắm giữ vai trò quan trọng. Trong khi đó, công nghệ mạng thì đang tiến bộ vượt bậc ở một ngưỡng mà điều bình thường của hôm nay có lẽ sẽ trở thành điều lạc hậu của ngày mai. Dự án này tập trung bảo tồn thật nhiều những trải nghiệm do các nền tảng số mang lại để chúng không bị nhấn chìm trong dòng chảy của thời gian. Tính từ 2017, chúng tôi đã lưu trữ {over {} games and animations} thuộc hơn hàng trăm phần mở rộng của trình duyệt web và công nghệ web.",
  "About_Para2": "Ngoài công cuộc bảo tồn nói trên, chúng tôi cũng phát triển một gói phần mềm đa năng để mang đến trải nghiệm duyệt và tìm nội dung được lưu trữ mượt mà. Trong số những phần mềm đóng vai trò trụ cột của Flashpoint, có thể kể đến {a fully-featured launcher} - \"bộ mặt đại diện\" cho dự án, {a proxy} khiến cho các trò chơi nghĩ rằng chúng đang được khởi chạy trên các trang web thật, cũng như {a sandbox} để khởi chạy các nội dung cần phần mở rộng một cách an toàn. Tất cả những phần mềm trên đều là {open-source software}.",
  "About_Para3": "Dự án {was originally started} bởi BlueMaxima nhằm đón đầu sự biến mất của trò chơi nền web trước cả khi Flash bị khai tử. Từ đó, Flashpoint đã phát triển thành một dự án quy mô lớn với sự tham gia của hàng trăm cộng tác viên trên toàn thế giới, mang theo mình cả trò chơi lẫn những tựa phim hoạt hình dành cho rất nhiều phần mở rộng web, framework, và tiêu chuẩn khác nhau.",
  "About_Para4": "Flashpoint Archive là một dự án phi lợi nhuận với mục tiêu cải thiện tiến trình lưu trữ và khả năng tiếp cận trò chơi, họa hình và nội dung tương tác khác trên mạng. Nếu bạn muốn ủng hộ chúng tôi hay muốn tìm hiểu xem chúng tôi có được nguồn tiền từ đâu và sử dụng nguồn tiền được quyên góp cho mục đích gì, hãy nhấn vào nút Quyên góp nằm bên cột bên trái hoặc ghé thăm {Open Collective page} của dự án.",
  "Search_Collection": "Duyệt cơ sở dữ liệu",
  "Request_Archival": "Gửi yêu cầu lưu trữ nội dung"
}