{
  "News_Title": "News",
  "News_Para1": "Những sự kiện nổi bật trong lịch sử Flashpoint tính từ tháng 10/2019. Rê chuột lên tên phiên bản để đọc giải thích của BlueMaxima, người sáng lập dự án.",
  "News_Para2": "A changelog encompassing every version released before the switch to the component-based system can be found {here}. For direct downloads to older versions of Flashpoint Ultimate, see BlueMaxima's and Dri0m's Internet Archive accounts {here} and {here}, respectively.",
  "News_Flashpoint_Started": "BlueMaxima's Flashpoint ra đời.",
  "News_Flashpoint_0": "Flashpoint Zero ra mắt.",
  "News_Flashpoint_1": "Flashpoint Version One ra mắt.",
  "News_Was_Released": "ra mắt",
  "News_Flashpoint_3_0": "Keys to the Kingdom",
  "News_Flashpoint_3_0_Meta": "Từ phiên bản này, chúng tôi cho ra mắt Redirector, ẩn số cuối cùng của bài toán đảm bảo cấu hình máy chủ hoạt động được. Nhờ vậy, chúng tôi có thể lưu trữ 99.9% trò chơi Flash mà không cần can thiệp vào mã nguồn của chúng. Có thể nói đó chính là chiếc chìa mở khóa mở ra vương quốc Flash.",
  "News_Flashpoint_3_1": "Opening Night",
  "News_Flashpoint_3_1_Meta": "(Đêm mở màn) Đây là phiên bản đầu tiên có sự hiện diện của Rạp phim Flashpoint (dù thuở ấy nó chạy trong một cửa sổ LaunchBox riêng).",
  "News_Flashpoint_3_2": "Shock and Awe",
  "News_Flashpoint_3_2_Meta": "Đây là phiên bản đầu tiên hỗ trợ trò chơi Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "(Siêu nét) Chúng tôi đặt tên này vì hồi ấy cán mốc 4000 trò chơi trong CSDL. Chà, thời gian trôi như chó chạy ngoài đồng.",
  "News_Flashpoint_4_0": "The Living Infinite",
  "News_Flashpoint_4_0_Meta": "(Sống mãi) Từ phiên bản này, Flashpoint Infinity ra đời. Bản Infinity cho bạn tải trò chơi từ máy chủ. Tên phiên bản này được đặt theo album cùng tên của Soilwork năm 2013.",
  "News_Flashpoint_4_1": "Javality",
  "News_Flashpoint_4_1_Meta": "Từ phiên bản này, Flashpoint bắt đầu hỗ trợ applet Java. DarkMoe nghĩ ra cái tên này đấy.",
  "News_Flashpoint_5_0": "Go For Launch",
  "News_Flashpoint_5_0_Meta": "(Khởi động) Trình khởi chạy mà chúng ta quá quen thuộc và yêu mến xuất hiện từ phiên bản này.",
  "News_Flashpoint_5_1": "The Great Filter",
  "News_Flashpoint_5_1_Meta": "Playlists were added here (a filter, if you will). The name is taken from the Mesarthim EP, The Great Filter.",
  "News_Flashpoint_5_2": "Type III",
  "News_Flashpoint_5_2_Meta": "The Great Filter and Type III are two Mesarthim EPs that are often put together. No other name came up when we needed it.",
  "News_Flashpoint_5_3": "Revolution",
  "News_Flashpoint_5_3_Meta": "This version was released close to the 1-year anniversary of Flashpoint, and we felt it was truly a revolution. (It was also originally going to be named 'Orbit', but that was a stupid name for the concept.)",
  "News_Flashpoint_5_4": "Recombination",
  "News_Flashpoint_5_4_Meta": "This version moved animations in with games, which were previously in seperate folders with seperate clients. 'Recombination' and '74%' also happened to be the name of two tracks in the Mesarthim album The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "A quick set of patches made alongside 5.4's upload time. It wasn't like Flashpoint 5.4 was only 74% completed when we put it out.",
  "News_Flashpoint_5_5": "Iron & Copper",
  "News_Flashpoint_5_5_Meta": "BlueMaxima was playing a bit too much Deus Ex at the time.",
  "News_Flashpoint_6_0": "Alignment",
  "News_Flashpoint_6_0_Meta": "Another Mesarthim reference!",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "A play on software terms commonly used in tech, such as 'freeware' and 'shareware'.",
  "News_Flashpoint_6_2": "Moe's Great Escape",
  "News_Flashpoint_6_2_Meta": "The staff member DarkMoe curated a truly insane amount of escape-the-room games this version.",
  "News_Flashpoint_6_3": "We're Talking About Flash Games, Not Abstract Philosophy",
  "News_Flashpoint_6_3_Meta": "Named after an offhand line from nosamu, a staff member.",
  "News_Old_Releases_Title": "Retroactive Timeline of Releases",
  "News_Old_Releases_Description": "Due to a news column only having existed since December 2019, the majority of releases up to that point have went uncatalogued. This section accounts for those missing versions.",
  "News_Is_Available": "is now available!",
  "News_Grab_Download": "Grab it from the {downloads page}",
  "News_Flashpoint_Update_October_2019": "The Flashpoint status update for October 2019 is now available on Medium. Check it out {here}.",
  "News_Flashpoint_Update_November_2019": "The Flashpoint status update for November 2019 is now available on Medium. Check it out {here}.",
  "News_Flashpoint_7_0": "Eight Thousand Hours",
  "News_Flashpoint_7_0_Meta": "Eight thousand hours was roughly how long Flash had to live at the time of release.",
  "News_Flashpoint_7_1": "Stay on Target",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0, by our standards, came out a mess. 7.1 was a heavy bugfix release.",
  "News_Featured_Kotaku_Link": "We've been featured on Kotaku!",
  "News_Featured_Kotaku_Rest": "This is a massive milestone. Thank you all for the support!",
  "News_Flashpoint_Update_March_2020": "The Flashpoint status update for March 2020 is now available on Medium. Check it out {here}.",
  "News_Flashpoint_Update_April_2020": "The Flashpoint status update for April 2020 is now available on Medium. Check it out {here}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "This version saw the end of the Redirector software, previously used to make the server work. HTTP Code 301 is 'moved permanently', as in, no longer redirecting.",
  "News_Flashpoint_Update_June_2020": "The Flashpoint mini status update for June 2020 is now available on Medium. Check it out {here}.",
  "News_Flashpoint_8_1": "Spirit of Adventure",
  "News_Flashpoint_8_1_Meta": "Named after a line from the then-recent Aether Realm album, Redneck Vikings from Hell. To be specific, the track 'One Hollow Word'.",
  "News_Flashpoint_Update_August_2020": "The Flashpoint status update for August 2020 is now available on Medium. Check it out {here}.",
  "News_Flashpoint_8_2": "Approaching Planet Nine",
  "News_Flashpoint_8_2_Meta": "A (stretched, I'll grant you) portmanteau of 'approaching version nine', and Planet Nine, the Mesarthim EP.",
  "News_Flashpoint_9_0": "Glorious Sunset",
  "News_Flashpoint_9_0_Meta": "Named after Glorious Morning, the song most known for being in Age of War. This was the last version to release before Flash's death, hence 'sunset'.",
  "News_Flashpoint_Update_April_2021": "The Flashpoint status update for April 2021 was released today. Check it out {here}.",
  "News_Flashpoint_10_0": "Absence",
  "News_Flashpoint_10_0_Meta": "This is the first version to release to a post-Flash internet, hence the name 'Absence'. It also happened to be the name of the last track on the Mesarthim EP 'Vacuum Solution'.",
  "News_Flashpoint_10_1": "Absence II",
  "News_Flashpoint_10_1_Meta": "Go on, guess.",
  "News_Flashpoint_11": "Oops, All Plugins!",
  "News_Flashpoint_11_Meta": "It's a meme, because 11 added three dozen new plugins.",
  "News_Flashpoint_11_1": "Operation Cherry Blossom",
  "News_Flashpoint_11_1_Meta": "A reference to the game Muv-Luv (go buy it on Steam).",
  "News_Flashpoint_12": "Axolotl",
  "News_Flashpoint_12_meta": "They're cute and they're cool."
}