{
  "Discord_Title": "Discord",
  "Discord_Intro": "Пожалуйста, ознакомьтесь с правилами перед тем, как присоединиться к нашему Discord-серверу (их также можно просмотреть в разделе {#rules-and-faq} после того, как вы вошли):",
  "Discord_Rule1": "Соблюдайте правила Discord и наши: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Будьте уважительны по отношению к другим людям. Уважайте чужое мнение, не разжигайте конфликты, не упоминайте пользователей и роли много раз и не отправляйте пользователям (в том числе и персоналу) много сообщений без разрешения.",
  "Discord_Rule3": "Придерживайтесь тематики каналов. Всегда читайте описание, если вы не уверены в его назначении. Если член персонала попросит вас переместиться в другой канал для разговора, последуйте его просьбе.",
  "Discord_Rule4": "Распространение контента, который в настоящее время продаётся или запрашивается для удаления из Flashpoint, не допускается.",
  "Discord_Rule5": "{Never send emails relating to Flashpoint without the consent of staff, no matter how good you think it is.} Nobody wants their chance of contacting a developer to go to waste, that's why we want to make sure it doesn't happen.",
  "Discord_Rule6": "Продвижение себя или аффилированных лиц с помощью приглашений в Discord, ссылок на YouTube, заработка денег и т.п. запрещено, за исключением случаев, когда это связано с Flashpoint или цифровым архивом.",
  "Discord_Rule7": "NSFW-контент и его обсуждение должны вестись в {#nsfw-lounge} (название канала говорит само за себя).",
  "Discord_Rule8": "Политическим разговорам не место на этом сервере. Обсудите их в другом месте или не обсуждайте вообще.",
  "Discord_Curation_Exception": "(Curations - specific discussion of, and included content - are the only exception to rules 7 and 8.)",
  "Discord_Sanctions": "Члены команды могут, в зависимости от степени тяжести нарушения, предупреждать/замалчивать/кикать/банить пользователей, которые, по их мнению, нарушают правила. Мы рекомендуем персоналу относиться снисходительно к первым или случайным нарушениям правил, однако многократное их нарушение приведёт к более суровому наказанию.",
  "Discord_Agreed": "Я прочёл правила и хочу присоединиться к серверу!"
}