{
  "Discord_Title": "Discord",
  "Discord_Intro": "Пожалуйста, ознакомьтесь с правилами перед тем, как присоединиться к нашему Discord-серверу (их также можно просмотреть в разделе {#rules-and-faq} после того, как вы вошли):",
  "Discord_Rule1": "Соблюдайте правила Discord и наши: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Будьте уважительны по отношению к другим людям. Уважайте чужое мнение, не разжигайте конфликты, не упоминайте пользователей и роли много раз и не отправляйте пользователям (в том числе и персоналу) много сообщений без разрешения.",
  "Discord_Rule3": "Keep topics to their designated channels. Always read the description if you aren't fully sure of its purpose. If a staff member asks you to move the conversation, please do so.",
  "Discord_Rule4": "Distribution of content that is currently being sold or requested to be removed from Flashpoint is not allowed.",
  "Discord_Rule5": "{Never send emails relating to Flashpoint without the consent of staff, no matter how good you think it is.} Nobody wants their chance of contacting a developer to go to waste, that's why we want to make sure it doesn't happen.",
  "Discord_Rule6": "Promotion of yourself or affiliated parties through Discord invites, YouTube links, money-making ventures or the like is prohibited unless it's in the context of Flashpoint or digital archival.",
  "Discord_Rule7": "NSFW content and discussion must be kept in {#nsfw-lounge} (the channel's existence alone should explain more than enough).",
  "Discord_Rule8": "Political talk has no place in this server. Take it somewhere else or don't discuss it at all.",
  "Discord_Curation_Exception": "(Curations - specific discussion of, and included content - are the only exception to rules 7 and 8.)",
  "Discord_Sanctions": "Team members are allowed to warn/silence/kick/ban users they feel are breaking these rules based on the severity of the rule broken. We encourage staff to show levity to first time or accidental rule breaks, but multiple broken rules will result in harsher punishments.",
  "Discord_Agreed": "I've read the rules and I want to join the server!"
}