{
  "FAQ_Title": "Часто Задаваемые Вопросы (FAQ)",
  "FAQ_Question1": "Кто или что такое BlueMaxima?",
  "FAQ_Answer1": "BlueMaxima, или Ben Latimore - это австралиец, запустивший Flashpoint и обрабатывающий мастер-копии. Ни один бизнес или организация не задействован в Flashpoint - это полностью управляемый сообществом проект.",
  "FAQ_Question2": "Какие операционные системы поддерживаются?",
  "FAQ_Answer2": "Flashpoint поддерживает Windows 7 SP1 и новее (исключая обычную Windows 8). Также доступны версии MacOS и Linux; Тем не менее, они нуждаются в дополнительных шагах для установки и могут запускать только небольшое количество самых популярных технологий браузера.",
  "FAQ_Question3": "Безопасен ли Flashpoint?",
  "FAQ_Answer3": "Думаем, что нет. Наши программы (за исключением скачиваний игр в версии Infinity) не могут подключаться к Интернету; любые изменения реестра, внесенные Flashpoint Secure Player, удаляются сразу после закрытия игры; все входящие курирования передаются через ПК с компетентным и актуальным антивирусным программным обеспечением; и, самое главное, лаунчер и все внутренние работы Flashpoint'а являются открытым исходным кодом и могут быть найдены {here}. Мы сделали все возможное, чтобы обеспечить сохранность коллекции, но несмотря на наши усилия, некоторые антивирусы, такие как Avast и AVG, обычно обнаруживают важные компоненты, как опасные. Если вас затронула эта проблема, {read this page} для инструкции по устранению неполадок.",
  "FAQ_Question4": "Сколько здесь игр/анимаций?",
  "FAQ_Answer4": "Начиная с Flashpoint 11, в базе насчитывается 130,000 игр и 20,000 анимаций. Найти коллекцию можно без лаунчера {here}. Кроме того, вы можете просмотреть соответствующие списки {here} и {here}.",
  "FAQ_Question5": "Какие платформы поддерживаются коллекцией?",
  "FAQ_Answer5": "Мы поддерживаем игры и анимации на каждой платформе, указанной в этом списке: {Supported Platforms}",
  "FAQ_Question6": "Где игры Nitrome?",
  "FAQ_Answer6": "Nitrome вежливо попросил нас удалить их содержание из коллекции. Если вы желаете поиграть в их игры, сделайте это на их {website}, и если Flash не является опцией, зайдите в их растущий {HTML5-compatible catalog}. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "Как мне запросить игру/анимацию?",
  "FAQ_Answer7": "Вы можете сделать запрос, прочитав {this article} полностью, затем следуя по ссылкам внизу.",
  "FAQ_Question8": "Могу ли я самостоятельно добавить игру/анимацию?",
  "FAQ_Answer8": "Да. Следуйте инструкциям из {curation tutorial} для настройки вашего кураторского слушания. Как только он будет принят, вы можете отправить столько курирований, сколько пожелаете.",
  "FAQ_Question9": "Я хочу внести свой вклад (программирование, тестирование и т. д.) Как я могу помочь?",
  "FAQ_Answer9": "Заходите в наш {Discord server} для получения более подробной информации. Большая часть нашей работы и общения происходит там.",
  "FAQ_Question10": "Имеет ли Flashpoint открытый исходный код?",
  "FAQ_Answer10": "Отчасти. Все исходники наших технологий, таких как лаунчер, доступны на нашем {GitHub}. Источники программного обеспечения, которое мы включаем в Flashpoint, доступны с их соответствующих веб-сайтов (мы не изменяем источник какого-либо программного обеспечения, которое мы включаем). Двоичные файлы для самих веб-плагинов не являются открытыми исходными кодами, но если бы они таковыми были, нас бы здесь вообще не было.",
  "FAQ_Question11": "Могу ли я использовать логотип/доступен ли логотип под лицензией Creative Commons?",
  "FAQ_Answer11": "Да, логотип попадает под лицензию {CC-BY 4.0}. Вы можете дополнительно упомянуть Seirade и Flashpoint BlueMaxima. Исходные файлы могут быть найдены {here}.",
  "FAQ_Question12": "Где я могу пожертвовать проекту?",
  "FAQ_Answer12": "С уважением к художникам и разработчикам, чьи работы можно найти в Flashpoint, мы стараемся не запрашивать пожертвования. Пока что мы провели {a fundraiser} для покрытия расходов на сервер, в дальнейшем другой запускать не планируется.",
  "FAQ_Question13": "Flashpoint работает неправильно!",
  "FAQ_Answer13": "Выполните шаги по устранению неполадок, перечисленные в {manual}. Если после этого у вас все еще возникают проблемы, попросите помощи в нашем Discord сервере.",
  "FAQ_Question14": "Я хочу удалить игру/анимацию из Flashpoint по некоторой причине.",
  "FAQ_Answer14": "Оповестите нас через наш Discord сервер или {directly by email}. Вероятно, мы постараемся убедить вас в том, чтобы оставить вашу игру ради исторической ценности, но мы не будем слишком настойчивы.",
  "FAQ_Question15": "У меня есть ещё вопросы.",
  "FAQ_Answer15": "Прочитайте наш {extended FAQ}. Если вы не нашли ответа на ваш вопрос, присоединяйтесь к нашему Discord серверу."
}