{
  "FAQ_Title": "Часто задаваемые вопросы",
  "FAQ_Question1": "А разве раньше этот проект не назывался BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Да - проект существовал с BlueMaxima в названии до его ухода из проекта в январе 2023 года.",
  "FAQ_Question2": "Какие операционные системы поддерживаются?",
  "FAQ_Answer2": "Flashpoint поддерживает Windows 7 SP1 и более новые версии (за исключением стоковой Windows 8). Доступны также версии для MacOS и Linux, однако они требуют дополнительных шагов для установки и могут работать только с некоторыми из наиболее популярных браузерных технологий.",
  "FAQ_Question3": "Есть ли у Flashpoint проблемы с безопасностью?",
  "FAQ_Answer3": "Насколько нам известно, нет. Весь наш набор приложений (за исключением технологии загрузки игр Infinity) не может подключаться к открытому Интернету; все изменения в реестре, внесённые Flashpoint Secure Player, удаляются после закрытия игры; все входящие файлы проходят через компьютер с надёжным и актуальным антивирусным ПО; и, самое главное, программа запуска и всё внутреннее устройство Flashpoint {свободны и имеют открытый исходный код}. Мы сделали всё возможное, чтобы коллекция была максимально безопасной, но, несмотря на наши усилия, некоторые антивирусы, такие как Avast и AVG, определяют важные компоненты как опасные. Если вы столкнулись с этой проблемой, ознакомьтесь с инструкциями по устранению неполадок на {этой странице}.",
  "FAQ_Question4": "Сколько всего игр и анимаций вы собрали?",
  "FAQ_Answer4": "В настоящее время Flashpoint предлагает более {} игр и {} анимаций. Поиск по коллекции можно осуществлять без загрузки Flashpoint на {этой странице}.",
  "FAQ_Question5": "Какие браузерные платформы сохраняет Flashpoint?",
  "FAQ_Answer5": "Мы сохраняем игры и анимации, работающие на всех платформах, перечисленных на {статистической странице} базы данных Flashpoint.",
  "FAQ_Question6": "Где игры Nitrome?",
  "FAQ_Answer6": "Компания Nitrome вежливо попросила нас удалить её материалы из коллекции. Если вы хотите поиграть в их игры, сделайте это на их {веб-сайте}, а если Flash — не вариант, то следите за их растущим {HTML5-совместимым каталогом}. {Flashpoint не одобряет травлю и преследования в связи с решением Nitrome}.",
  "FAQ_Question7": "Как мне запросить игру/анимацию?",
  "FAQ_Answer7": "Вы можете сделать запрос, прочитав сначала до конца {эту статью}, а затем перейдя по ссылкам внизу.",
  "FAQ_Question8": "Могу ли я самостоятельно добавить игру/анимацию?",
  "FAQ_Answer8": "Да! Следуйте инструкциям, приведённым в {руководстве по кураторству}, чтобы пройти кураторское прослушивание. После того, как вы будете приняты, вы сможете отправить столько игр/анимаций (кураций, одним словом), сколько пожелаете.",
  "FAQ_Question9": "Я хочу внести свой вклад другим способом (программирование, тестирование и т.д.). Как я могу помочь?",
  "FAQ_Answer9": "Присоединяйтесь к нашему {Discord-серверу} для получения более подробной информации. Большая часть нашей работы и общения проходит там.",
  "FAQ_Question10": "Открыт ли исходный код Flashpoint?",
  "FAQ_Answer10": "Да... почти. Исходники наших собственных технологий, таких как лаунчер, доступны на нашем {GitHub}. Исходные коды программ, которые мы включаем в Flashpoint, доступны на соответствующих сайтах (мы не изменяем исходники включённых в Flashpoint программ). Бинарники самих веб-плагинов не являются открытыми, но если б они были открыты, нас бы здесь не было.",
  "FAQ_Question11": "Могу ли я использовать ваш логотип? Доступен ли он под лицензией Creative Commons?",
  "FAQ_Answer11": "Да — логотип распространяется под лицензией {CC-BY 4.0}. При указании авторства вы можете по желанию указать Seirade и Flashpoint. Исходные файлы можно найти {здесь}.",
  "FAQ_Question12": "Где можно сделать пожертвование проекту?",
  "FAQ_Answer12": "Flashpoint Archive существует как некоммерческий проект. Более подробную информацию о том, как сделать пожертвование и куда пойдут ваши деньги, вы можете найти на нашей {странице Open Collective}.",
  "FAQ_Question13": "Flashpoint работает неправильно!",
  "FAQ_Answer13": "Выполните действия по устранению неполадок, перечисленные в {руководстве}. Если после этого у вас остались проблемы, обратитесь за помощью в наш Discord.",
  "FAQ_Question14": "Я хочу, чтобы игра/анимация была удалена из Flashpoint по тем или иным причинам.",
  "FAQ_Answer14": "Сообщите нам об этом либо через Discord, либо {прямо по электронной почте}. Мы, вероятно, попытаемся убедить вас разрешить нам сохранить вашу игру в исторических целях, но мы небезосновательны.",
  "FAQ_Question15": "У меня другой вопрос.",
  "FAQ_Answer15": "Обратитесь к нашему {расширенному FAQ}. Если на ваш вопрос там нет ответа, присоединяйтесь к нашему серверу в Discord."
}