{
  "FAQ_Title": "Часто задаваемые вопросы",
  "FAQ_Question1": "Didn't this used to be called BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Yes - the project used to operate with BlueMaxima in the name until his retirement from the project in January 2023.",
  "FAQ_Question2": "Какие операционные системы поддерживаются?",
  "FAQ_Answer2": "Flashpoint поддерживает Windows 7 SP1 и более новые версии (за исключением стоковой Windows 8). Доступны также версии для MacOS и Linux, однако они требуют дополнительных шагов для установки и могут работать только с некоторыми из наиболее популярных браузерных технологий.",
  "FAQ_Question3": "Есть ли у Flashpoint проблемы с безопасностью?",
  "FAQ_Answer3": "Насколько нам известно, нет. Весь наш набор приложений (за исключением технологии загрузки игр Infinity) не может подключаться к открытому Интернету; все изменения в реестре, внесённые Flashpoint Secure Player, удаляются после закрытия игры; все входящие файлы проходят через компьютер с надёжным и актуальным антивирусным ПО; и, самое главное, программа запуска и всё внутреннее устройство Flashpoint {свободны и имеют открытый исходный код}. Мы сделали всё возможное, чтобы коллекция была максимально безопасной, но, несмотря на наши усилия, некоторые антивирусы, такие как Avast и AVG, определяют важные компоненты как опасные. Если вы столкнулись с этой проблемой, ознакомьтесь с инструкциями по устранению неполадок на {этой странице}.",
  "FAQ_Question4": "Сколько всего игр и анимаций вы собрали?",
  "FAQ_Answer4": "Flashpoint currently offers over {} games and {} animations. You can search the collection without downloading Flashpoint {here}.",
  "FAQ_Question5": "What browser platforms does Flashpoint preserve?",
  "FAQ_Answer5": "We preserve games and animations running on every platform listed at the Flashpoint Database's {statistics page}.",
  "FAQ_Question6": "Где игры Nitrome?",
  "FAQ_Answer6": "Компания Nitrome вежливо попросила нас удалить её материалы из коллекции. Если вы хотите поиграть в их игры, сделайте это на их {веб-сайте}, а если Flash — не вариант, то следите за их растущим {HTML5-совместимым каталогом}. {Flashpoint не одобряет травлю и преследования в связи с решением Nitrome}.",
  "FAQ_Question7": "Как мне запросить игру/анимацию?",
  "FAQ_Answer7": "Вы можете сделать запрос, прочитав сначала до конца {эту статью}, а затем перейдя по ссылкам внизу.",
  "FAQ_Question8": "Могу ли я самостоятельно добавить игру/анимацию?",
  "FAQ_Answer8": "Yes! Follow the instructions listed in the {curation tutorial} to set up your curator audition. Once it's accepted, you can submit as many more curations as you desire.",
  "FAQ_Question9": "Я хочу внести свой вклад другим способом (программирование, тестирование и т.д.). Как я могу помочь?",
  "FAQ_Answer9": "Присоединяйтесь к нашему {Discord-серверу} для получения более подробной информации. Большая часть нашей работы и общения проходит там.",
  "FAQ_Question10": "Открыт ли исходный код Flashpoint?",
  "FAQ_Answer10": "Да... почти. Исходники наших собственных технологий, таких как лаунчер, доступны на нашем {GitHub}. Исходные коды программ, которые мы включаем в Flashpoint, доступны на соответствующих сайтах (мы не изменяем исходники включённых в Flashpoint программ). Бинарники самих веб-плагинов не являются открытыми, но если б они были открыты, нас бы здесь не было.",
  "FAQ_Question11": "Могу ли я использовать ваш логотип? Доступен ли он под лицензией Creative Commons?",
  "FAQ_Answer11": "Yes - the logo falls under the {CC-BY 4.0} license. For attribution, you may optionally credit Seirade and Flashpoint. Source files can be found {here}.",
  "FAQ_Question12": "Где можно сделать пожертвование проекту?",
  "FAQ_Answer12": "Flashpoint Archive operates as a non-profit collective. You can find more details about how to donate and where your money goes on our {Open Collective page}.",
  "FAQ_Question13": "Flashpoint работает неправильно!",
  "FAQ_Answer13": "Выполните действия по устранению неполадок, перечисленные в {руководстве}. Если после этого у вас остались проблемы, обратитесь за помощью в наш Discord.",
  "FAQ_Question14": "Я хочу, чтобы игра/анимация была удалена из Flashpoint по тем или иным причинам.",
  "FAQ_Answer14": "Сообщите нам об этом либо через Discord, либо {прямо по электронной почте}. Мы, вероятно, попытаемся убедить вас разрешить нам сохранить вашу игру в исторических целях, но мы небезосновательны.",
  "FAQ_Question15": "У меня другой вопрос.",
  "FAQ_Answer15": "Обратитесь к нашему {расширенному FAQ}. Если на ваш вопрос там нет ответа, присоединяйтесь к нашему серверу в Discord."
}