{
  "News_Title": "Новости",
  "News_Para1": "Все значимые события в истории Flashpoint на октябрь 2019 года. Наведите курсор на кодовое название версии, чтобы получить пояснения от BlueMaxima, основателя проекта.",
  "News_Para2": "Журнал изменений, включающий все версии, выпущенные до перехода на компонентную систему, можно найти {здесь}{here}. Ссылки на прямую загрузку старых версий Flashpoint Ultimate можно найти на страницах BlueMaxima и Dri0m в Internet Archive, здесь{here} и здесь{here} соответственно.",
  "News_Flashpoint_Started": "Началась работа над Flashpoint от BlueMaxima.",
  "News_Flashpoint_0": "Выпущен Flashpoint Zero.",
  "News_Flashpoint_1": "Выпущена первая версия Flashpoint.",
  "News_Was_Released": "был(а) выпущен",
  "News_Flashpoint_3_0": "Keys to the Kingdom",
  "News_Flashpoint_3_0_Meta": "В этой версии появился Redirector, который стал последним кусочком головоломки в настройке сервера и позволил нам сохранить 99,9% Flash-игр без взлома. Ключи от королевства презервации Flash, если хотите.",
  "News_Flashpoint_3_1": "Opening Night",
  "News_Flashpoint_3_1_Meta": "В этой версии впервые появился Flashpoint Theatre (хотя в то время он был отдельной версией LaunchBox).",
  "News_Flashpoint_3_2": "Shock and Awe",
  "News_Flashpoint_3_2_Meta": "Эта версия стала первой, которая поддерживает игры Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Названа в честь того, что к этому моменту в нашей коллекции было уже более 4,000 игр. Боже, как летит время.",
  "News_Flashpoint_4_0": "The Living Infinite",
  "News_Flashpoint_4_0_Meta": "В этой версии появился Flashpoint Infinity, позволяющий играть в игры из Интернета. Название взято из одноимённого альбома группы Soilwork 2013 года.",
  "News_Flashpoint_4_1": "Javality",
  "News_Flashpoint_4_1_Meta": "Именно в этой версии появилась поддержка Java-апплетов. Название придумал DarkMoe.",
  "News_Flashpoint_5_0": "Go For Launch",
  "News_Flashpoint_5_0_Meta": "Лаунчер, который мы все знаем и любим, был представлен именно в этой версии.",
  "News_Flashpoint_5_1": "The Great Filter",
  "News_Flashpoint_5_1_Meta": "Здесь были добавлены плейлисты (фильтры, если хотите). Название взято из EP Mesarthim, The Great Filter.",
  "News_Flashpoint_5_2": "Type III",
  "News_Flashpoint_5_2_Meta": "The Great Filter и Type III - два EP Mesarthim, которые часто ставят друг другу. Ни одно другое название не подошло, когда оно нам понадобилось.",
  "News_Flashpoint_5_3": "Революция",
  "News_Flashpoint_5_3_Meta": "Выпуск этой версии был приурочен к первой годовщине Flashpoint, и мы посчитали, что это действительно революция (первоначально она также должна была называться \"Орбита\", но это было глупое название для данной концепции).",
  "News_Flashpoint_5_4": "Recombination",
  "News_Flashpoint_5_4_Meta": "В этой версии анимации были включены вместе с играми. Ранее они находились в отдельных папках с отдельными клиентами. 'Recombination' и '74%' также оказались названиями двух композиций из альбома Mesarthim, The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Быстрый набор исправлений, сделанные вместе с загрузкой версии 5.4. Не то чтобы Flashpoint 5.4 был завершен только на 74%, когда мы его выкладывали.",
  "News_Flashpoint_5_5": "Iron & Copper",
  "News_Flashpoint_5_5_Meta": "BlueMaxima в то время слишком много играл в Deus Ex.",
  "News_Flashpoint_6_0": "Alignment",
  "News_Flashpoint_6_0_Meta": "Ещё одна отсылка на Mesarthim!",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "Игра терминов \"freeware\" и \"shareware\", широко используемыми в технологиях.",
  "News_Flashpoint_6_2": "Moe's Great Escape",
  "News_Flashpoint_6_2_Meta": "DarkMoe подготовил для этой версии поистине безумное количество игр жанра \"сбеги из комнаты\".",
  "News_Flashpoint_6_3": "We're Talking About Flash Games, Not Abstract Philosophy",
  "News_Flashpoint_6_3_Meta": "Назван в честь бесцеремонной фразы Nosamu, одного из разработчиков.",
  "News_Old_Releases_Title": "Ретроактивная Хронология Релизов",
  "News_Old_Releases_Description": "В связи с тем, что колонка новостей появилась только в декабре 2019 года, большинство версий до этого времени не были задокументированы. В этом разделе описаны все недостающие версии.",
  "News_Is_Available": "теперь доступно!",
  "News_Grab_Download": "Скачайте здесь: {downloads page}",
  "News_Flashpoint_Update_October_2019": "Обновление статуса Flashpoint на октябрь 2019 года теперь доступно на Medium. Ознакомьтесь с ним здесь{here}.",
  "News_Flashpoint_Update_November_2019": "Обновление статуса Flashpoint на ноябрь 2019 года теперь доступно на Medium. Ознакомьтесь с ним здесь{here}.",
  "News_Flashpoint_7_0": "Eight Thousand Hours",
  "News_Flashpoint_7_0_Meta": "Восемь тысяч часов - примерно столько оставалось жить Flash на момент выхода.",
  "News_Flashpoint_7_1": "Stay on Target",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0, по нашим меркам, получился не удачным. 7.1 - это релиз с кучей исправлений.",
  "News_Featured_Kotaku_Link": "О нас написали на Kotaku!",
  "News_Featured_Kotaku_Rest": "Это огромное достижение. Спасибо за поддержку!",
  "News_Flashpoint_Update_March_2020": "Обновление статуса Flashpoint на март 2020 года теперь доступно на Medium. Ознакомьтесь с ним здесь{here}.",
  "News_Flashpoint_Update_April_2020": "Обновление статуса Flashpoint на апрель 2020 года теперь доступно на Medium. Ознакомьтесь с ним здесь{here}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "В этой версии прекращена работа программы Redirector, ранее использовавшейся для обеспечения работы сервера. Код HTTP 301 \"перемещён навсегда\", т. е. больше не перенаправляет.",
  "News_Flashpoint_Update_June_2020": "Мини-обновление статуса Flashpoint на июнь 2020 года теперь доступно на Medium. Ознакомьтесь с ним здесь{here}.",
  "News_Flashpoint_8_1": "Spirit of Adventure",
  "News_Flashpoint_8_1_Meta": "Назван в честь строки из недавно вышедшего альбома Aether Realm \"Redneck Vikings from Hell\". А точнее, трека \"One Hollow Word\".",
  "News_Flashpoint_Update_August_2020": "Обновление статуса Flashpoint на август 2020 года теперь доступно на Medium. Ознакомьтесь с ним здесь{here}.",
  "News_Flashpoint_8_2": "Approaching Planet Nine",
  "News_Flashpoint_8_2_Meta": "Это (с большой натяжкой) порт-манто из \"приближающейся девятой версии\" и названия EP от Mesarthim, Planet Nine.",
  "News_Flashpoint_9_0": "Glorious Sunset",
  "News_Flashpoint_9_0_Meta": "Названа в честь песни Glorious Morning, наиболее известной по игре Age of War. Это была последняя версия, выпущенная перед смертью Flash, отсюда и название \"Закат\".",
  "News_Flashpoint_Update_April_2021": "Сегодня вышло обновление статуса Flashpoint на апрель 2021 года. Ознакомьтесь с ним здесь{here}.",
  "News_Flashpoint_10_0": "Absence",
  "News_Flashpoint_10_0_Meta": "Это первая версия, выпущенная после смерти Flash, отсюда и название \"Отсутствие\". Также так назывался последний трек в EP от Mesarthim \"Vacuum Solution\".",
  "News_Flashpoint_10_1": "Отсутствие II",
  "News_Flashpoint_10_1_Meta": "А вот угадайте.",
  "News_Flashpoint_11": "Упс, Все Плагины!",
  "News_Flashpoint_11_Meta": "Это мем, потому что версия 11 добавила три десятка новых плагинов.",
  "News_Flashpoint_11_1": "Операция \"Цветение Вишни\"",
  "News_Flashpoint_11_1_Meta": "Отсылка к игре Muv-Luv (идите и купите её в Steam).",
  "News_Flashpoint_12": "Аксолотль",
  "News_Flashpoint_12_meta": "Они милые и вообще классные."
}