{
  "News_Title": "Новости",
  "News_Description": "Все основные события в истории Flashpoint по состоянию на октябрь 2019.",
  "News_Flashpoint_Started": "Запуск BlueMaxima's Flashpoint.",
  "News_Flashpoint_0": "Flashpoint Ноль был выпущен.",
  "News_Flashpoint_1": "Выпущена первая версия Flashpoint.",
  "News_Was_Released": "был выпущен",
  "News_Flashpoint_3_0": "Ключи от королевства",
  "News_Flashpoint_3_0_Meta": "В этой версии появился Redirector, который стал последней частью головоломки в настройке сервера, позволяющей нам сохранить 99,9% Flash-игр без взлома. Ключи к королевству сохранения Flash, если хотите.",
  "News_Flashpoint_3_1": "Ночь открытия",
  "News_Flashpoint_3_1_Meta": "В этой версии впервые появился Flashpoint Theatre (хотя в то время это был отдельный экземпляр LaunchBox).",
  "News_Flashpoint_3_2": "Шок и трепет",
  "News_Flashpoint_3_2_Meta": "Эта версия была первой, поддерживающей игры Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Названа в честь того, что к этому моменту в нашей коллекции было уже более 4,000 игр. Боже, как летит время.",
  "News_Flashpoint_4_0": "Живая бесконечность",
  "News_Flashpoint_4_0_Meta": "В этой версии был представлен Flashpoint Infinity, который позволяет людям играть в игры из Интернета. Название взято из одноимённого альбома Soilwork 2013 года.",
  "News_Flashpoint_4_1": "Javality",
  "News_Flashpoint_4_1_Meta": "Это была версия, в которой появилась поддержка Java-апплетов. Название придумал DarkMoe.",
  "News_Flashpoint_5_0": "Приготовьтесь к запуску",
  "News_Flashpoint_5_0_Meta": "Лаунчер, который мы все знаем и любим, был представлен в этой версии.",
  "News_Flashpoint_5_1": "Великий фильтр",
  "News_Flashpoint_5_1_Meta": "Здесь были добавлены плейлисты (фильтры, если хотите). Название взято из EP Mesarthim, The Great Filter.",
  "News_Flashpoint_5_2": "Тип III",
  "News_Flashpoint_5_2_Meta": "The Great Filter и Type III - два EP Mesarthim, которые часто ставят вместе. Ни одно другое название не подошло, когда оно нам понадобилось.",
  "News_Flashpoint_5_3": "Революция",
  "News_Flashpoint_5_3_Meta": "Эта версия была выпущена к первой годовщине проекта Flashpoint, и мы посчитали, что это действительно революция. (Первоначально она также должна была называться \"Орбита\", но это было глупое название для концепции).",
  "News_Flashpoint_5_4": "Рекомбинация",
  "News_Flashpoint_5_4_Meta": "В этой версии анимации были перемещены вместе с играми, которые ранее находились в отдельных папках с отдельными клиентами. \"Рекомбинация\" и \"74%\" также являются названиями двух композиций в альбоме Mesarthim - The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Быстрый набор исправлений ускорил время загрузки 5.4. Не то чтобы Flashpoint 5.4 был завершён лишь на 74%, когда мы его выпустили.",
  "News_Flashpoint_5_5": "Железо и медь",
  "News_Flashpoint_5_5_Meta": "BlueMaxima в то время слишком много играл в Deus Ex.",
  "News_Flashpoint_6_0": "Выравнивание",
  "News_Flashpoint_6_0_Meta": "Ещё одна отсылка на Mesarthim!",
  "News_Flashpoint_6_1": "Программа сохранения",
  "News_Flashpoint_6_1_Meta": "Игра с терминами программного обеспечения, широко используемыми в технике, такими как \"freeware\" и \"shareware\".",
  "News_Flashpoint_6_2": "Большой побег Moe",
  "News_Flashpoint_6_2_Meta": "Сотрудник DarkMoe подготовил поистине безумное количество игр жанра \"сбеги из комнаты\" в этой версии.",
  "News_Flashpoint_6_3": "Мы говорим о Flash-играх, а не об абстрактной философии",
  "News_Flashpoint_6_3_Meta": "Назван в честь фразы Nosamu, одного из сотрудников.",
  "News_Old_Releases_Title": "Ретроактивная хронология релизов",
  "News_Old_Releases_Description": "Из-за того, что колонка новостей появилась только в декабре 2019 года, большинство релизов до этого момента остались без каталогов. В данном разделе представлены эти отсутствующие версии.",
  "News_Is_Available": "теперь доступно!",
  "News_Grab_Download": "Скачайте здесь: {downloads page}",
  "News_Flashpoint_Update_October_2019": "Обновление статуса Flashpoint на октябрь 2019 года теперь доступно на Medium. Ознакомьтесь с ним {here}.",
  "News_Flashpoint_Update_November_2019": "Обновление статуса Flashpoint на ноябрь 2019 года теперь доступно на Medium. Ознакомьтесь с ним {here}.",
  "News_Flashpoint_7_0": "Восемь тысяч часов",
  "News_Flashpoint_7_0_Meta": "Восемь тысяч часов - примерно столько оставалось жить Flash на момент выхода этой версии.",
  "News_Flashpoint_7_1": "Не отклоняйтесь от цели",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0, по нашим стандартам, вышла мусорной. 7.1 стал тяжёлым релизом с кучей исправлений ошибок.",
  "News_Featured_Kotaku_Link": "О нас написали на Kotaku!",
  "News_Featured_Kotaku_Rest": "Это огромное достижение. Спасибо за поддержку!",
  "News_Flashpoint_Update_March_2020": "Обновление статуса Flashpoint на март 2020 года теперь доступно на Medium. Ознакомьтесь с ним {here}.",
  "News_Flashpoint_Update_April_2020": "Обновление статуса Flashpoint на апрель 2020 года теперь доступно на Medium. Ознакомьтесь с ним {here}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "В этой версии был положен конец программе Redirector, ранее использовавшейся для обеспечения работы сервера. Код HTTP 301 \"перемещён навсегда\". Это значит, что больше перенаправлять не будет.",
  "News_Flashpoint_Update_June_2020": "Мини-обновление статуса Flashpoint на июнь 2020 года теперь доступно на Medium. Ознакомьтесь с ним {here}.",
  "News_Flashpoint_8_1": "Дух приключений",
  "News_Flashpoint_8_1_Meta": "Назван в честь строки из тогдашнего альбома Aether Realm, Redneck Vikings from Hell. А именно, трека \"One Hollow Word\".",
  "News_Flashpoint_Update_August_2020": "Обновление статуса Flashpoint на август 2020 года теперь доступно на Medium. Ознакомьтесь с ним {here}.",
  "News_Flashpoint_8_2": "Приближение к девятой планете",
  "News_Flashpoint_8_2_Meta": "Можно с натяжкой сказать, что это портманто из \"приближающейся девятой версии\" и Planet Nine, the Mesarthim EP.",
  "News_Flashpoint_9_0": "Славный закат",
  "News_Flashpoint_9_0_Meta": "Названа в честь Glorious Morning, песни, наиболее известной в Age of War. Это была последняя версия, выпущенная перед смертью Flash, поэтому она названа \"Закат\".",
  "News_Flashpoint_Update_April_2021": "Сегодня вышло обновление статуса Flashpoint на апрель 2021 года. Ознакомьтесь с ним {here}.",
  "News_Flashpoint_10_0": "Отсутствие",
  "News_Flashpoint_10_0_Meta": "Это первая версия, выпущенная для пост-Flash Интернета, отсюда и название \"Отсутсвие\". Это также название последнего трека на EP Mesarthim \"Vacuum Solution\".",
  "News_Flashpoint_10_1": "Отсутствие 2",
  "News_Flashpoint_10_1_Meta": "Попробуйте угадать.",
  "News_Flashpoint_11": "Упс, все плагины!",
  "News_Flashpoint_11_Meta": "Это мем, потому что 11 добавил три дюжины новых плагинов."
}