{
  "Platforms_Title": "Поддерживаемые платформы",
  "Platforms_Description1": "Flashpoint поддерживает игры и анимацию, созданные не только для Flash, но и для различных веб-плагинов и стандартов в том числе. Начиная с версии 11, на этой странице представлена история каждой технологии. Актуальную статистику по количеству релизов для каждой платформы можно посмотреть на странице {Flashpoint Database}.",
  "Platforms_Description2": "Это краткий обзор на тему \"Кто? Когда? Что?\", а также отправная точка для дальнейших исследований. Он не является исчерпывающей историей каждой платформы. Мы стараемся предоставить точную информацию, но оплошности всё ещё возможны. Пожалуйста, свяжитесь с нами, если у вас есть соответствующая информация для исправления.",
  "Platforms_By": "по",
  "Platforms_3D_Groove_GX_Description": "Основанная в 1998 году компания The Groove Alliance была разработчиком 3D Groove SX, движка для трехмерных игр с поддержкой Shockwave. Позднее, в 2002 году, движок отделился от Shockwave и был переименован в 3D Groove GX. Оба варианта могли использоваться для разработки онлайн-игр и настольных приложений. Это принесло компании успех, собрало большую базу корпоративных пользователей и привело к созданию нескольких громких тайтлов для телевизионных шоу и других категорий. После того как шумиха утихла, в 2008 году The Groove Alliance была преобразована в OTOY, но сайт 3D Groove оставался открытым до 2009 года. Точные причины закрытия компании неизвестны, но было подтверждено, что в ней происходил внутренний конфликт.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (ранее 3D Life Player, Virtools Player и NeMo Web Player, не путать с 3DVIA Studio/Beta Player или 3DVIA Composer Player) - это плагин для браузера, разработанный компанией Dassault Systèmes для воспроизведения 3D приложений, созданных в Virtools. Он предназначался для расширенных практических применений 3D, таких как компьютерное обучение, виртуальные туры и недвижимость. 3DVIA Player также использовался для создания веб-игр, основными пользователями которого были квебекская игровая студия Sarbakan и амстердамская компания Little Chicken Game Company. Последнее обновление, версия 5.0, было выпущено в 2009 году. Страница загрузки оставалась актуальной все последующие годы, пока не была удалена в 2016 году. К тому времени она была установлена более 30 миллионов раз.",
  "Platforms_AboutPeople_Description": "Нет описания.",
  "Platforms_AboutTime_Description": "Нет описания.",
  "Platforms_ActiveX_Controls_Description": "Выпущенный в 1996 году компанией Microsoft, ActiveX представляет собой программный фреймворк, служащий стандартом, позволяющим инкапсулировать программы как контейнеры для использования в других несвязанных программах, называемых ActiveX Controls. Их можно было встраивать в HTML-контент, а также создавать отдельные элементы управления специально для использования в Internet Explorer с целью воспроизведения веб-игр. После запуска Edge в 2015 году поддержка фреймворка была прекращена, а его использование в веб-приложениях перешло в Internet Explorer 11 для поддержки устаревших программ.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Atmosphere Player - это веб-плагин, созданный в 1996 году под названием V3O компанией Rocket Science Games, позже перешедший в компанию Attitude Software и получивший название 3D Anarchy, а затем проданный Adobe в 2000 году и переименованный в Atmosphere Player в 2001 году. Он предназначен для просмотра интерактивных 3D-миров, аналогичных стандарту VRML, созданных в Atmosphere Builder. В основном он предназначался для виртуальных медиа-галерей, в которых могли быть представлены изображения/аудио/видео и сами 3D-модели. В начале своего существования под названием 3D Anarchy программа находилась ещё в стадии бета-версии. Когда Adobe приобрела её для дальнейшего развития, она провела следующие 3 года в стадии бета-тестирования, а релиз версии 1.0 был выпущен в феврале 2004 года. В декабре 2004 года было объявлено о прекращении поддержки Atmosphere в январе 2005 года.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (также просто Flash, ранее Macromedia Shockwave Flash Player) - это проигрыватель векторной анимации и графики, часто с добавлением интерактивности. Благодаря эффективному сжатию, низкой цене, простоте использования и большому количеству инсталляций он был использован в качестве движка для многих веб-игр. Разработанный в 1995 году и впервые представленный компанией FutureWave в 1996 году, он не содержал практически ничего, кроме базовых анимаций и кнопок для управления ими. По мере роста популярности проигрывателя в него добавлялись более совершенные функции, такие как язык программирования ActionScript. Однако по мере того, как люди стали опасаться потенциальных проблем с безопасностью, а HTML5 набирал популярность среди веб-разработчиков, компания Adobe объявила о прекращении поддержки Flash с датой 31 декабря 2020 года.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (также Shockwave, ранее Macromedia Shockwave Player или Shockwave Director Player) - проигрыватель для интерактивных медиа, выпущенный в 1995 году. Созданный на основе технологии, разработанной 10 лет назад компанией MacroMind, он стал веб-плагином только после приобретения компании Macromedia. В отличие от Flash, в Shockwave использовался скриптовый язык Lingo и поддержка языка C++ с помощью Xtras, что дало плееру широкий спектр возможностей, включая 3D. Платформа получила широкое распространение как в раннем Интернете, так и в играх на CD-ROM, и завоевала широкую популярность. После приобретения компанией Adobe компании Macromedia популярность платформы значительно снизилась в пользу Flash, которая быстро расширяла свои функциональные возможности и также принадлежала Adobe. В феврале 2019 года компания Adobe объявила о прекращении его разработки и через два месяца прекратила поддержку.",
  "Platforms_Alambik_Plugin_Description": "Alambik Plugin - это веб-плеер для контента, созданного с помощью платформы разработки Alambik. Выпущенный в 2001 году, он мог работать с 2D- и 3D-графикой, векторами и многими другими применениями. В 2002 году компания Alambik провела конкурс с призами в честь выпуска Alambik Script. В 2004 году Alambik создал новый демо-сайт, но после этого компания замолчала, так и не выпустив ничего нового для платформы и не обновив плагин.",
  "Platforms_Ambulant_Description": "Ambulant - это плеер для SMIL-файлов, созданный амстердамской компанией CWI. Название, по-видимому, отсылает к слову \"ambulation\", что в переводе означает \"ходьба\"; в пользу этого говорит и логотип, изображающий идущего человека. Файловое расширение SMIL был разработан W3C, международным веб-консорциумом, но не получил широкого распространения. Ambulant попытался стать плеером с открытым исходным кодом, поддерживающим все файлы SMIL. Однако стремление сделать программу открытой не позволило ему поддерживать некоторые проприетарные медиаформаты. Разработка началась в апреле 2003 года, а первая версия, \"AMBULANT/G\", была выпущена в июле того же года. Последняя стабильная версия, 2.6, была выпущена в феврале 2015 года, однако работа над нестабильной сборкой Ambulant 2.7 продолжалась до июля 2016 года, когда была сделана последняя правка в репозитории Github. Разработчики Ambulant продолжают активно работать над другими проектами.",
  "Platforms_AnimaFlex_Description": "AnimaFlex - это плагин для воспроизведения графики, позволяющий проигрывать анимации с небольшим размером файла, созданные с помощью RubberWeb Composer, которые могут растягивать и искажать изображения. Он мог начинать воспроизведение анимации до загрузки всего файла и подстраиваться под низкие скорости Интернета. Несмотря на обещания, у самой RubberFlex было несколько других продуктов, все экспортирующие gif-файлы и конкурирующие с их собственным вариантом. Более того, был выпущен FlexToGif для конвертации файлов плагина в gif-файлы через 2 дня после появления плагина. К началу 1998 года распространение RubberWeb Composer прекратилось, оставив AnimaFlex без авторской программы.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics - программа для создания презентаций, созданная в 1986 году компанией Software Publishing Corporation (SPC) для ПК с операционной системой MS-DOS. После перехода на Windows в 1991 году она не смогла вернуть себе ту долю рынка, которую занимала, и уступила PowerPoint. В 1996 году компания Allegro New Media (в том же году переименованная в Vizacom) купила SPC и Serif. SPC создала программу ASAP WordPower, позволяющую легко создавать слайд-шоу, которые можно было публиковать в Интернете с помощью плагина ASAP WebShow. В 1997 году SPC объединилась с Serif. В 1998 году бренд Harvard был возрожден с помощью авторской программы Harvard Graphics 98, а плагин был заменён на новый под названием Harvard Graphics WebShow. В 2000 году в новой версии авторской программы Advanced Presentations был реализован экспорт в стандарт Flash вместо проприетарного формата плагина. В 2001 году компания Vizacom продала Serif своему первоначальному руководству, которое перевело линейку Harvard в разряд устаревшего программного обеспечения, которое поддерживалось и продавалось до прекращения выпуска в 2017 году.",
  "Platforms_Authorware_Web_Player_Description": "Authorware Web Player был создан компанией Macromedia в 1996 году как одна из новых возможностей Authorware 3.5. Он был создан как средство запуска интерактивных программ, разработанных с помощью Macromedia Authorware, в Интернете. В отличие от большинства веб-плагинов, основное назначение Authorware заключалось в помощи электронному обучению, что привело к его использованию на предприятиях и в академической среде как способа сборки мультимедийных учебных материалов без необходимости программирования. Последняя версия плагина была выпущена в 2004 году, до приобретения компании Macromedia фирмой Adobe в 2005 году, после чего разработка плагина приостановилась и в 2007 году было объявлено о прекращении его поддержки.",
  "Platforms_Autodesk_MapGuide_Description": "Нет описания.",
  "Platforms_AXEL_Player_Description": "AXEL Player - плагин для интерактивного 3D-контента, созданный компанией MindAvenue в 2002 году. Он представлял собой способ просмотра моделей и анимации в программе веб-авторинга AXELedge, а также AXELpublisher, который конвертировал файлы из других 3D-программ, таких как 3ds Max. Программа была хорошо принята критиками, несмотря на ряд ограничений, одним из которых было отсутствие большого количества пользователей для плагина. В 2005 году MindAvenue была приобретена компанией 20-20 Technologies, специализирующейся на разработке программного обеспечения для дизайна интерьеров и мебели, а в 2006 году её сайт стал перенапрвлять на сайт 20-20. Поддержка всех продуктов под маркой AXEL, включая плагин, была прекращена.",
  "Platforms_BitPlayer_Description": "BitPlayer - настольное приложение на базе технологий Flash и Shockwave, созданное в 1999 году голландской компанией BitMagic. Оно предлагало ежедневные короткометражные ролики собственного производства и клиентов, которые сопровождались рекламой и викторинами. Первоначальная стоимость проекта составляла 6 млн. долларов США, но в январе 2001 года он прекратил своё существование, став жертвой краха \"доткомов\" вслед за своими рекламодателями. Большая часть его содержимого сохранилась в виде конвертированных SWF-файлов, несмотря на потерю дополнительных функций, которые предоставлял плеер.",
  "Platforms_Blender_Description": "Blender - это программный инструмент для создания трехмерных изображений, созданный в 1994 году голландской анимационной студией NeoGeo. Его первая версия была выпущена в 1995 году. В 1998 году компания была распущена, но её совладелец Тон Розендаал создал компанию Not a Number Technologies (NaN) для дальнейшего развития Blender. Версия 2.0, известная также как GameBlender, вышла в 2000 году и была ориентирована на интерактивность и разработку игр. В связи с этим в 2001 году был выпущен плагин для браузеров, как открытая бета-версия, а вторая бета-версия была запущена в январе 2002 года. Несмотря на ранний успех, возникли финансовые проблемы, и в начале 2002 года NaN закрылась. Тогда Розендаль решил сделать Blender с открытым исходным кодом и добился успеха, собрав краудфандинг для выкупа акций у инвесторов. Были предприняты попытки продолжить разработку плагина, но переход на открытый код привел к отсутствию компонентов для игрового движка; его восстановление стало первоочерёдной задачей, и работа над плагином была приостановлена. Последняя версия плагина оставалась доступной в сети в течение нескольких лет, но в 2005 году она была удалена, так как не было ни поддержки, ни планов по выпуску новой версии.",
  "Platforms_Burster_Description": "Burster - это реализация игрового движка Blender Game Engine 2010 года. Проект представлял собой попытку возродить официальный плагин, выпущенный для Blender и прекративший свое существование по соображениям безопасности. Он был усовершенствован по сравнению с оригиналом и использовал преимущества новых версий движка для повышения производительности и улучшения графики. Последняя версия была выпущена в 2013 году, и после трех лет отсутствия обновлений поддержка была официально прекращена в 2016 году. Сам игровой движок был удален из Blender в 2018 году.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin - это инструмент для повышения производительности, созданный компанией Logic Pulse в 1996 году. Это была новая функция, добавленная в версию 3.2 Calendar Quick, настольного приложения для составления календарей и расписаний. Она позволяла пользователям публиковать их в Интернет с помощью функции экспорта и их можно было связывать с другими людьми и просматривать с помощью плагина. После исправления ошибки Y2K в 1999 году сайт прекратил работу спустя 2 года, в 2001 году.",
  "Platforms_Cult3D_Description": "Cult3D - это веб-просмотрщик 3D-контента, созданного с помощью программы Cult3D Designer. Он пользовался умеренным успехом: к 2001 году число его пользователей достигло 6 млн. человек, его использовали несколько известных клиентов, а также были добавлены возможности импорта 3D-моделей из других программ. Последняя версия 5.3 была выпущена в 2002 году, а последнее обновление плагина было выпущено в 2004 году, когда технология была продана компании Mental Images GmbH. Позднее, в 2007 году, компания Nvidia приобрела Mental Images и создала дочернюю компанию Nvidia Advanced Rendering Center. Несмотря на обновление сайта, сам плагин не получал обновлений, и с 2011 года его поддержка была прекращена, а страница загрузок поддерживалась благодаря пользователям, у которых ещё была лицензия на программу, но была удалена в 2013 г.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion - это линейка AR-программ (дополненная реальность), начавших разрабатываться в 1999 году компанией Total Immersion и использующих видеокамеры для отображения 3D-объектов в реальном времени. Одной из таких программ была D'Fusion @Home, выпущенная в 2008 году и дополненная плагином в 2009 году. Приложения для нее создавались с помощью программы D'Fusion Studio, а основной упор делался на маркетинг и короткие опыты. К 2011 году технология с трудом достигла широкого распространения. Даже с учётом более доступной реализации Flash и бесплатного авторского программного обеспечения, его применение оставалось весьма ограниченным. После появления смартфонов была разработана технология TryLive как ещё одно AR-решение для удобного предварительного просмотра товаров, таких как мебель и очки, которое стало успешным, в отличие от линейки D'Fusion, которая после 2013 года больше не обновлялась. В 2015 году компания была продана компании ACEP, специализирующейся на производстве очков.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Нет описания.",
  "Platforms_DPGraph_Description": "Созданная в 1999 году Дэвидом Паркером программа DPGraph (Dynamic Photorealistic Graphing) представляет собой исполняемый файл, предназначенный для отображения графиков с веб-страниц. Они могут анимироваться и отображать до 8 измерений, с возможностью управления переменными. Она работает путем загрузки на веб-страницу файла, который указывает браузеру на необходимость запуска программы и отображения графиков. Полная версия была лицензирована нескольким учебным заведениям для использования в классах и кабинетах для создания графиков, а также бесплатный плеер для их просмотра. Последний раз она обновлялась в 2016 году, а в 2019 году полная версия DPGraph стала бесплатной для использования всеми желающими.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) - анимационный плагин, выпущенный компанией Sharp в 2001 году. Разработанный с учётом особенностей мобильных устройств, таких как телефоны и КПК, он был выпущен для некоторых моделей телефонов исключительно в Японии, а также в качестве плагина для браузера. Его особенностью был небольшой размер файла и векторная графика, подходящая для любого экрана мобильного устройства. Для американской аудитории технология была выпущена в 2002 году под названием SharpMotionART. Но ни та, ни другая технология не продержалась долго: в 2003 году e-animator получил своё последнее обновление, а в 2004 году его поддержка была прекращена.",
  "Platforms_Envoy_Description": "Envoy - формат документов, разработанный в 1993 году компанией Tumbleweed Software, созданный путём их виртуальной печати в WordPerfect. Он был конкурентом Adobe Acrobat и его формата PDF. В 1994 году корпорация WordPerfect была продана компании Novell, в состав которой вошел и Envoy, однако Tumbleweed продолжила сотрудничество с Novell, создав в 1995 году веб-плагин для просмотра файлов в Интернете. В 1996 году Novell продала WordPerfect компании Corel, но сохранила за собой право собственности на Envoy. К 1999 году Novell прекратила разработку Envoy, а Corel отказалась от поддержки Envoy в WordPerfect 2000. Это положило конец сотрудничеству Tumbleweed с Novell после приобретения Envoy в 1994 году, и поддержка плагина была прекращена.",
  "Platforms_EVA_Description": "EVA ({E}extended {V}ector {A}nimation) - анимационный плагин, разработанный компанией Sharp в 1997 году. Она имела несколько версий, поставляемых в комплекте с компьютерами Sharp и предназначенных для разных демографических групп, основной из которых была \"EVA Animator\". В 2000 году была выпущена \"детская\" версия \"EVA Animator Kids\" с веб-сайтом エバキッズクラブ (EVA Kids Club). В 2007 году их поддержка была прекращена и они были заменены \"EVA Animator School II\". Последнее крупное обновление плагина вышло в 2002 году, а в 2008 году было внесено одно незначительное исправление, но, несмотря на это, плагин сохранил небольшое сообщество пользователей, пока Sharp не закрыла основной сайт в 2016 году.",
  "Platforms_Flatland_Rover_Description": "Rover - это 3D-плагин, основанный на языке 3DML, разработанном в 1997 году компанией Flatland. Пользователи могли создавать \"пятна\" с помощью программы Spotnik, состоящие из \"уровней\", содержащих \"блоки\" для удобства разработки, и запускать их с помощью Rover, доступного как плагин для браузера и как отдельная программа. Разработка велась активно вплоть до краха доткомов, когда большая часть команды распалась, последнее обновление вышло в 2005 году, а сайт был заброшен и закрыт в 2012 году. В 2014 году один из бывших разработчиков, Майкл Пауэрс, решил возродить сайт, создать архив программы и обновить её для работы на современных системах. В 2017 году было обновлено отдельное приложение Rover, но плагин обновление не получил.",
  "Platforms_Formula_One_Description": "Нет описания.",
  "Platforms_Fractal_Viewer_Description": "Нет описания.",
  "Platforms_FreeHand_Description": "FreeHand - пакет для работы с векторной графикой, созданный в 1988 году компанией Altsys Corporation. В 1994 году компания Macromedia приобрела FreeHand и продолжила его развитие. В октябре 1996 года была выпущена версия FreeHand 7.0 с плагином для работы в Интернете под названием Shockwave for FreeHand. Плагин позволял встраивать и просматривать на веб-странице векторные изображения, созданные в программе. В ноябре 1996 года Macromedia купила FutureSplash, другой плагин для векторной графики, который был переименован в Flash.  В 1998 году была выпущена версия FreeHand 8.0, которая теперь экспортировалась во Flash, а не в плагин FreeHand. Последняя версия программы, FreeHand MX, была выпущена в 2003 году.",
  "Platforms_GoBit_Games_Plugin_Description": "Плагин GoBit Games Plugin был создан в 2008 году компанией GoBit, небольшой независимой студией, состоящей из бывших сотрудников PopCap. Их первая игра, Burger Shop, была выпущена в октябре 2007 года, а через 4 месяца по многочисленным просьбам пользователей была выпущена демо-версия игры с использованием нового на тот момент плагина Games Plugin. Прошел год, и демо-версия была переработана в рекламную игру для Eggo, опубликованную Shockwave.com 1 февраля 2009 года. Вскоре после этого от плагина отказались, выпустив Burger Shop 2, использующая вместо него Flash, - и Burger Shop, и его рескин остались единственными играми, созданными для него.",
  "Platforms_HotSauce_Description": "Meta Content Framework (MCF) - формат структурирования метаданных, разработанный группой расширенных технологий Apple Computer, начиная с 1995 года. В 1996 году Project X стал экспериментальным плагином, созданным для их просмотра в интернете, позже названный HotSauce, который отображает sitemaps в 3D-пространстве. В конце 1996 года на HotSauce работало 200 сайтов, позже число увеличилось до 300+. Была заключена сделка с NetCarta для создания библиотеки более 30000 веб-сайтов для навигации с помощью плагина. Хотя стандарт MCF получил некоторую высокую оценку, большинство пользователей не видели преимуществ этому трехмерному методу навигации, и проект в конце концов был отменён, когда Стив Джобс вернулся в Apple в 1997 году.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage - стандарт отображения документов через веб-браузер. HTML, разработанный Тимом Бернерсом-Ли в начале 1990-х годов (его корни уходят в 1980 год), стал основным методом обмена информацией через Интернет, а его возможности были расширены другими языками, такими как CSS и JavaScript. Впервые HTML появился в 1993 году, в 1995 году он был обновлён до HTML2, а в 1997 году - до HTML3 и HTML4. Последнее обновление HTML4 произошло в 2000 году, и в последующие годы сросшиеся языки практически не использовались в качестве платформ для игр, анимации и другого веб-контента, разработчики предпочитали использовать плагины, но с развитием технологий и Интернета плагины стали устаревать, поэтому были предприняты усилия по обновлению стандарта, и в 2008 году был запущен HTML5. По мере того как Flash и другие плагины выходили из моды, а HTML5 становился рекомендуемым стандартом, многие переводили свои проекты на семейство HTML или вообще отказывались от проприетарных плагинов, загружая контент на такие сайты, как YouTube. {Примечание: для краткости Flashpoint помечает все записи, не содержащие фреймворков или плагинов, как \"HTML\"}.",
  "Platforms_HyperG_Description": "Hyper-G - это система управления веб-контентом (WCMS) на базе Gopher, разработанная Институтом обработки информации и новых медиа с компьютерной поддержкой (IICM) Грацкого технологического университета (Австрия) в 1995 году. Она представляла собой альтернативу гиперссылкам WWW и использовала браузеры с поддержкой Hyper-G, которые могли отображать 3D-модели каталогов и файлов, а также другие модели с помощью встроенного просмотрщика. Из-за того, что он был основан на всё более устаревающей системе Gopher, предшественнице WWW, в 1996 году он был преобразован в Hyperwave, лишённый дополнительных возможностей, которые были в браузерах Hyper-G, например, 3D-функций. В настоящее время подавляющее большинство его содержимого утрачено из-за особенностей хранения файлов в Gopher.",
  "Platforms_Hypercosm_Player_Description": "Основанный на технологии, разрабатывавшейся с 1989 года, Hypercosm - это веб-плеер с 3D-контентом, выпущенный в 1999 году. Компания сделала большие инвестиции, которые не окупились, став одной из многочисленных жертв краха \"доткомов\" и закрывшись в 2001 году. Однако компания была куплена ORBITEC, и благодаря контракту с NASA ей удалось оправиться и продолжить работу над новыми проектами вплоть до реструктуризации в 2012 году, когда ORBITEC приостановила свою деятельность до появления нового бизнес-партнера, заинтересованного в работе с технологиями. Такового так и не появилось, что привело к закрытию Hypercosm в 2016 году.",
  "Platforms_Illuminatus_Description": "Нет описания.",
  "Platforms_iPix_Description": "Нет описания.",
  "Platforms_Java_Plugin_Description": "Появившись вместе с языком программирования Java в качестве одной из его функций, Java Applets представляли собой небольшие окна приложений, встраиваемые в страницы для получения дополнительных интерактивных возможностей. Они были созданы для обеспечения кросс-совместимости с различными операционными системами и браузерами, а также были более мощными, чем стандартный HTML. Более 10 лет они оставались функциональными, но с 2013 года технология, лежащая в основе апплетов, перестала поддерживаться во многих браузерах, и многие из апплетов стали непригодны для использования, что привело к их устареванию в 2017 году и последующему удалению из Java SE 11 в 2018 году.",
  "Platforms_JCAMPDX_Description": "Нет описания.",
  "Platforms_Lightning_Strike_Description": "Нет описания.",
  "Platforms_LiveMath_Plugin_Description": "Плагин LiveMath представляет собой приложение для интерактивной математики, создающее окно, которое может содержать заметки, графики и другие математические функции, встраиваемые на веб-странице. Первоначально запущен под названием Theorist в 1989 году компанией Prescience Corporation, а веб-плагин - в 1994 году, Затем он был переименован в MathView в 1997 году после того, как был приобретён Waterloo Maple, после чего был приобретён MathMonkeys и переименован в LiveMath в 1999 году. В 2014 году с растущими проблемами и несовместимостью с последними браузерами поддержка плагина был прекращена, его заменил отдельный просмотрщик под названием LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Нет описания.",
  "Platforms_MHSV_Description": "Выпущенный в виде альфа-версии под названием VSV ({V}irtual {S}pace {V}iewer) и позже переименованный в MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), он представлял собой плагин, разработанный компанией ParaGraph и позволявший создавать интерактивные 3D-миры с помощью программы VHSB ({V}irtual {H}ome {S}pace {B}uilder), которая могла создавать как интерактивные MHSV, так и стандартные статичные VRML-миры. В 1996 году в связи с разработкой стандарта VRML 2.0 была добавлена интерактивность, и ParaGraph обновила VHSB для создания VRML 2.0 миров, но ParaGraph решила работать с Silicon Graphics и их плеером Cosmo VRML 2.0, адаптировав VHSB для лучшей работы с ним, отказавшись при этом от MHSV. В 1997 году Silicon Graphics приобрела ParaGraph и создала компанию Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Silverlight, разработанный компанией Microsoft как ответ на Flash и Java и выпущенный в 2007 году, представляет собой мультимедийный инструмент, ориентированный на потоковое видео и используемый компанией Netflix. В более поздних версиях были добавлены возможности для других приложений. Он пользовался приличной популярностью: в 2011 году уровень его использования составил 64,7%. Однако в 2012 году с объявлением о прекращении использования NPAPI, выходом Windows 8 и началом внедрения HTML5 компания Microsoft объявила о прекращении разработки плагина, а в 2015 году, с выходом Windows 10, он перешёл в категорию End-of-Life и в октябре 2021 года его поддержка была окончательно прекращена.",
  "Platforms_NoteWorthy_Composer_Description": "Нет описания.",
  "Platforms_O2C_Player_Description": "Плеер o2c Player, входящий в линейку o2c (objects to see), был разработан в 1999 году немецкой компанией mb Software AG как веб-плагин для демонстрации объектов и сцен. В 2003 году компания продала технологию o2c компании ELECO plc, которая разработала и выпустила в 2005 году версию 2.0, в которой была значительно улучшена производительность за счёт 3D-ускорения, а сам плеер стал больше похож на инструмент САПР для архитекторов. Была добавлена поддержка большего числа браузеров, но серьёзных обновлений не производилось, в основном это были исправления ошибок. По состоянию на 2021 год плагин всё ещё доступен для загрузки, но Elcosoft перешла на реализацию технологии в Unity WebGL.",
  "Platforms_Octree_View_Description": "Начиная как плагин под названием PicTree Viewer или PicView, он был переработан в новый плагин Fastview, после чего в 1999 году был переименован, Octree View - это программа для просмотра 3D-объектов, основанная на технологии Voxel, разрабатываемой с 1980 года и использующей для создания изображений специальные камеры и лазерные сканеры. Компания продолжала использовать свою технологию и плагин, но в 2007 году её сайт перестал обновляться, оставив технологию без дальнейшей активности.",
  "Platforms_Pixound_Description": "Pixound - это музыкальный плагин, созданный в 1996 году совместным предприятием Hologramophone Research и Frankfurt Balkind Partners. Он представлял собой MIDI-клавиатуру, использующую цветовые значения изображений для воспроизведения различных нот и тональностей. В 2003 году компания Hologramophone сменила название на Techné Media. К 2005 году от плагина отказались в пользу отдельного приложения, предназначенного исключительно для Mac OS X. Позднее, в 2011 году, оно вышло для iOS.",
  "Platforms_Play3D_DeepV_Description": "Play3D - это 3D-плагин, выпущенный в 1996 году компанией Heads Off, которая в течение следующего года провела ребрендинг и перевыпустила его под названием DeepV. За исключением нескольких примеров, плагин практически не использовался. Сайт разработчика закрылся в 2001 году.",
  "Platforms_PointPlus_Description": "PointPlus - плагин для встраивания презентаций PowerPoint в Интернет, разработанный компанией Net-Scene и выпущенный в мае 1996 года для Windows NT и 95. Он позиционировался как альтернатива более сложному Macromedia Shockwave для пользователей начального уровня, использующих PowerPoint. К ноябрю была разработана программа просмотра на Java, совместимая с другими платформами и не требующая установки плагинов. Она была оставлена в качестве опции для специальных случаев, но в 1997 году линейка продуктов перестала обновляться, а её сайт закрылся в начале 2001 года.",
  "Platforms_PopCap_Plugin_Description": "PopCap Plugin - это плагин для демонстрации демоверсий игр, созданных разработчиком PopCap. В начале своей деятельности компания использовала Java для демонстрации онлайн-игр из-за её доступности. Однако впоследствии разработка была перенесена на собственный плагин, который был доступен как в виде элемента управления ActiveX, так и в виде традиционного плагина для Firefox. Это дало PopCap преимущество в виде собственной платформы для распространения демо-версий. Однако ее недостаточное использование как клиентами, так и самой компанией PopCap привело к тому, что к 2007 году разработчики перешли на более популярный Flash.",
  "Platforms_ProtoPlay_Description": "ProtoPlay - плагин, предназначенный для демонстрации взаимодействия потребителя с продуктами и имитации их возможностей. Выпущенный в 1996 году, он использовал программу Altia Design для создания приложений, состоящих из двухмерных спрайтов с интерактивными элементами. Плагин носил скорее утилитарный характер и с конца 2003 года активно не рекламировался, существуя скорее как функция, доступная при необходимости. Altia Design и плагин постоянно получали обновления, улучшающие функциональность, а в 2007 году был выпущен новый инструмент, позволяющий создавать плагины для Photoshop, под названием PhotoProto. В 2009 году компания Altia Inc. переключила свое внимание на разработку пользовательских интерфейсов, оставив за собой аспект прототипирования, а вместе с ним и ProtoPlay.",
  "Platforms_Pulse_Player_Description": "Созданный в 1997 году под названием 3rd Degree, Pulse Player представлял собой 3D-плагин с акцентом на анимацию. Впервые он был выпущен в 1999 году при финансовой поддержке нескольких опытных специалистов в области Интернет-медиа и использовался несколькими известными клиентами. Плагин рекламировался как весёлая и креативная медиаплатформа и, как оказалось, был успешным, но в начале 2001 года компания изменила свои намерения, сделав ребрендинг Player как более серьезного делового и образовательного инструмента. В 2003 году была выпущена последняя версия 5.2, и вскоре после этого поддержка была прекращена.",
  "Platforms_REBOL_Plugin_Description": "REBOL - это язык программирования, разрабатывавшийся более 20 лет и выпущенный в 1997 году. В 2004 году был создан экспериментальный прототип веб-плагина REBOL, а также страница, содержащая несколько примеров. Вначале плагин выпускался в виде ActiveX только для Internet Explorer, но позже, в 2006 году, была выпущена версия плагина для других браузеров. Однако вскоре после этого было сделано последнее обновление, в результате чего плагин остался в бета-версии в виде небезопасного прототипа.",
  "Platforms_ShiVa_Web_Player_Description": "ShiVa Web Player, созданный компанией Stonetrip и называвшийся до 2007 года Ston3D Web Player, представлял собой плагин для запуска программ, созданных на движке ShiVa 3D Engine, для работы с трёхмерным веб-контентом. Он позволял создавать сложные 3D-сцены с освещением и физикой при низких требованиях к обработке. Позднее, в 2013 году, компания Stonetrip переименовалась в ShiVa Technologies SAS и сосредоточилась исключительно на движке. С удалением NPAPI из большинства браузеров поддержка плагина уменьшилась, что привело к тому, что в 2018 году URL-адреса нескольких основных файлов перестали работать, что привело к поломке большинства игр, а в 2019 году плагин был удалён с сайта ShiVa.",
  "Platforms_Show_It_Description": "Show It! - это плагин, появившийся в 1997 году в WordPerfect Suite 8 как одна из функций Corel Presentations 8, конкурента PowerPoint. При экспорте с помощью опции Internet Publisher презентации можно было экспортировать либо в виде статичного слайд-шоу с изображениями, либо в виде встроенного проектора с использованием собственного файла, который функционировал так же, как и оригинальное настольное приложение, сохраняя все функции, для которых требовался плагин. Он продолжал поддерживаться в WordPerfect Office 2000 в Presentations 9, но в 2001 году поддержка плагина была прекращена в WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Нет описания.",
  "Platforms_Squeak_Etoys_Description": "Squeak - платформа с открытым исходным кодом, созданная в 2001 году для создания развлекательного и образовательного контента. Пользователи могли создавать небольшие приложения, предназначенные для детей разных возрастных групп - от самых маленьких, называемых \"Etoys\", до \"Omniuser\" и \"Expert\". В 2008 году программа была переименована в Etoys и в большей степени ориентирована на детей младшего возраста. Etoys 5 - последняя версия плагина, выпущенная в 2012 году. В 2013 году началась разработка JavaScript-версии программы после того, как возникли проблемы с безопасностью, в результате чего плагин был заброшен и заменён на него.",
  "Platforms_Superscape_Viscape_Description": "Viscape, выпущенный в 1996 году компанией Superscape при поддержке Intel и первоначально называвшийся VisNet, представлял собой 3D-плагин, который имел явное преимущество в виде интерактивности с мирами, в отличие от статичных моделей VRML 1.0. Он пользовался непродолжительным периодом популярности, и поначалу поддержка VRML не планировалась, но после того, как в VRML97 появилась интерактивность, в 1998 году было выпущено обновление под названием Viscape Universal, добавившее поддержку VRML, чтобы сохранить актуальность. Этого оказалось недостаточно: финансовые проблемы, неудачные партнерские отношения, рецензенты назвали плагин устаревшим и громоздким, несмотря на все усилия по его возрождению. Хотя последнее обновление было выпущено в 2000 году, его технологии продолжали использоваться в серии Lego Creator компании Superscape в течение следующего года. Была предпринята попытка обновить плагин, встроив его в Java-апплеты, под названием Vislite, но в итоге компания переориентировалась на разработку мобильных игр и добилась умеренного успеха, после чего в 2008 году была приобретена компанией Glu Mobile.",
  "Platforms_Surround_Video_Description": "Нет описания.",
  "Platforms_SVF_Viewer_Description": "Нет описания.",
  "Platforms_Tcl_Plugin_Description": "Разработанный небольшой командой и запущенный в 1988 году Tool Command Language (Tcl, произносится \"тикл\") - это язык динамического программирования с открытым исходным кодом. В 1994 году компания Sun Microsystems привлекла эту команду для дальнейшего развития языка. Одним из результатов этой работы стал выпущенный в 1996 году плагин, позволяющий запускать апплеты Tcl (\"Tclets\"), встраиваемые в страницы. В конце 1997 года разработка Tcl была выделена в независимую компанию Scriptics, а в 2000 году она вновь превратилась в Tcl Core Team. Несмотря на то, что разработка языка ведётся и по сей день, работа над плагином замедлилась, хотя официально она не прекращена. Последняя версия, 3.1.0, была выпущена в 2006 году.",
  "Platforms_ThingViewer_Description": "ThingViewer - это мультимедийный плагин 1997 года, созданный компанией Parable Corporation, которая в 1998 году сменила название на ThingWorld. Он создавал \"вещи\" - ассеты, которые по желанию могли быть защищены от кражи или взлома и имели уникальный идентификатор с кредитом для обмена на сайтах, используя простое модульное программирование, для создания таких вещей, как изображения, анимация и даже интерактивные игры, созданные с помощью программы ThingMaker или конвертирования файлов Shockwave Director с помощью ThingConverter. Сайт был достаточно популярен, в 1999 году даже были заключены сделки с Microsoft и другими компаниями, но в конце 2000 года компания сократила штат сотрудников и вела переговоры с неизвестной компанией о слиянии с целью продажи технологии. В 2002 году сайт плагина закрылся.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine - кроссплатформенный игровой движок, призванный сделать разработку игр более доступной и являющийся наиболее популярным среди сторонних разработчиков во всём мире. Созданный параллельно с самим Unity и реализованный в первом патче в 2005 году, Unity Web Player представлял собой инструмент для воспроизведения игр Unity в Интернете. Он оставался популярной платформой для 3D-игр, но после отказа от поддержки NPAPI в 2016 году от плагина отказались в пользу Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap - это инструмент для визуализации интерактивных карт, встроенных в веб-страницу. Он был совместим с несколькими файлами карт из различных программ-авторов, мог отображать подробную информацию о секторах и позволял выполнять измерения. После запуска в 1997 году технология больше не развивалась и оставалась неизменной вплоть до закрытия страницы в 2004 году.",
  "Platforms_Vitalize_Description": "Созданный в 1997 году компанией Corel для отображения контента, созданного с помощью её мультимедийной авторской программы Click&Create, Vitalize! представлял собой плагин с низкой пропускной способностью, предназначенный для простых веб-игр с акцентом на игровой, маркетинговой и рекламной тематике. Распространяемый с помощью Europress, его особенностью было то, что он \"прост в освоении и использовании, в отличие от Java или Shockwave\". Где-то в 1999 году некоторые сотрудники Corel покинули компанию и создали Clickteam, которая в 2000 году взяла на себя разработку версии 2.0. Последняя версия 4.0 была выпущена в 2007/2008 годах и была доступна на их сайте до 2012 года.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage - открытый 3D-стандарт и самый первый из созданных для Web. На момент своего появления в ноябре 1994 года формат мог представлять только статические модели, не обладающие интерактивностью. Эта проблема была решена в 1997 году, когда была опубликована версия 2.0, более известная как VRML97. Несмотря на то, что этот формат так и не получил широкого распространения, после выхода в свет он стал самым популярным вариантом трехмерной среды для Интернета, а в 2001 году был вытеснен X3D (который был совместим с VRML). Поскольку это был формат файла, а не плагин, было создано множество различных реализаций VRML, часто добавляющих свои собственные нестандартные возможности.",
  "Platforms_X3D_Description": "Нет описания.",
  "Platforms_Xara_Plugin_Description": "Xara Plugin - программа просмотра векторной графики, использующая собственный формат с низкой пропускной способностью. В 1996 году была выпущена бета-версия, а затем и полный релиз, позволяющий просматривать в Интернете файлы Flare, созданные с помощью CORELXara. Позже, в 1997 году, был выпущен Xara Webster, специально предназначенный для создания веб-графики для плагина. В 1999 году была выпущена последняя версия 2.08a. В 2000 году на смену Xara Webster пришел XaraX, который мог экспортировать во Flash, другой векторный плагин, поэтому поддержка собственной версии была прекращена, и она перешла в архив устаревшего ПО.",
  "Platforms_Coming_Soon": "Скоро",
  "Platforms_Coming_Soon_Description": "Игры и анимации, созданные на этих платформах, будут доступны в следующем обновлении.",
  "Platforms_Common_Ground_Description": "Нет описания.",
  "Platforms_DjVu_Description": "Нет описания.",
  "Platforms_Jamagic_Description": "Нет описания.",
  "Platforms_Jutvision_Description": "Нет описания.",
  "Platforms_mBed_Description": "Нет описания.",
  "Platforms_MrSID_Description": "Нет описания.",
  "Platforms_PanoramIX_Description": "Нет описания.",
  "Platforms_Petz_Player_Description": "Нет описания.",
  "Platforms_Sibelius_Scorch_Description": "Нет описания.",
  "Platforms_Sizzler_Description": "Нет описания.",
  "Platforms_Ulead_COOL_360_Description": "Нет описания.",
  "Platforms_VReam_WIRL_Description": "Нет описания."
}
