{
  "Discord_Title": "Discord",
  "Discord_Intro": "Prosimy o zapoznanie się z regulaminem przed dołączeniem do naszego serwera Discord (można go również zobaczyć w {#rules-and-faq}, gdy już tam będziesz):",
  "Discord_Rule1": "Przestrzegaj zasad Discorda i naszych: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Szanuj innych. Nie bądź bigotem, nie prowokuj dramatów, nie zachowuj się nieprzyjemnie, nie wymieniaj wielokrotnie użytkowników/ról oraz nie wysyłaj wiadomości DM do członków serwera (w tym personelu) bez pozwolenia.",
  "Discord_Rule3": "Utrzymuj tematy w wyznaczonych im kanałach. Zawsze czytaj opis, jeśli nie jesteś w pełni pewien jego celu. Jeśli członek personelu poprosi Cię o przeniesienie rozmowy, zrób to.",
  "Discord_Rule4": "Dystrybucja treści, które są obecnie sprzedawane lub zgłoszone do usunięcia z Flashpoint jest niedozwolona.",
  "Discord_Rule5": "{Never send emails relating to Flashpoint without the consent of staff, no matter how good you think it is.} Nikt nie chce, aby jego szansa na kontakt z deweloperem poszła na marne, dlatego chcemy mieć pewność, że tak się nie stanie.",
  "Discord_Rule6": "Promowanie siebie lub podmiotów stowarzyszonych za pośrednictwem zaproszeń na Discord, linków do YouTube, przedsięwzięć zarobkowych itp. jest zabronione, chyba że odbywa się to w kontekście Flashpoint lub cyfrowego archiwum.",
  "Discord_Rule7": "Treści i dyskusje NSFW muszą być przechowywane w {#nsfw-lounge} (samo istnienie kanału powinno wyjaśniać więcej niż wystarczająco).",
  "Discord_Rule8": "Na tym serwerze nie ma miejsca na rozmowy polityczne. Zabierz je gdzie indziej lub w ogóle o nich nie rozmawiaj.",
  "Discord_Curation_Exception": "(Kuracje – konkretne omówienie i zawarte treści – są jedynym wyjątkiem od reguł 7 i 8.)",
  "Discord_Sanctions": "Członkowie zespołu mogą ostrzec/uciszyć/wyrzucić/zbanować użytkowników, gdy uważają, że łamią te zasady, w oparciu o powagę złamanej zasady. Zachęcamy personel do okazywania litości w przypadku pierwszego lub przypadkowego złamania zasad, lecz wielokrotne złamanie zasad spowoduje surowsze kary.",
  "Discord_Agreed": "Przeczytałem zasady i chcę dołączyć do serwera!"
}