{
  "FAQ_Title": "Najczęściej zadawane pytania",
  "FAQ_Question1": "Czy nie nazywaliście się wcześniej BlueMaxima's Flashpoint?",
  "FAQ_Answer1": "Tak — projekt ten działał z nickiem BlueMaxima w nazwie do czasu jego odejścia z projektu w styczniu 2023 roku.",
  "FAQ_Question2": "Jakie systemy operacyjne wspieracie?",
  "FAQ_Answer2": "Flashpoint obsługuje system Windows 7 SP1 i nowsze (z wyjątkiem standardowego systemu Windows 8). Dostępne są również wersje MacOS i Linux; wymagają jednak dodatkowych kroków do zainstalowania i mogą obsługiwać tylko kilka najpopularniejszych technologii przeglądarek.",
  "FAQ_Question3": "Czy Flashpoint stanowi zagrożenia dla mojego komputera?",
  "FAQ_Answer3": "Nie takie, o którym wiemy. Cały nasz pakiet aplikacji (nie licząc technologii pobierania gier w wersji Infinity) nie może łączyć się z otwartym Internetem; wszelkie zmiany w rejestrze wprowadzone przez Flashpoint Secure Player są usuwane po zamknięciu gry; wszystkie przychodzące kuracje są przekazywane przez komputer z kompetentnym i aktualnym oprogramowaniem antywirusowym; a co najważniejsze, program uruchamiający i wszystkie wewnętrzne funkcje Flashpointa są open-source i można je znaleźć {tutaj}. Dołożyliśmy wszelkich starań, aby kolekcja była tak bezpieczna, jak to tylko możliwe, ale pomimo naszych wysiłków niektóre programy antywirusowe, takie jak Avast i AVG, mogą wykrywać ważne komponenty jako niebezpieczne. Jeśli ten problem dotyczy Ciebie, {zajrzyj na tą stronę}, aby uzyskać instrukcje dotyczące rozwiązywania problemów.",
  "FAQ_Question4": "Ile jest gier/animacji?",
  "FAQ_Answer4": "Flashpoint oferuje obecnie ponad {} gier oraz {} animacji. Możesz przejrzeć całą kolekcję bez pobierania Flashpointa {tutaj}.",
  "FAQ_Question5": "Jakie technologie przeglądarkowe Flashpoint zachowuje w swoim archiwum?",
  "FAQ_Answer5": "Archiwizujemy gry i animacje z każdej technologii wymienionej na {stronie statystyk} Flashpoint Database.",
  "FAQ_Question6": "Gdzie są gry Nitrome?",
  "FAQ_Answer6": "Nitrome grzecznie poprosił nas o usunięcie ich zawartości z kolekcji. Jeśli chcesz zagrać w ich gry, zrób to na ich {stronie}, a jeśli Flash nie wchodzi w grę, sprawdź ich rosnący {katalog gier kompatybilnych z HTML5}. {Flashpoint nie pochwala nękania za decyzję podjętą Nitrome}",
  "FAQ_Question7": "Jak mogę wnioskować o dodanie gry/animacji?",
  "FAQ_Answer7": "Możesz złożyć wniosek, czytając najpierw {ten artykuł} do końca, a następnie korzystając z linków u jego dołu.",
  "FAQ_Question8": "Czy mogę sam/a dodać grę/animację?",
  "FAQ_Answer8": "Oczywiście! Podążaj za instrukcjami z {poradnika kuracji}, aby przejść proces przyjęcia na kuratora. Po tym, jak zostaniesz zaakceptowany, będziesz mógł dodawać tyle kuracji, ile zechcesz.",
  "FAQ_Question9": "Chcę wnieść swój wkład w inny sposób (kodowanie, testowanie itp.). Jak mogę pomóc?",
  "FAQ_Answer9": "Dołącz na nasz {serwer Discord}, ​​aby uzyskać więcej informacji. Tam odbywa się większość naszej pracy i komunikacji.",
  "FAQ_Question10": "Czy Flashpoint jest oprogramowaniem typu open source?",
  "FAQ_Answer10": "Tak... jakby. Wszystkie źródła naszej niestandardowej technologii, takiej jak program uruchamiający, są dostępne na naszym {GitHub}. Źródła oprogramowania, które dołączamy do Flashpoint, są dostępne na ich odpowiednich stronach internetowych (nie modyfikujemy źródła żadnego oprogramowania, które dołączamy). Same pliki binarne wtyczek internetowych nie są oprogramowaniem typu open source, ale gdyby były, nie byłoby nas tutaj.",
  "FAQ_Question11": "Czy mogę użyć loga/czy jest ono dostępne w Creative Commons?",
  "FAQ_Answer11": "Tak — logo podlega licencji {CC-BY 4.0}. Jako uznanie autorstwa, możesz opcjonalnie przypisać Seirade i Flashpoint. Pliki źródłowe można znaleźć {tutaj}.",
  "FAQ_Question12": "Gdzie mogę przekazać darowiznę na rzecz projektu?",
  "FAQ_Answer12": "Flashpoint Archive działa jak kolektyw non-profit. Więcej informacji na temat tego, jak przekazać darowiznę i na co przeznaczane są twoje pieniądze znajdziesz na naszej {stronie Open Collective}.",
  "FAQ_Question13": "Flashpoint nie działa poprawnie!",
  "FAQ_Answer13": "Wykonaj kroki rozwiązywania problemów wymienione w {instrukcji}. Jeżeli po tym dalej będziesz doświadczał problemów, poproś o pomoc na naszym Discordzie.",
  "FAQ_Question14": "Chcę, aby gra/animacja została usunięta z Flashpoint z tego lub innego powodu.",
  "FAQ_Answer14": "Powiadom nas za pośrednictwem naszego Discorda lub {bezpośrednio przez email}. Prawdopodobnie będziemy próbowali Cię przekonać, abyś pozwolił nam zachować swoją grę ze względu na historię, ale jesteśmy racjonalni.",
  "FAQ_Question15": "Mam inne pytanie.",
  "FAQ_Answer15": "Zapoznaj się z naszym {rozszerzonym FAQ}. Jeśli nie znajdziesz tam odpowiedzi na twoje pytanie, dołącz do naszego Discorda."
}