{
  "FAQ_Title": "Najczęściej zadawane pytania",
  "FAQ_Question1": "Kto/co to jest BlueMaxima?",
  "FAQ_Answer1": "BlueMaxima lub Ben Latimore to Australijczyk, który założył Flashpoint i zajmuje się kopiami wzorcowymi. Żadna firma ani organizacja nie jest zaangażowana w Flashpoint - jest to projekt w całości prowadzony przez społeczność.",
  "FAQ_Question2": "Jakie systemy operacyjne wspieracie?",
  "FAQ_Answer2": "Flashpoint supports Windows 7 SP1 and newer (excluding stock Windows 8). MacOS and Linux versions are also available; however, they require extra steps to install and can only run a handful of the most popular browser technologies.",
  "FAQ_Question3": "Czy Flashpoint stwarza jakiekolwiek obawy dotyczące bezpieczeństwa?",
  "FAQ_Answer3": "Not that we know of. The entirety of our application suite (minus Infinity's game-downloading tech) can't connect to the open internet; any registry changes made by Flashpoint Secure Player are removed once the game is closed; all incoming curations are passed through a PC with competent and up-to-date antivirus software; and most importantly, the launcher and all of Flashpoint's inner workings are open-source and can be found {here}. We've done our best to ensure the collection is as safe as it can be, but despite our efforts, certain antiviruses such as Avast and AVG tend to detect important components as being dangerous. If you're affected by this issue, {read this page} for troubleshooting instructions.",
  "FAQ_Question4": "Ile jest gier/animacji?",
  "FAQ_Answer4": "As of Flashpoint 11, we have over 130,000 games and 20,000 animations. You can search the collection without use of the launcher {here}. Alternatively, you can view the respective lists {here} and {here}.",
  "FAQ_Question5": "Jakie platformy oferuje kolekcja?",
  "FAQ_Answer5": "Obsługujemy gry i animacje działające na każdej platformie wymienionej na stronie {Supported Platforms}.",
  "FAQ_Question6": "Gdzie są gry Nitrome?",
  "FAQ_Answer6": "Nitrome grzecznie poprosił nas o usunięcie ich zawartości z kolekcji. Jeśli chcesz zagrać w ich gry, zrób to w ich {website}, a jeśli Flash nie wchodzi w grę, śledź ich rosnący {HTML5-compatible catalog}. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "Jak mogę zażądać gry/animacji?",
  "FAQ_Answer7": "Możesz złożyć wniosek, czytając najpierw {this article} do końca, a następnie korzystając z linków na dole.",
  "FAQ_Question8": "Czy mogę sam/a dodać grę/animację?",
  "FAQ_Answer8": "Tak. Postępuj zgodnie z instrukcjami podanymi w {curation tutorial}, aby skonfigurować przesłuchanie kuratora. Po zaakceptowaniu możesz przesłać tyle kuracji, ile chcesz.",
  "FAQ_Question9": "Chcę wnieść swój wkład w inny sposób (kodowanie, testowanie itp.). Jak mogę pomóc?",
  "FAQ_Answer9": "Dołącz do naszego {Discord server}, ​​aby uzyskać więcej informacji. Tam odbywa się większość naszej pracy i komunikacji.",
  "FAQ_Question10": "Czy Flashpoint jest oprogramowaniem typu open source?",
  "FAQ_Answer10": "Tak... jakby. Wszystkie źródła naszej niestandardowej technologii, takiej jak program uruchamiający, są dostępne na naszym {GitHub}. Źródła oprogramowania, które dołączamy do Flashpoint, są dostępne na ich odpowiednich stronach internetowych (nie modyfikujemy źródła żadnego oprogramowania, które dołączamy). Same pliki binarne wtyczek internetowych nie są oprogramowaniem typu open source, ale gdyby były, nie byłoby nas tutaj.",
  "FAQ_Question11": "Czy mogę użyć loga/czy jest on dostępny w Creative Commons?",
  "FAQ_Answer11": "Tak - logo podlega licencji {CC-BY 4.0}. Jako atrybucję możesz opcjonalnie przypisać Seirade i BlueMaxima's Flashpoint. Pliki źródłowe można znaleźć {here}.",
  "FAQ_Question12": "Gdzie mogę przekazać darowiznę na rzecz projektu?",
  "FAQ_Answer12": "Z szacunku do artystów i deweloperów, których prace można znaleźć we Flashpoint, staramy się unikać zabiegania o darowizny. Chociaż wcześniej zorganizowaliśmy {a fundraiser}, aby pokryć koszty serwera, nie planujemy uruchomienia kolejnej w przyszłości.",
  "FAQ_Question13": "Flashpoint nie działa poprawnie!",
  "FAQ_Answer13": "Postępuj zgodnie z instrukcjami rozwiązywania problemów wymienionymi w {manual}. Jeśli później nadal będziesz mieć problemy, poproś o pomoc na naszym Discordzie.",
  "FAQ_Question14": "Chcę, aby gra/animacja została usunięta z Flashpoint z tego lub innego powodu.",
  "FAQ_Answer14": "Powiadom nas za pośrednictwem naszego Discorda lub {directly by email}. Prawdopodobnie spróbujemy Cię przekonać, abyś pozwolił nam zachować swoją grę ze względu na historię, ale nie jesteśmy nierozsądni.",
  "FAQ_Question15": "Mam inne pytanie.",
  "FAQ_Answer15": "Zapoznaj się z naszymi {extended FAQ}. Jeśli nie znajdziesz tam odpowiedzi na Twoje pytanie, dołącz do naszego Discorda."
}