{
  "News_Title": "Aktualności",
  "News_Para1": "All notable events in Flashpoint history as of October 2019. Hover over a version's codename for an explanation from BlueMaxima, the project's founder.",
  "News_Para2": "A changelog encompassing every version released before the switch to the component-based system can be found {here}. For direct downloads to older versions of Flashpoint Ultimate, see BlueMaxima's and Dri0m's Internet Archive accounts {here} and {here}, respectively.",
  "News_Flashpoint_Started": "Flashpoint BlueMaximy został uruchomiony.",
  "News_Flashpoint_0": "Flashpoint Zero został wydany.",
  "News_Flashpoint_1": "Wersja Flashpoint One została wydana.",
  "News_Was_Released": "został wydany",
  "News_Flashpoint_3_0": "Klucze do Królestwa",
  "News_Flashpoint_3_0_Meta": "Ta wersja wprowadziła Redirectora, który był ostatnim elementem układanki, który sprawił, że konfiguracja serwera działała - pozwalając nam zachować 99,9% gier Flash bez hakowania. Klucze do królestwa zachowania Flasha, że tak powiem.",
  "News_Flashpoint_3_1": "Noc Otwarcia",
  "News_Flashpoint_3_1_Meta": "Ta wersja jako pierwsza miała Flashpoint Theatre (chociaż była to wtedy osobna instancja LaunchBox).",
  "News_Flashpoint_3_2": "Szok i Podziw",
  "News_Flashpoint_3_2_Meta": "Ta wersja jako pierwsza obsługiwała tytuły Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Nazwany po fakcie, że w tym momencie przekroczyliśmy 4000 gier w kolekcji. Jak ten czas leci.",
  "News_Flashpoint_4_0": "Żyjąca Nieskończoność",
  "News_Flashpoint_4_0_Meta": "Ta wersja wprowadziła Flashpoint Infinity, która pozwala ludziom strumieniować gry z Internetu. Nazwa pochodzi z albumu Soilwork z 2013 roku o tym samym tytule.",
  "News_Flashpoint_4_1": "Jawność",
  "News_Flashpoint_4_1_Meta": "To była wersja, która wprowadziła obsługę apletów Java. DarkMoe wymyślił nazwę.",
  "News_Flashpoint_5_0": "Idź na Premierę",
  "News_Flashpoint_5_0_Meta": "Launcher, który wszyscy znamy i kochamy, został wprowadzony w tej wersji.",
  "News_Flashpoint_5_1": "Wielki Filtr",
  "News_Flashpoint_5_1_Meta": "Tutaj dodano playlisty (filtr, że tak powiem). Nazwa pochodzi od EP Mesarthim, The Great Filter.",
  "News_Flashpoint_5_2": "Typ III",
  "News_Flashpoint_5_2_Meta": "The Great Filter i Type III to dwie EPki Mesarthima, które często łączy się ze sobą. Nie pojawiła się żadna inna nazwa, kiedy jej potrzebowaliśmy.",
  "News_Flashpoint_5_3": "Rewolucja",
  "News_Flashpoint_5_3_Meta": "Ta wersja została wydana blisko pierwszej rocznicy Flashpoint i czuliśmy, że to prawdziwa rewolucja. (Pierwotnie miał też nosić nazwę „Orbita”, ale to była głupia nazwa koncepcji.)",
  "News_Flashpoint_5_4": "Rekombinacja",
  "News_Flashpoint_5_4_Meta": "Ta wersja przeniosła animacje do gier, które wcześniej znajdowały się w osobnych folderach z osobnymi klientami. „Rekombinacja” i „74%” to także nazwa dwóch utworów na albumie Mesarthim The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Szybki zestaw poprawek stworzonych wraz z czasem wysyłania 5.4. To nie było tak, że Flashpoint 5.4 był ukończony tylko w 74%, kiedy go wydaliśmy.",
  "News_Flashpoint_5_5": "Żelazo i Miedź",
  "News_Flashpoint_5_5_Meta": "BlueMaxima grał w tym czasie trochę za dużo w Deus Ex.",
  "News_Flashpoint_6_0": "Wyrównanie",
  "News_Flashpoint_6_0_Meta": "Kolejne nawiązanie do Mesarthim!",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "Gra z terminami dotyczącymi oprogramowania powszechnie używanymi w technologii, takimi jak „freeware” i „shareware”.",
  "News_Flashpoint_6_2": "Wielka Ucieczka Moe",
  "News_Flashpoint_6_2_Meta": "Członek zespołu DarkMoe był kuratorem naprawdę szalonej liczby gier typu escape-the-room w tej wersji.",
  "News_Flashpoint_6_3": "Mówimy o Grach Flash, a nie o Abstrakcyjnej Filozofii",
  "News_Flashpoint_6_3_Meta": "Nazwany na cześć linii od nosamu, członka personelu.",
  "News_Old_Releases_Title": "Retroaktywna oś czasu wydań",
  "News_Old_Releases_Description": "Ponieważ kolumna wiadomości istniała dopiero od grudnia 2019 r., większość wydań do tego momentu nie została skatalogowana. W tej sekcji opisano brakujące wersje.",
  "News_Is_Available": "jest już dostępny!",
  "News_Grab_Download": "Zgarnij go z {downloads page}",
  "News_Flashpoint_Update_October_2019": "Aktualizacja statusu Flashpoint na październik 2019 r. jest już dostępna na Medium. Sprawdź ją {here}.",
  "News_Flashpoint_Update_November_2019": "Aktualizacja statusu Flashpoint na listopad 2019 r. jest już dostępna na Medium. Sprawdź ją {here}.",
  "News_Flashpoint_7_0": "Osiem Tysięcy Godzin",
  "News_Flashpoint_7_0_Meta": "Osiem tysięcy godzin to mniej więcej tyle, ile Flash musiał żyć w momencie premiery.",
  "News_Flashpoint_7_1": "Trzymaj się Celu",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0 według naszych standardów wyszedł na bałagan. Wersja 7.1 była wersją z grubymi poprawkami błędów.",
  "News_Featured_Kotaku_Link": "Zostaliśmy wyróżnieni na Kotaku!",
  "News_Featured_Kotaku_Rest": "To ogromny kamień milowy. Dziękuję wszystkim za wsparcie!",
  "News_Flashpoint_Update_March_2020": "Aktualizacja statusu Flashpoint na marzec 2020 r. jest już dostępna na Medium. Sprawdź ją {here}.",
  "News_Flashpoint_Update_April_2020": "Aktualizacja statusu Flashpoint na kwiecień 2020 r. jest już dostępna na Medium. Sprawdź ją {here}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "W tej wersji skończyło się oprogramowanie Redirector, wcześniej używane do działania serwera. Kod HTTP 301 jest „przeniesiony na stałe”, tzn. już nie przekierowuje.",
  "News_Flashpoint_Update_June_2020": "Mini-aktualizacja statusu Flashpoint na czerwiec 2020 r. jest już dostępna na Medium. Sprawdź ją {here}.",
  "News_Flashpoint_8_1": "Duch Przygody",
  "News_Flashpoint_8_1_Meta": "Nazwany na cześć wiersza z wówczas nowego albumu Aether Realm, Redneck Vikings from Hell. A konkretnie utworu „One Hollow Word”.",
  "News_Flashpoint_Update_August_2020": "Aktualizacja statusu Flashpoint na sierpień 2020 r. jest już dostępna na Medium. Sprawdź ją {here}.",
  "News_Flashpoint_8_2": "Zbliżamy się do Dziewiątej Planety",
  "News_Flashpoint_8_2_Meta": "(Naciągane, przyznaję) portmanteau „zbliżając się do wersji dziewiątej” i Planet Nine, EP-ki Mesarthim.",
  "News_Flashpoint_9_0": "Wspaniały Zachód Słońca",
  "News_Flashpoint_9_0_Meta": "Nazwany na cześć Glorious Morning, piosenki najbardziej znanej z Age of War. Była to ostatnia wersja wydana przed śmiercią Flasha, stąd „zachód słońca”.",
  "News_Flashpoint_Update_April_2021": "Aktualizacja statusu Flashpoint na kwiecień 2021 została opublikowana dzisiaj. Sprawdź ją {here}.",
  "News_Flashpoint_10_0": "Absencja",
  "News_Flashpoint_10_0_Meta": "Jest to pierwsza wersja, która została udostępniona w Internecie post-Flash, stąd nazwa „Absencja”. Tak się też złożyło, że była to nazwa ostatniego utworu na EP-ce Mesarthima „Vacuum Solution”.",
  "News_Flashpoint_10_1": "Absencja II",
  "News_Flashpoint_10_1_Meta": "No dalej, zgadnij.",
  "News_Flashpoint_11": "Ups, wszystkie wtyczki!",
  "News_Flashpoint_11_Meta": "To mem, bo 11 dodało trzy tuziny nowych wtyczek.",
  "News_Flashpoint_11_1": "Operation Cherry Blossom",
  "News_Flashpoint_11_1_Meta": "A reference to the game Muv-Luv (go buy it on Steam).",
  "News_Flashpoint_12": "Axolotl",
  "News_Flashpoint_12_meta": "They're cute and they're cool."
}