{
  "News_Title": "Aktualności",
  "News_Para1": "Wszystkie szczególne wydarzenia w historii Flashpointa do lipca 2023 roku. Najedź na nazwę kodową wersji, aby zobaczyć jej wyjaśnienie od BlueMaximy, założyciela projektu.",
  "News_Para2": "Lista zmian obejmująca każdą wersję wydaną przed przejściem na system oparty na komponentach znajduje się {tutaj}. Aby pobrać bezpośrednio starsze wersje Flashpoint Ultimate, sprawdź konta na Internet Archive BlueMaximy i Dri0ma odpowiednio {tutaj} oraz {tutaj}.",
  "News_Flashpoint_Started": "Flashpoint BlueMaximy został uruchomiony.",
  "News_Flashpoint_0": "Flashpoint Zero został wydany.",
  "News_Flashpoint_1": "Pierwsza wersja Flashpointa została wydana.",
  "News_Was_Released": "został wydany",
  "News_Flashpoint_3_0": "Keys to the Kingdom",
  "News_Flashpoint_3_0_Meta": "Ta wersja wprowadziła Redirector, który był ostatnim elementem układanki, który sprawił, że konfiguracja serwera działała - pozwalając nam zachować 99,9% gier Flash bez hakowania. Klucze do królestwa archiwizacji Flasha, że tak powiem.",
  "News_Flashpoint_3_1": "Opening Night",
  "News_Flashpoint_3_1_Meta": "Ta wersja jako pierwsza miała Flashpoint Theatre (chociaż była to wtedy osobna instancja LaunchBox).",
  "News_Flashpoint_3_2": "Shock and Awe",
  "News_Flashpoint_3_2_Meta": "Ta wersja jako pierwsza obsługiwała tytuły Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Nazwany po fakcie, że w tym momencie przekroczyliśmy 4000 gier w kolekcji. Jak ten czas leci.",
  "News_Flashpoint_4_0": "The Living Infinite",
  "News_Flashpoint_4_0_Meta": "Ta wersja wprowadziła Flashpoint Infinity, która pozwala ludziom strumieniować gry z Internetu. Nazwa pochodzi z albumu Soilwork z 2013 roku o tym samym tytule.",
  "News_Flashpoint_4_1": "Javality",
  "News_Flashpoint_4_1_Meta": "To była wersja, która wprowadziła obsługę apletów Java. DarkMoe wymyślił tę nazwę.",
  "News_Flashpoint_5_0": "Go For Launch",
  "News_Flashpoint_5_0_Meta": "Launcher, który wszyscy znamy i kochamy, został wprowadzony w tej wersji.",
  "News_Flashpoint_5_1": "The Great Filter",
  "News_Flashpoint_5_1_Meta": "Tutaj dodano playlisty (można powiedzieć, że filtr). Nazwa pochodzi od albumu Mesarthim, The Great Filter.",
  "News_Flashpoint_5_2": "Type III",
  "News_Flashpoint_5_2_Meta": "The Great Filter i Type III to dwie EPki Mesarthima, które często łączy się ze sobą. Nie pojawiła się żadna inna nazwa, kiedy jej potrzebowaliśmy.",
  "News_Flashpoint_5_3": "Revolution",
  "News_Flashpoint_5_3_Meta": "Ta wersja została wydana blisko pierwszej rocznicy Flashpoint i czuliśmy, że to prawdziwa rewolucja. (Pierwotnie miał też nosić nazwę „Orbita”, ale to była głupia nazwa koncepcji.)",
  "News_Flashpoint_5_4": "Recombination",
  "News_Flashpoint_5_4_Meta": "Ta wersja przeniosła animacje do gier, które wcześniej znajdowały się w osobnych folderach z osobnymi klientami. „Recombination” i „74%” to także nazwa dwóch utworów na albumie Mesarthim The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Szybki zestaw poprawek stworzonych wraz z czasem wysyłania 5.4. To nie było tak, że Flashpoint 5.4 był ukończony tylko w 74%, kiedy go wydaliśmy.",
  "News_Flashpoint_5_5": "Iron & Copper",
  "News_Flashpoint_5_5_Meta": "BlueMaxima grał w tym czasie trochę za dużo w Deus Ex.",
  "News_Flashpoint_6_0": "Alignment",
  "News_Flashpoint_6_0_Meta": "Kolejne nawiązanie do Mesarthim!",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "Gra słowna z terminami dotyczącymi oprogramowania powszechnie używanymi w technologii, takimi jak „freeware” i „shareware”.",
  "News_Flashpoint_6_2": "Moe's Great Escape",
  "News_Flashpoint_6_2_Meta": "W tej wersji członek zespołu DarkMoe dodał niewiarygodną liczbę gier typu escape-the-room.",
  "News_Flashpoint_6_3": "We're Talking About Flash Games, Not Abstract Philosophy",
  "News_Flashpoint_6_3_Meta": "Nazwany na cześć linii od nosamu, członka personelu.",
  "News_Old_Releases_Title": "Retroaktywna oś czasu wydań",
  "News_Old_Releases_Description": "Ponieważ kolumna wiadomości istniała dopiero od grudnia 2019 r., większość wydań do tego momentu nie została skatalogowana. W tej sekcji opisano brakujące wersje.",
  "News_Is_Available": "jest już dostępny!",
  "News_Grab_Download": "Zgarnij go z {downloads page}",
  "News_Flashpoint_Update_October_2019": "Aktualizacja statusu Flashpoint na październik 2019 r. jest już dostępna na Medium. Sprawdź ją {here}.",
  "News_Flashpoint_Update_November_2019": "Aktualizacja statusu Flashpoint na listopad 2019 r. jest już dostępna na Medium. Sprawdź ją {here}.",
  "News_Flashpoint_7_0": "Eight Thousand Hours",
  "News_Flashpoint_7_0_Meta": "Osiem tysięcy godzin to mniej więcej tyle, ile Flash przeżył w momencie premiery.",
  "News_Flashpoint_7_1": "Stay on Target",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0 według naszych standardów wyszedł na bałagan. Wersja 7.1 była wersją z grubymi poprawkami błędów.",
  "News_Featured_Kotaku_Link": "Zostaliśmy wyróżnieni na Kotaku!",
  "News_Featured_Kotaku_Rest": "To ogromny kamień milowy. Dziękuję wszystkim za wsparcie!",
  "News_Flashpoint_Update_March_2020": "Aktualizacja statusu Flashpointa na marzec 2020 r. jest już dostępna na Medium. Sprawdź ją {tutaj}.",
  "News_Flashpoint_Update_April_2020": "Aktualizacja statusu Flashpointa na kwiecień 2020 r. jest już dostępna na Medium. Sprawdź ją {tutaj}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Ta wersja widziała koniec oprogramowania Redirector używanego wcześniej do działania serwera. Kod HTTP 301 to \"przeniesiony na stałe\", tzn. już nie przekierowuje.",
  "News_Flashpoint_Update_June_2020": "Mini-aktualizacja statusu Flashpointa na czerwiec 2020 r. jest już dostępna na Medium. Sprawdź ją {tutaj}.",
  "News_Flashpoint_8_1": "Spirit of Adventure",
  "News_Flashpoint_8_1_Meta": "Nazwany na cześć wersu z wówczas nowego albumu Aether Realm, Redneck Vikings from Hell. A dokładniej z utworu „One Hollow Word”.",
  "News_Flashpoint_Update_August_2020": "Aktualizacja statusu Flashpointa na sierpień 2020 r. jest już dostępna na Medium. Sprawdź ją {tutaj}.",
  "News_Flashpoint_8_2": "Approaching Planet Nine",
  "News_Flashpoint_8_2_Meta": "(Naciągana, przyznaję) zbitka wyrazowa „zbliżając się do wersji dziewiątej” i Planet Nine, EP-ki Mesarthim.",
  "News_Flashpoint_9_0": "Glorious Sunset",
  "News_Flashpoint_9_0_Meta": "Nazwany na cześć Glorious Morning, piosenki najbardziej znanej z Age of War. Była to ostatnia wersja wydana przed śmiercią Flasha, stąd „zachód słońca”.",
  "News_Flashpoint_Update_April_2021": "Aktualizacja statusu Flashpoint na kwiecień 2021 została opublikowana dzisiaj. Sprawdź ją {here}.",
  "News_Flashpoint_10_0": "Absence",
  "News_Flashpoint_10_0_Meta": "Jest to pierwsza wersja, która została udostępniona w internecie post-Flash, stąd nazwa „Absence”. Tak się złożyło, że była to też nazwa ostatniego utworu na EP-ce Mesarthima „Vacuum Solution”.",
  "News_Flashpoint_10_1": "Absence II",
  "News_Flashpoint_10_1_Meta": "No dalej, zgadnij.",
  "News_Flashpoint_11": "Oops, All Plugins!",
  "News_Flashpoint_11_Meta": "To mem, bo 11 dodał trzy tuziny nowych wtyczek.",
  "News_Flashpoint_11_1": "Operation Cherry Blossom",
  "News_Flashpoint_11_1_Meta": "Nawiązanie do gry Muv-Luv (idź ją kupić na Steamie).",
  "News_Flashpoint_12": "Axolotl",
  "News_Flashpoint_12_meta": "Są fajne i słodkie."
}