{
  "Platforms_Title": "Obsługiwane platformy",
  "Platforms_Description1": "Flashpoint obsługuje gry i animacje stworzone dla różnych wtyczek i standardów internetowych - nie tylko Flash. Ta strona zawiera przegląd każdej technologii wraz z liczbą wpisów od wersji 10.1.",
  "Platforms_Description2": "Służy to jako podsumowanie „Kto? Kiedy? Co?” i punkt wyjściowy do dalszych badań, nie jest to wyczerpująca historia każdej platformy. Dokładamy wszelkich starań, aby przedstawić dokładne fakty, ale nadal możliwe są błędy. Prosimy o kontakt z odpowiednimi informacjami dotyczącymi poprawek.",
  "Platforms_By": "autorstwa",
  "Platforms_Entries": "Utwory",
  "Platforms_Entry": "Utwór",
  "Platforms_The_Groove_Alliance_Description": "Founded in 1998, The Groove Alliance was the developer of 3D Groove SX, a Shockwave-enabled 3D game engine. Later on in 2002, the engine would branch out from Shockwave and into its own thing called 3D Groove GX. Both variations could be used for the development of online games and desktop applications. This proved to be a success for the company, amassing a large corporate user base and leading to the creation of several high-profile titles for TV shows and other big properties. After the hype fizzled out, The Groove Alliance was reshaped into OTOY in 2008, but the 3D Groove website stayed online until 2009. The exact cause of the original company’s demise is unknown, but internal struggles were confirmed to have taken place.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (formerly 3D Life Player, Virtools Player, and NeMo Web Player, not to be confused with 3DVIA Studio/Beta Player or 3DVIA Composer Player) was a browser plugin by Dassault Systèmes for the playback of 3D experiences made in Virtools. It was meant for advanced, practical applications of 3D such as computer based training, virtual tours and real estate. 3DVIA Player was also used for webgames, with some of its primary users for this purpose being Quebec-based game studio Sarbakan and the Amsterdam-based Little Chicken Game Company. The last update, version 5.0, was released in 2009. The download page would stay up for the coming years until it was taken down in 2016. By then, it had been installed more than 30 million times.",
  "Platforms_Alambik_Plugin_Description": "Wtyczka Alambik to odtwarzacz internetowy dla treści stworzonych za pomocą platformy programistycznej Alambik. Wydany w 2001 roku był zdolny do grafiki 2D i 3D, wektorów i wielu innych aplikacji. W 2002 roku Alambik zorganizował konkurs z nagrodami z okazji wydania Alambik Script. W 2004 roku Alambik stworzył nową stronę z demo, ale potem firma zamilkła i nigdy nie wydała niczego nowego dla platformy ani nie aktualizowała wtyczki.",
  "Platforms_AnimaFlex_Description": "AnimaFlex to wtyczka do odtwarzania grafiki, która może odtwarzać animacje o małym rozmiarze pliku, stworzona za pomocą RubberWeb Composer, która może rozciągać i zniekształcać obrazy. Może zacząć odtwarzać animacje przed pobraniem całego pliku i dostosować się do wolniejszych prędkości Internetu. Pomimo obietnic firma RubberFlex miała kilka innych produktów, z których wszystkie eksportowały gify, konkurując ze swoją zastrzeżoną opcją, a nawet uruchomiła FlexToGif, aby przekonwertować pliki wtyczek na gify 2 dni po wtyczce. Na początku 1998 roku RubberWeb Composer zaprzestał dystrybucji, pozostawiając AnimaFlex bez programu autorskiego.",
  "Platforms_ActiveX_Controls_Description": "Wydany w 1996 roku przez Microsoft ActiveX był frameworkiem programowym, który służył jako standard, który pozwalał na hermetyzację programów jako kontenerów do użytku w innych niepowiązanych programach, zwanych kontrolkami ActiveX. Mogą być osadzone w treści HTML, a Kontrolki jednofunkcyjne mogą być tworzone specjalnie do użytku w Internet Explorerze, w celu odtwarzania gier internetowych. Po premierze Edge'a w 2015 roku, oprogramowanie to było przestarzałe, a jego użycie w aplikacjach internetowych pozornie przestało istnieć, przenosząc je do Internet Explorera 11 w celu obsługi starszego oprogramowania.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Starting development in 1996 as V3O by Rocket Science Games, later transferred to Attitude Software being renamed 3D Anarchy, and then sold to Adobe in 2000 and rebranded in 2001, Atmosphere Player is a web plugin made for viewing interactive 3D worlds, similar to the VRML standard, created in Atmosphere Builder. It was mostly intended for virtual media galleries, which could present images/audio/video and the 3D models themselves. When it first started as 3D Anarchy, the software was still in Beta when Adobe acquired the tech for further development, where it spent the next 3 years in beta testing, and the last release version 1.0 of the Player was released in February 2004. In December 2004 it was announced that Atmosphere would be discontinued, with support being cut in January 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (also just Flash, formerly Macromedia Shockwave Flash Player) is a player for vector animations and graphics, often with added interactivity. It was used as a medium for webgames due to its effective compression, low price, ease of use and large install base. Developed in 1995 and first introduced by FutureWave in 1996, it was capable of little more than basic animations and buttons to control them. As it gained popularity, more advanced features were added to the player, such as the ActionScript programming language. However, as people grew wary of its potential security concerns, and HTML5 spiked in popularity among web developers, Adobe announced Flash’s End-of-Life date to be December 31st, 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (also Shockwave, formerly Macromedia Shockwave Player or Shockwave Director Player) is a player for interactive media released in 1995. Built on technology that had been in development 10 years earlier by MacroMind, it became a web plugin only after its acquisition by Macromedia. Unlike Flash, Shockwave featured the Lingo scripting language and C++ support through the use of Xtras, giving the player a wide range of capabilities including 3D. It saw widespread use on the early internet and on CD-ROM games, and gained mainstream popularity. The platform saw a significant decrease in popularity following Adobe's acquisition of Macromedia in favor of Flash, which was rapidly expanding feature-wise and was now owned by Adobe as well. Finally in February 2019, Adobe announced its discontinuation and cut support two months later.",
  "Platforms_Authorware_Web_Player_Description": "The Authorware Web Player was created by Macromedia in 1996 as one of the new features of Authorware 3.5. It was made as a way to run interactive programs developed with Macromedia Authorware on the web. Unlike most web plugins, Authorware’s primary purpose was to aid e-learning, leading to its use in businesses and in the academic field as a way to assemble multimedia learning material without the need of programming experience. The final version of the plugin was released in 2004, prior to the acquisition of Macromedia by Adobe in 2005, after which development stalled until the announcement of its discontinuation in 2007.",
  "Platforms_MindAvenue_Description": "AXEL Player was an interactive 3D content plugin created by MindAvenue in 2002. It was a way for models and animations on the AXELedge web authoring program, and AXELpublisher, which converted files from other 3D software like 3ds Max. The software was well received by critics, despite a couple of limitations, one being the lack of many users for the Plugin. In 2005, MindAvenue was acquired by 20-20 Technologies, who specialized in interior design and furniture development software, and in 2006 their website became a page directing to 20-20. All AXEL branded products including the plugin were discontinued.",
  "Platforms_BitPlayer_Description": "BitPlayer to aplikacja pulpitowa oparta na technologii Flash i Shockwave, stworzona w 1999 roku przez holenderską firmę BitMagic. Oferowała codzienne szorty, produkowane we własnym zakresie i przez klientów, którym towarzyszyły reklamy i quizy. Początkowo wyceniany na 6 milionów dolarów, stał się ofiarą katastrofy dot-com po swoich reklamodawcach i zaprzestał produkcji w styczniu 2001 roku. Wiele jego treści przetrwało od tego czasu jako przekonwertowane pliki SWF, pomimo utraty dodatkowej funkcjonalności oferowanej przez niestandardowy odtwarzacz.",
  "Platforms_Burster_Description": "Burster był implementacją Blender Game Engine z 2000 roku w 2010 roku. Projekt był próbą przywrócenia oficjalnej wtyczki uruchomionej wraz z Blenderem, która została wycofana ze względów bezpieczeństwa. Ulepszono oryginał, wykorzystując nowsze wersje silnika, aby uzyskać lepszą wydajność i grafikę. Ostatnia wersja została uruchomiona w 2013 roku, a po 3 latach braku aktualizacji Burster został oficjalnie wycofany w 2016 roku. Sam silnik gry został usunięty z Blendera w 2018 roku.",
  "Platforms_Cult3D_Description": "Cult3D was a web viewer for 3D content made using the Cult3D Designer authoring program. It enjoyed moderate success, with 6 million users by 2001 and several notable clients using it, and more importing options for 3D models from other programs being added. 5.3 was the last version released in 2002, with the last update to the plugin being in 2004, when the technology was sold to Mental Images GmbH. Nvidia later bought Mental Images in 2007, becoming the subsidiary Nvidia Advanced Rendering Center. Despite updating the website, the plugin received no updates and starting 2011, it stopped being showcased as a viable option, and the downloads page was kept up because of users that still had an authoring licence, later being taken down in 2013.",
  "Platforms_GoBit_Games_Plugin_Description": "Wtyczka GoBit Games została stworzona w 2008 roku przez GoBit, małe niezależne studio złożone z byłych pracowników PopCap. Ich pierwsza gra, Burger Shop, została wydana w październiku 2007 roku, a 4 miesiące później, zgodnie z powszechnym zainteresowaniem, otrzymała internetową wersję demonstracyjną, korzystając z nowej wtyczki do gier. Minął rok i demo zostało przerobione jako gra reklamowa dla Eggo, opublikowana przez Shockwave.com 1 lutego 2009. Wtyczka została porzucona wkrótce potem wraz z wydaniem Burger Shop 2 - jego odpowiedniego demo internetowego przy użyciu Flasha - pozostawiając Burger Shop i jego wersję ze zmienioną skórką jako jedyne gry, jakie kiedykolwiek stworzono dla niej.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage to standard wyświetlania dokumentów przez przeglądarkę internetową. Pierwotnie opracowany przez Tima Bernersa-Lee we wczesnych latach 90. (z korzeniami sięgającymi 1980 r.) HTML stał się główną metodą udostępniania informacji przez Internet, a jego możliwości zostały rozszerzone o inne języki, takie jak CSS i JavaScript. Po raz pierwszy został wprowadzony na rynek w 1993 roku i otrzymał kolejne aktualizacje z HTML2 w 1995, a zarówno HTML3, jak i HTML4 w 1997. Ostatnia aktualizacja HTML4 miała miejsce w 2000 roku, a po latach jego połączone języki były w dużej mierze ignorowane jako platforma do gier, animacji i innych treści internetowych, a programiści zdecydowali się zamiast tego na technologię opartą na wtyczkach, ale wraz z rozwojem technologii i Internetu wtyczki stały się przestarzałe, więc podjęto wysiłek aktualizacji standardu, a w 2008 r. uruchomiono HTML5. Ponieważ Flash i inne wtyczki wyszły z mody, HTML5 stał się zalecanym standardem, wielu przeniosło swoje projekty do rodziny HTML – lub całkowicie porzuciło zastrzeżone wtyczki – przesyłając swoje treści na strony internetowe, takie jak YouTube. {Uwaga: ze względu na zwięzłość, Flashpoint oznacza każdy utwór, który nie zawiera struktur ani treści z obsługą wtyczek, etykietą „HTML”.}",
  "Platforms_Hypercosm_Player_Description": "Based on technology in development since 1989, Hypercosm is a 3D-content web player which launched in 1999. The company made a hefty investment that didn’t pay back, being one of the many victims of the dot-com crash, folding in 2001. However, the company was bought by ORBITEC, and thanks to a contract with NASA, the company managed to bounce back somewhat, and continued working on new projects until a restructuring in 2012, when it was put on hold by ORBITEC until a new business partner was interested in working with the tech. Such never happened, leading to Hypercosm shutting down in 2016.",
  "Platforms_HyperG_Description": "Hyper-G was a Gopher based Web Content Management System (WCMS), developed by the Institute for Information Processing and Computer Supported New Media (IICM) from Graz University of Technology, Austria in 1995. It was an alternative to the Hyperlinks of the World Wide Web, making use of Hyper-G enabled Browsers, which could display 3D models of directories and files, as well as other models, with a built-in viewer. Due to it being based on the increasingly obsolete Gopher, the predecessor to the WWW, it later evolved into Hyperwave in 1996, without the extra capabilities Hyper-G browsers offered, such as the 3D functions. The vast majority of its content is now lost due to how the files were stored with Gopher.",
  "Platforms_Java_Plugin_Description": "Wydane wraz z językiem programowania Java jako jedna z jego funkcji, aplety Java były małymi oknami aplikacji osadzonymi na stronach w celu uzyskania dodatkowych interaktywnych funkcji. Zostały stworzone, aby były wzajemnie kompatybilne w różnych systemach operacyjnych i przeglądarkach, a także były bardziej wydajne niż standardowy HTML. Było to wydajną opcją przez ponad 10 lat, ale począwszy od 2013 r. technologia leżąca u podstaw apletów zaczęła przestać być obsługiwana w głównych przeglądarkach, a wiele z nich stało się bezużytecznych, co doprowadziło do ich wycofania w 2017 r. i usunięcia z Java SE 11 w 2018 r.",
  "Platforms_LiveMath_Plugin_Description": "The LiveMath plugin is an application for interactive math, creating a window that could contain notes, formulas, graphs and other mathematical functions, to embed on a web page. Originally launched as Theorist in 1989 by Prescience Corporation, with the web plugin being launched in 1994, it was then renamed to MathView in 1997 after being bought by Waterloo Maple, before being bought by MathMonkeys and renamed to LiveMath in 1999. In 2014, with increasing problems and incompatibility with the latest browsers, the plugin was retired, being replaced by a standalone viewer called LiveMath Viewer.",
  "Platforms_Microsoft_Silverlight_Description": "Opracowane przez Microsoft w odpowiedzi na Flasha i Javę, a uruchomione w 2007 roku, Silverlight to narzędzie multimedialne, które koncentruje się na strumieniowaniu wideo, godne uwagi z tego, że jest używane przez Netflix. Późniejsze wersje dodały więcej możliwości dla innych aplikacji. Cieszył się przyzwoitą popularnością, ze wskaźnikiem przyjęcia wynoszącym 64,7% w 2011 roku. Jednak w 2012 roku, wraz z ogłoszeniem końca NPAPI, wydaniem Windows 8 i początkiem adopcji HTML5, Microsoft wycofał oprogramowanie i w 2015 roku wraz z wydaniem systemu Windows 10 wszedł w fazę End-of-Life, i został dyskontynuowany w październiku 2021 roku.",
  "Platforms_Octree_View_Description": "Zaczynając jako starsza wtyczka o nazwie PicTree Viewer lub PicView, a następnie przebudowana jako nowa wtyczka Fastview przed zmianą nazwy w 1999 r., Octree View to przeglądarka obiektów 3D oparta na technologii Voxel opracowywanej od co najmniej 1980 r., która wykorzystuje specjalne kamery i skanery laserowe do tworzenia obrazów. Firma nadal korzystała ze swojej technologii i wtyczki, ale w 2007 roku jej strona internetowa przestała być aktualizowana, pozostawiając ją bez dalszej aktywności.",
  "Platforms_Play3D_DeepV_Description": "Play3D to wtyczka 3D wydana w 1996 roku przez Heads Off, która w następnym roku została zmieniona i ponownie wydana jako DeepV. Poza garstką przykładów wtyczka nie była używana przez cały okres swojego istnienia. Witryna dewelopera przestała działać w 2001 roku.",
  "Platforms_PopCap_Plugin_Description": "Wtyczka PopCap była wtyczką do prezentowania wersji demonstracyjnych gier stworzonych przez programistę PopCap. Na początku firma wykorzystywała Javę do demonstracji gier online ze względu na jej dostępność. Później jednak rozwój został przeniesiony na wewnętrzną wtyczkę, która była dostępna jako kontrolka ActiveX i tradycyjna wtyczka do Firefoksa. Dało to PopCap korzyść posiadania własnej, zastrzeżonej platformy do dystrybucji wersji demo. Jednak jego niepełne wykorzystanie zarówno przez klientów, jak i samych PopCap doprowadziło programistę do przejścia na bardziej popularną wersję Flash do 2007 roku.",
  "Platforms_ProtoPlay_Description": "ProtoPlay was a plugin intended to showcase prototypes for consumer interaction with products and a simulation of their features. Released in 1996, it made use of the Altia Design authoring program to create applications, consisting of 2D sprites with interactive elements. The plugin was more utilitarian in nature, and it wasn’t actively advertised starting in late 2003, existing more as a feature that was available if needed. Altia Design and the plugin kept getting updates to improve functionality, and in 2007 a new tool that allowed Photoshop to create plugin apps called PhotoProto was released. In 2009, Altia Inc. shifted its focus to designing user interfaces, leaving behind the prototyping aspect of the software, and ProtoPlay along with it.",
  "Platforms_Pulse_Player_Description": "Rozpoczynając rozwój w 1997 roku pod nazwą 3rd Degree, Pulse Player był wtyczką 3D z naciskiem na animację. Po raz pierwszy został wydany w 1999 roku dzięki finansowaniu i wsparciu kilku doświadczonych członków w dziedzinie mediów internetowych i był używany przez kilku znaczących klientów. Wtyczka była reklamowana jako zabawna i kreatywna platforma multimedialna i wydawała się odnosić sukcesy, ale na początku 2001 roku nastąpiła zmiana w tym, do czego firma chciała dążyć, zmieniając markę odtwarzacza na poważniejsze narzędzie biznesowe i edukacyjne. W 2003 r. wypuszczono ostatnią wersję 5.2, a wkrótce po tym, odcięto wsparcie.",
  "Platforms_REBOL_Plugin_Description": "REBOL to język programowania projektowany przez ponad 20 lat i wydany w 1997 roku, a w 2004 roku powstał eksperymentalny prototyp wtyczki internetowej REBOL wraz ze stroną zawierającą kilka przykładów. Wtyczka rozpoczęła się jako ActiveX tylko dla Internet Explorera, ale później w 2006 roku została wydana wersja wtyczki dla innych przeglądarek. Jednak wkrótce po tym wydano ostatnią aktualizację, pozostawiając ją w wersji beta jako niezabezpieczony prototyp.",
  "Platforms_ShiVa_Web_Player_Description": "Stworzony przez Stonetrip i nazwany Ston3D Web Player przed 2007 rokiem, ShiVa Web Player był wtyczką do treści internetowych 3D do uruchamiania oprogramowania stworzonego w silniku ShiVa 3D Engine. Pozwoliło to na tworzenie złożonych scen 3D z oświetleniem i fizyką przy niskich wymaganiach dotyczących przetwarzania. Stonetrip później zmienił nazwę w 2013 roku na ShiVa Technologies SAS i skupił się wyłącznie na silniku. Wraz z usunięciem NPAPI z większości przeglądarek, wsparcie dla wtyczki zmalało, co doprowadziło do tego, że w 2018 roku adresy URL kilku podstawowych plików uległy awarii i zepsuły większość gier, a w 2019 roku jego pobieranie zostało usunięte ze strony ShiVa.",
  "Platforms_Superscape_Viscape_Description": "Launched in 1996 by early 3D pioneer Superscape with support from Intel, and originally called VisNet, Viscape was a 3D plugin that had the distinct advantage of interactivity with worlds, unlike the static models of VRML 1.0. It enjoyed a brief period of popularity, and at first there were no plans to support VRML, but with VRML97 implementing interactivity, an update named Viscape Universal was released in 1998, adding VRML support to remain relevant. This proved to not be enough, with financial trouble and failed partnerships, and reviewers calling the plugin dated and cumbersome despite their efforts at a revival. Although the last update was released in 2000, its tech continued to be utilized in Superscape's Lego Creator series for the following year. An attempt was made to update it by embedding the plugin inside Java Applets, called Vislite, but in the end the company then refocused on mobile game development and achieved moderate success before being purchased by Glu Mobile in 2008.",
  "Platforms_Tcl_Plugin_Description": "Developed by a small team and launched in 1988, Tool Command Language (Tcl, pronounced “tickle”) is an open source dynamic programming language. In 1994, Sun Microsystems brought the team in to develop the tech further. One of the outcomes of this venture was a 1996 plugin that could run Tcl applets (“Tclets”) embedded in pages. In late 1997, Tcl’s development was spun off to an independent company called Scriptics, and spun off once again into Tcl Core Team in 2000. While development of the language remains lively to this day, work on the plugin has slowed to a crawl despite not being officially discontinued. The latest version, 3.1.0, was released in 2006.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine to wieloplatformowy silnik gier, który ma na celu ułatwienie tworzenia gier i jest najpopularniejszym oprogramowaniem do tworzenia gier firmy trzeciej wśród deweloperów na całym świecie. Stworzony wraz z samym Unity i zaimplementowany w pierwszej łatce w 2005 roku, Unity Web Player był narzędziem do grania w gry Unity w sieci. Pozostała popularną platformą dla gier 3D, ale wraz z usunięciem obsługi NPAPI w 2016 r. wtyczka została porzucona na rzecz Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap to narzędzie do wizualizacji interaktywnych map osadzonych na stronie internetowej. Był kompatybilny z kilkoma plikami map z różnych programów autorskich, mógł wyświetlać szczegółowe informacje o sektorach i umożliwiał wykonywanie pomiarów. Po jego uruchomieniu w 1997 r. nie dokonano już żadnych zmian w tej technologii, pozostając niezmienioną do czasu, gdy strona przestała działać w 2004 r.",
  "Platforms_Vitalize_Description": "Stworzony w 1997 roku przez firmę Corel do wyświetlania treści stworzonych za pomocą autorskiego programu multimedialnego Click&Create, Vitalize! była wtyczką o niskiej przepustowości dedykowaną prostym grom internetowym, z naciskiem na gry, marketing i reklamę. Dystrybuowany z pomocą Europress, był dumny z tego, że jest „łatwy do nauczenia się i używania w przeciwieństwie do Javy czy Shockwave”. W 1999 roku byli pracownicy firmy Corel odeszli, aby stworzyć Clickteam, który następnie przejął rozwój w 2000 roku z wersją 2.0. Najnowsza wersja 4.0 została wydana w 2007/2008 i była dostępna na ich stronie internetowej do 2012 roku.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage is an open 3D standard and the very first created for the web. When it was initially specified in November 1994, the format could only represent static models with no interactivity. This problem was solved in 1997 when version 2.0, better known as VRML97, was published. Despite never seeing mainstream use, it would become the most popular option for internet-based 3D upon its launch before being superseded in 2001 by X3D (which was backwards compatible with VRML worlds). As it was a file format and not a plugin in itself, many different implementations have been made of VRML, often adding their own non-standard features.",
  "Platforms_Xara_Plugin_Description": "Wtyczka Xara była przeglądarką grafiki wektorowej, korzystającą z zastrzeżonego formatu o niskiej przepustowości. Wydana jako beta, a później pełna wersja w 1996 roku, umożliwiając przeglądanie plików Flare utworzonych za pomocą CORELXara w Internecie. Później, w 1997, Xara Webster została uruchomiona specjalnie do tworzenia grafiki internetowej dla wtyczki. W 1999 roku 2.08a była ostatnią wydaną wersją. W 2000 roku Xara Webster został zastąpiony przez XaraX, który mógł eksportować do Flasha, innej wtyczki wektorowej, więc porzucono wsparcie dla ich własnej zastrzeżonej opcji i przeniesiono ją do archiwum starszego oprogramowania.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin to narzędzie zwiększające produktywność stworzone przez Logic Pulse w 1996 roku. Była to nowa funkcja dodana do wersji 3.2 Calendar Quick, aplikacji komputerowej do tworzenia kalendarzy i planowania. Pozwala użytkownikom publikować je za pomocą funkcji eksportu na stronach internetowych, które można łączyć z innymi osobami i przeglądać za pomocą wtyczki. Po naprawieniu błędu Y2K w 1999 r., strona została porzucona bez dalszych aktualizacji i przepadła w 2001 r.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion was a line of AR (augmented reality) programs that started development in 1999 by Total Immersion that made use of video cameras to display 3D objects in real time. One of those programs was D'Fusion @Home, released in 2008, with a plugin later in 2009. Applications for it were created using the authoring program, D'Fusion Studio, and its main focus was on marketing and short experiences. By 2011, the tech struggled to reach widespread adoption. Even with more accessible Flash implementation and the authoring software becoming free, its adoption was still very limited. Following the rise of smartphones, TryLive was developed as another AR-based solution to easily preview products such as furniture and eyewear, which became successful unlike the D'Fusion line which received no further updates after 2013. In 2015, the company was sold to ACEP, an eyewear company.",
  "Platforms_DPGraph_Description": "Stworzony w 1999 roku przez Davida Parkera, DPGraph (Dynamic Photorealistic Graphing) to wykonywalny program przeznaczony do wyświetlania wykresów ze stron internetowych. Mogą animować i wyświetlać do 8 wymiarów, z kontrolą zmiennych. Działało to poprzez pobranie pliku ze strony internetowej, który kazałby przeglądarce uruchomić program i renderować wykresy. Pełna wersja została licencjonowana do kilku instytucji edukacyjnych do użytku w salach lekcyjnych i do nauki w celu tworzenia wykresów, a także darmowego odtwarzacza do ich przeglądania. Ostatnia aktualizacja miała miejsce w 2016 r., a w 2019 r. pełna wersja DPGraph stała się bezpłatna dla każdego.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) to wtyczka do animacji wydana przez firmę Sharp w 2001 roku. Zaprojektowana z myślą o urządzeniach mobilnych, takich jak telefony i PDA, została wydana dla wybranych modeli telefonów wyłącznie w Japonii, a także jako wtyczka do przeglądarki. Szczycił się małym rozmiarem pliku i grafiką wektorową, która pasuje do każdego ekranu telefonu komórkowego. Technologia została udostępniona odbiorcom w USA w 2002 roku pod nazwą SharpMotionART. Żadne z nich nie przzetrwało długo, ponieważ e-animator opublikował swoją ostatnią aktualizację w 2003 roku, a SharpMotionART został wycofany w 2004 roku.",
  "Platforms_Envoy_Description": "Envoy was a document format developed in 1993 by Tumbleweed Software, created by virtually printing them in WordPerfect. It was a competitor to Adobe Acrobat and its PDF format. WordPerfect Corporation was sold to Novell in 1994, which included Envoy, but Tumbleweed continued working with Novell, creating a web plugin in 1995 to view files online. Novell sold WordPerfect to Corel in 1996, but retained ownership of Envoy. By 1999, Novell had stopped developing Envoy, and Corel dropped support for Envoy from WordPerfect 2000. This ended the collaboration Tumbleweed had with Novell after the 1994 acquisition of Envoy, and support for the plugin was dropped.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) is a lightweight animation plugin developed by Sharp in 1997. It had several versions of the authoring software bundled with Sharp computers and for different demographics, the main one being “EVA Animator”. A more kid friendly “EVA Animator Kids”, with a エバキッズクラブ (EVA Kids Club) website was launched in 2000. These were discontinued in 2007 and replaced with an intermediate level “EVA Animator School II”. The last major update to the plugin came in 2002 with one minor fix in 2008, but despite this it maintained a small community of users, until Sharp shut down the main website in 2016.",
  "Platforms_Flatland_Rover_Description": "Rover is a 3D plugin based on the 3DML language developed in 1997 by Flatland. Users could create “Spots” with the Spotnik authoring program, made of “Levels” containing “Blocks” for ease of development, and run them with Rover, available as a browser plugin and a standalone program. Development was lively until the dot-com crash, when most of the team disbanded, with the last update released in 2005, and the website being abandoned before going down in 2012. One of the former developers, Michael Powers, decided in 2014 to revive the website, create an archive of the software, and to update it to run on modern systems. The standalone Rover app was revised in 2017, but the plugin didn’t return.",
  "Platforms_FreeHand_Description": "FreeHand was a vector graphics creative suite from 1988 created by Altsys Corporation. Macromedia bought FreeHand in 1994, and continued developing it. In October 1996, FreeHand 7.0 was launched with a plugin for the web, called Shockwave for FreeHand. The plugin allowed vector images created by the program to be embedded and viewed in a web page. In November 1996, Macromedia bought FutureSplash, another vector graphics web plugin, which was renamed to Flash.  FreeHand 8.0 was released in 1998, and now exported to Flash, instead of the FreeHand plugin. The last new version of the program, FreeHand MX, was released in 2003.",
  "Platforms_HotSauce_Description": "A Meta Content Framework (MCF) was a metadata structuring format developed by Apple Computer's Advanced Technology Group starting in 1995, and in 1996 Project X would become an experimental plugin created to view them on the internet, later called HotSauce, which showcased sitemaps in a 3D space. At the end of 1996, 200+ websites used HotSauce, later growing to 300+, and a deal with NetCarta was reached to create a library of over 30.000 websites to navigate using the plugin. Although the MCF standard gained some praise, most users didn’t see an advantage to this 3D navigation method, and the project ended up as one of the many canceled when Steve Jobs came back to Apple in 1997.",
  "Platforms_MHSV_Description": "Launching as an alpha called VSV ({V}irtual {S}pace {V}iewer) and later renamed to MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), it was a plugin developed by ParaGraph that allowed for interactive 3D worlds made using the VHSB ({V}irtual {H}ome {S}pace {B}uilder) authoring program, which could create both interactive MHSV and standard static VRML worlds. In 1996, the development of the VRML 2.0 standard added interactivity, and ParaGraph updated VHSB to allow creation of VRML 2.0 worlds, but ParaGraph decided to work with Silicon Graphics and their viewer Cosmo VRML 2.0 player, adapting VHSB to work better with it, abandoning MHSV in the process. Silicon Graphics acquired ParaGraph in 1997 to create Cosmo Software.",
  "Platforms_O2C_Player_Description": "Part of the o2c (objects to see) line, the o2c Player was a 1999 web 3D plugin for showcasing objects and scenes, developed by German company mb Software AG. The company sold the o2c technology to ELECO plc in 2003, who developed and launched in 2005 Version 2.0 of the o2c player, bringing much better performance with 3D acceleration, and was branded more as a CAD tool for Architects. Support for more browsers was added, but no major updates were made to it, consisting mostly of bug fixes. As of 2021 the plugin is still available for download, but Elcosoft has moved onto a Unity WebGL implementation of the tech.",
  "Platforms_Pixound_Description": "Pixound był artystycznym pluginem muzycznym, uruchomionym w 1996 roku jako wspólne przedsięwzięcie Hologramophone Research i Frankfurt Balkind Partners. Działał jak klawiatura MIDI, która wykorzystywała wartości kolorów obrazów do tworzenia różnych nut i wysokości. W 2003 roku Hologramophone zmienił nazwę na Techné Media. W 2005 r. wtyczka została porzucona na rzecz samodzielnej aplikacji wyłącznie dla systemu Mac OS X. Później stał się aplikacją na iOS w 2011 roku.",
  "Platforms_PointPlus_Description": "PointPlus był wtyczką do osadzania prezentacji PowerPoint w Internecie, opracowanym przez Net-Scene, wydanym w maju 1996 roku dla Windows NT i 95. Pozycjonował się jako alternatywa dla bardziej złożonej Macromedia Shockwave, dla początkujących użytkowników do korzystania ze standardu PowerPointa. Do listopada opracowano przeglądarkę Java, która była kompatybilna z różnymi platformami i nie wymagała żadnych wtyczek. Została zachowana jako opcja dla wyspecjalizowanych przypadków, ale linia produktów przestała otrzymywać aktualizacje w 1997 roku. Witryna została zamknięta na początku 2001 roku.",
  "Platforms_Show_It_Description": "Show It! was a plugin introduced in 1997 with WordPerfect Suite 8 as one of the features of Corel Presentations 8, a PowerPoint competitor. When exporting with the Internet Publisher option, they could export the presentations as either a static image slideshow, or as an embedded projector using a proprietary file that functioned just like the original desktop app, preserving all features, which needed the plugin. It continued to be supported in WordPerfect Office 2000 with Presentations 9, but by 2001, support for the plugin option was dropped from Presentations 10 in WordPerfect Office 2002.",
  "Platforms_Squeak_Etoys_Description": "Squeak był platformą open source, uruchomioną w 2001 roku, do tworzenia treści rozrywkowych i edukacyjnych. Użytkownicy mogli tworzyć małe aplikacje przeznaczone dla dzieci w różnym wieku, od najmłodszych „Etoys”, po „Omniuser” i „Expert”. Został przemianowany na Etoys w 2008 roku i przesunięty bardziej w kierunku młodszych dzieci. Etoys 5 to ostatnia wersja wtyczki, wydana w 2012 roku. Rozwój programu w wersji JavaScript rozpoczął się w 2013 roku z powodu obaw o bezpieczeństwo, pozostawiając wtyczkę porzuconą i zastąpioną nią.",
  "Platforms_ThingViewer_Description": "ThingViewer was a 1997 multimedia plugin made by Parable Corporation, who later changed names to ThingWorld in 1998. It made “Things”, assets that could optionally be protected against stealing or tampering and have a unique ID with credit to share around websites, using simple modular programming, to create things such as images, animations and even interactive games, made using the ThingMaker authoring program or converting Shockwave Director files using ThingConverter. It was relatively popular, even getting deals with Microsoft in and several others in 1999, but at the end of 2000, the company reduced staff and was in talks with an unknown party for a merger to sell the tech. The website shut down in 2002.",
  "Platforms_Coming_Soon": "Dostępne wkrótce",
  "Platforms_Coming_Soon_Description": "Gry i animacje utworzone na tych platformach będą dostępne w następnej aktualizacji.",
  "Platforms_iPix_Description": "(no description available for now)",
  "Platforms_Surround_Video_Description": "(no description available for now)",
  "Platforms_SmoothMove_Panorama_Description": "(no description available for now)",
  "Platforms_Formula_One_Description": "(no description available for now)",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": " Harvard Graphics was a presentations program created in 1986 by Software Publishing Corporation (SPC) for MS-DOS PCs. After their transition to Windows in 1991, it failed to regain the market share it had and lost to PowerPoint. In 1996 Allegro New Media (renamed to Vizacom later that year) bought SPC and Serif. SPC created ASAP WordPower, a program to easily create slideshows, that could be published on the web using the ASAP WebShow plugin. SPC merged with Serif in 1997. 1998 saw the Harvard brand revitalised with the Harvard Graphics 98 authoring program, and the plugin was replaced with a new one called Harvard Graphics WebShow. In 2000 Advanced Presentations, the new version of the authoring software, exported to the Flash standard instead of the proprietary plugin format. Vizacom sold Serif back to their original management in 2001, which relegated the Harvard range to legacy software, being supported and sold until being discontinued in 2017.",
  "Platforms_X3D_Description": "(no description available for now)",
  "Platforms_DeltaPoint_WebAnimator_Description": "(no description available for now)",
  "Platforms_Ambulant_Description": "Ambulant is a player for SMIL files, made by numerous individuals coordinating at CWI in Amsterdam, Netherlands. The name appears to reference “ambulation”, another word for walking; this is further supported by the logo appearing to be someone walking. SMIL was a specification made by W3C, the international web consortium, but failed to gain much popularity. Ambulant attempted to be an open source player that supports all SMIL files. However, the desire to make all parts open source prevented them from supporting some proprietary media formats. Development began in April 2003 and the first version, “AMBULANT/G” was released in July of that year. The last stable version, 2.6, was released in February 2015, however work on an unstable build of Ambulant 2.7 continued until July 2016, when the last commit to their Github repo was made. The developers of Ambulant are still active on other projects.",
  "Platforms_SVF_Viewer_Description": "(no description available for now)",
  "Platforms_NoteWorthy_Composer_Description": "(no description available for now)",
  "Platforms_Blender_Description": "(no description available for now)",
  "Platforms_Fractal_Viewer_Description": "(no description available for now)",
  "Platforms_AboutTime_Description": "(no description available for now)",
  "Platforms_AboutPeople_Description": "(no description available for now)",
  "Platforms_Illuminatus_Description": "(no description available for now)",
  "Platforms_Lightning_Strike_Description": "(no description available for now)",
  "Platforms_JCAMPDX_Description": "(no description available for now)",
  "Platforms_Argus_Autodesk_MapGuide_Description": "(no description available for now)"
}