{
  "Platforms_Title": "Obsługiwane platformy",
  "Platforms_Description1": "Flashpoint obsługuje gry i animacje stworzone dla różnych wtyczek i standardów internetowych - nie tylko Flash. Ta strona zawiera przegląd każdej technologii wraz z liczbą utworów od wersji 11.",
  "Platforms_Description2": "Służy to jako podsumowanie „Kto? Kiedy? Co?” i punkt wyjściowy do dalszych badań, nie jest to wyczerpująca historia każdej platformy. Dokładamy wszelkich starań, aby przedstawić dokładne fakty, ale nadal możliwe są błędy. Prosimy o kontakt z odpowiednimi informacjami dotyczącymi poprawek.",
  "Platforms_By": "autorstwa",
  "Platforms_Entries": "Utwory",
  "Platforms_Entry": "Utwór",
  "Platforms_3D_Groove_GX_Description": "Założona w 1998 roku firma The Groove Alliance była twórcą 3D Groove SX, silnika gier 3D obsługującego technologię Shockwave. Później, w 2002 roku, silnik odłączył się od Shockwave i przekształcił się w swój własny produkt o nazwie 3D Groove GX. Obie odmiany można wykorzystać do tworzenia gier online i aplikacji komputerowych. Okazało się to sukcesem dla firmy, gromadząc dużą bazę użytkowników korporacyjnych i prowadząc do stworzenia kilku głośnych tytułów dla programów telewizyjnych i innych dużych podmiotów. Po wygaśnięciu szumu, The Groove Alliance został przekształcony w OTOY w 2008 roku, ale strona internetowa 3D Groove pozostała online do 2009 roku. Dokładna przyczyna upadku oryginalnej firmy jest nieznana, ale potwierdzono, że miały miejsce wewnętrzne zmagania.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (dawniej 3D Life Player, Virtools Player i NeMo Web Player, nie mylić z 3DVIA Studio/Beta Player lub 3DVIA Composer Player) był wtyczką przeglądarki firmy Dassault Systèmes do odtwarzania doświadczeń 3D wykonanych w Virtools. Przeznaczony był do zaawansowanych, praktycznych zastosowań 3D, takich jak szkolenia komputerowe, wirtualne wycieczki i nieruchomości. 3DVIA Player był również używany w grach internetowych, a jednymi z jego głównych użytkowników do tego celu były studio gier Sarbakan z siedzibą w Quebecu i Little Chicken Game Company z Amsterdamu. Ostatnia aktualizacja, wersja 5.0, została wydana w 2009 roku. Strona pobierania pozostanie aktywna przez najbliższe lata, dopóki nie została usunięta w 2016 roku. Do tego czasu została zainstalowana ponad 30 milionów razy.",
  "Platforms_AboutPeople_Description": "Brak opisu.",
  "Platforms_AboutTime_Description": "Brak opisu.",
  "Platforms_ActiveX_Controls_Description": "Wydany w 1996 roku przez Microsoft ActiveX był frameworkiem programowym, który służył jako standard, który pozwalał na hermetyzację programów jako kontenerów do użytku w innych niepowiązanych programach, zwanych kontrolkami ActiveX. Mogą być osadzone w treści HTML, a Kontrolki jednofunkcyjne mogą być tworzone specjalnie do użytku w Internet Explorerze, w celu odtwarzania gier internetowych. Po premierze Edge'a w 2015 roku, oprogramowanie to było przestarzałe, a jego użycie w aplikacjach internetowych pozornie przestało istnieć, przenosząc je do Internet Explorera 11 w celu obsługi starszego oprogramowania.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Rozpoczynając rozwój w 1996 roku jako V3O przez Rocket Science Games, później przeniesione do Attitude Software przemianowane na 3D Anarchy, a następnie sprzedane Adobe w 2000 i przemianowane w 2001, Atmosphere Player to wtyczka internetowa stworzona do przeglądania interaktywnych światów 3D, podobna do VRML standard, stworzony w Atmosphere Builder. Była przeznaczona głównie dla wirtualnych galerii mediów, które mogły prezentować obrazy/audio/wideo oraz same modele 3D. Kiedy po raz pierwszy wystartowała jako 3D Anarchy, oprogramowanie wciąż znajdowało się w fazie beta, kiedy Adobe nabyło technologię do dalszego rozwoju, gdzie spędziło następne 3 lata na testach beta, a ostatnia wersja 1.0 odtwarzacza została wydana w lutym 2004 roku. W grudniu 2004 r. ogłoszono, że Atmosphere zostanie przerwana, a wsparcie zostanie odcięte w styczniu 2005 r.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (również po prostu Flash, dawniej Macromedia Shockwave Flash Player) to odtwarzacz animacji i grafiki wektorowej, często z dodatkową interaktywnością. Był używany jako medium do gier internetowych ze względu na efektywną kompresję, niską cenę, łatwość obsługi i dużą bazę instalacji. Opracowany w 1995 roku i po raz pierwszy wprowadzony przez FutureWave w 1996 roku, był zdolny do niewiele więcej niż podstawowych animacji i przycisków do ich sterowania. Wraz ze wzrostem popularności do odtwarzacza dodano bardziej zaawansowane funkcje, takie jak język programowania ActionScript. Jednak, gdy ludzie zaczęli obawiać się potencjalnych obaw związanych z bezpieczeństwem, a popularność HTML5 wśród twórców stron internetowych wzrosła, Adobe ogłosił, że data zakończenia użytkowania Flasha przypada na 31 grudnia 2020 r.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (także Shockwave, dawniej Macromedia Shockwave Player lub Shockwave Director Player) to odtwarzacz mediów interaktywnych wydany w 1995 roku. Zbudowany w oparciu o technologię rozwijaną 10 lat wcześniej przez MacroMind, stał się wtyczką internetową dopiero po jej przejęciu przez Macromedia. W przeciwieństwie do Flasha, Shockwave zawierał język skryptowy Lingo i obsługę C++ poprzez użycie Xtras, dając graczowi szeroki zakres możliwości, w tym 3D. Był szeroko stosowany we wczesnym Internecie oraz w grach na CD-ROM i zyskał popularność w głównym nurcie. Platforma odnotowała znaczny spadek popularności po przejęciu przez Adobe firmy Macromedia na rzecz Flasha, który szybko rozwijał się pod względem funkcji i był teraz również własnością Adobe. Wreszcie w lutym 2019 r. Adobe ogłosiło zaprzestanie i ograniczenie wsparcia dwa miesiące później.",
  "Platforms_Alambik_Plugin_Description": "Wtyczka Alambik to odtwarzacz internetowy dla treści stworzonych za pomocą platformy programistycznej Alambik. Wydany w 2001 roku był zdolny do grafiki 2D i 3D, wektorów i wielu innych aplikacji. W 2002 roku Alambik zorganizował konkurs z nagrodami z okazji wydania Alambik Script. W 2004 roku Alambik stworzył nową stronę z demo, ale potem firma zamilkła i nigdy nie wydała niczego nowego dla platformy ani nie aktualizowała wtyczki.",
  "Platforms_Ambulant_Description": "Ambulant to odtwarzacz plików SMIL, stworzony przez wiele osób koordynujących w CWI w Amsterdamie w Holandii. Nazwa wydaje się nawiązywać do „ambulation”, innego słowa oznaczającego chodzenie; jest to dodatkowo wspierane przez logo, które wydaje się być kimś chodzącym. SMIL był specyfikacją stworzoną przez międzynarodowe konsorcjum internetowe W3C, ale nie zyskała dużej popularności. Ambulant próbował być odtwarzaczem typu open source, który obsługuje wszystkie pliki SMIL. Jednak chęć uczynienia wszystkich części otwartymi źródłami uniemożliwiła im obsługę niektórych zastrzeżonych formatów multimedialnych. Prace rozwojowe rozpoczęły się w kwietniu 2003 roku, a pierwsza wersja „AMBULANT/G” została wydana w lipcu tego roku. Ostatnia stabilna wersja, 2.6, została wydana w lutym 2015 r., jednak prace nad niestabilną wersją Ambulant 2.7 trwały do ​​lipca 2016 r., kiedy dokonano ostatniego zatwierdzenia ich repozytorium Github. Twórcy Ambulant są nadal aktywni przy innych projektach.",
  "Platforms_AnimaFlex_Description": "AnimaFlex to wtyczka do odtwarzania grafiki, która może odtwarzać animacje o małym rozmiarze pliku, stworzona za pomocą RubberWeb Composer, która może rozciągać i zniekształcać obrazy. Może zacząć odtwarzać animacje przed pobraniem całego pliku i dostosować się do wolniejszych prędkości Internetu. Pomimo obietnic firma RubberFlex miała kilka innych produktów, z których wszystkie eksportowały gify, konkurując ze swoją zastrzeżoną opcją, a nawet uruchomiła FlexToGif, aby przekonwertować pliki wtyczek na gify 2 dni po wtyczce. Na początku 1998 roku RubberWeb Composer zaprzestał dystrybucji, pozostawiając AnimaFlex bez programu autorskiego.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics to program prezentacyjny stworzony w 1986 roku przez Software Publishing Corporation (SPC) dla komputerów z systemem MS-DOS. Po przejściu na system Windows w 1991 roku nie udało mu się odzyskać udziału w rynku i przegrał z PowerPoint. W 1996 roku Allegro New Media (przemianowane później na Vizacom) kupiło SPC i Serif. SPC stworzyło ASAP WordPower, program do łatwego tworzenia pokazów slajdów, które można było publikować w Internecie za pomocą wtyczki ASAP WebShow. SPC połączyło się z Serif w 1997 roku. W 1998 roku marka Harvard została zrewitalizowana dzięki programowi autorskiemu Harvard Graphics 98, a wtyczka została zastąpiona nową o nazwie Harvard Graphics WebShow. W 2000 Advanced Presentations, nowa wersja oprogramowania do authoringu, została wyeksportowana do standardu Flash zamiast zastrzeżonego formatu wtyczek. Vizacom sprzedał Serif z powrotem do ich pierwotnego zarządu w 2001 roku, który przeniósł gamę Harvard do starszego oprogramowania, które było obsługiwane i sprzedawane do czasu wycofania w 2017 roku.",
  "Platforms_Authorware_Web_Player_Description": "Authorware Web Player został stworzony przez Macromedia w 1996 roku jako jedna z nowych funkcji Authorware 3.5. Został stworzony jako sposób na uruchamianie w sieci interaktywnych programów opracowanych za pomocą Macromedia Authorware. W przeciwieństwie do większości wtyczek internetowych, głównym celem Authorware było wspomaganie e-learningu, co doprowadziło do jego wykorzystania w biznesie i na polu akademickim jako sposobu gromadzenia multimedialnych materiałów edukacyjnych bez konieczności posiadania doświadczenia w programowaniu. Ostateczna wersja wtyczki została wydana w 2004 roku, przed przejęciem Macromedia przez Adobe w 2005 roku, po czym prace rozwojowe zostały wstrzymane do czasu ogłoszenia ich zaprzestania w 2007 roku.",
  "Platforms_Autodesk_MapGuide_Description": "Brak opisu.",
  "Platforms_AXEL_Player_Description": "AXEL Player był interaktywną wtyczką do treści 3D stworzoną przez MindAvenue w 2002 roku. Był to sposób na modele i animacje w programie do tworzenia stron internetowych AXELedge oraz AXELpublisher, który konwertował pliki z innego oprogramowania 3D, takiego jak 3ds Max. Oprogramowanie zostało dobrze przyjęte przez krytyków, pomimo kilku ograniczeń, z których jednym jest brak wielu użytkowników wtyczki. W 2005 roku MindAvenue została przejęta przez firmę 20-20 Technologies, która specjalizowała się w oprogramowaniu do projektowania wnętrz i tworzenia mebli, a w 2006 roku ich strona internetowa stała się stroną kierującą do 20-20. Wszystkie produkty marki AXEL, w tym wtyczka, zostały wycofane.",
  "Platforms_BitPlayer_Description": "BitPlayer to aplikacja pulpitowa oparta na technologii Flash i Shockwave, stworzona w 1999 roku przez holenderską firmę BitMagic. Oferowała codzienne szorty, produkowane we własnym zakresie i przez klientów, którym towarzyszyły reklamy i quizy. Początkowo wyceniany na 6 milionów dolarów, stał się ofiarą katastrofy dot-com po swoich reklamodawcach i zaprzestał produkcji w styczniu 2001 roku. Wiele jego treści przetrwało od tego czasu jako przekonwertowane pliki SWF, pomimo utraty dodatkowej funkcjonalności oferowanej przez niestandardowy odtwarzacz.",
  "Platforms_Blender_Description": "Brak opisu.",
  "Platforms_Burster_Description": "Burster był implementacją Blender Game Engine z 2000 roku w 2010 roku. Projekt był próbą przywrócenia oficjalnej wtyczki uruchomionej wraz z Blenderem, która została wycofana ze względów bezpieczeństwa. Ulepszono oryginał, wykorzystując nowsze wersje silnika, aby uzyskać lepszą wydajność i grafikę. Ostatnia wersja została uruchomiona w 2013 roku, a po 3 latach braku aktualizacji Burster został oficjalnie wycofany w 2016 roku. Sam silnik gry został usunięty z Blendera w 2018 roku.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin to narzędzie zwiększające produktywność stworzone przez Logic Pulse w 1996 roku. Była to nowa funkcja dodana do wersji 3.2 Calendar Quick, aplikacji komputerowej do tworzenia kalendarzy i planowania. Pozwala użytkownikom publikować je za pomocą funkcji eksportu na stronach internetowych, które można łączyć z innymi osobami i przeglądać za pomocą wtyczki. Po naprawieniu błędu Y2K w 1999 r., strona została porzucona bez dalszych aktualizacji i przepadła w 2001 r.",
  "Platforms_Cult3D_Description": "Cult3D była przeglądarką internetową dla treści 3D wykonanych przy użyciu programu autorskiego Cult3D Designer. Odniósł umiarkowany sukces, z 6 milionami użytkowników do 2001 roku i kilkoma znaczącymi klientami korzystającymi z niego, a także dodano więcej opcji importowania modeli 3D z innych programów. 5.3 była ostatnią wersją wydaną w 2002 roku, a ostatnia aktualizacja wtyczki miała miejsce w 2004 roku, kiedy technologia została sprzedana firmie Mental Images GmbH. Nvidia kupiła później Mental Images w 2007 roku, stając się spółką zależną Nvidia Advanced Rendering Center. Pomimo aktualizacji witryny wtyczka nie otrzymała żadnych aktualizacji i od 2011 r. przestała być prezentowana jako realna opcja, a strona z plikami do pobrania została utrzymana ze względu na użytkowników, którzy nadal mieli licencję na tworzenie treści, która została później usunięta w 2013 r.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion to linia programów AR (rzeczywistości rozszerzonej), które zostały opracowane w 1999 roku przez Total Immersion, które wykorzystywały kamery wideo do wyświetlania obiektów 3D w czasie rzeczywistym. Jednym z takich programów był D'Fusion @Home, wydany w 2008 roku, z wtyczką później w 2009 roku. Aplikacje do niego zostały stworzone przy użyciu autorskiego programu D'Fusion Studio, a jego główny nacisk kładziono na marketing i krótkie doświadczenia. Do 2011 roku technologia miała trudności z osiągnięciem powszechnej adopcji. Nawet przy bardziej przystępnej implementacji Flasha i darmowym oprogramowaniu do tworzenia, jego przyjęcie było nadal bardzo ograniczone. Po pojawieniu się smartfonów TryLive został opracowany jako kolejne rozwiązanie oparte na AR, które umożliwia łatwy podgląd produktów, takich jak meble i okulary, które odniosły sukces w przeciwieństwie do linii D'Fusion, która nie otrzymała dalszych aktualizacji po 2013 roku. W 2015 roku firma została sprzedana ACEP, firmie produkującej okulary.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Brak opisu.",
  "Platforms_DPGraph_Description": "Stworzony w 1999 roku przez Davida Parkera, DPGraph (Dynamic Photorealistic Graphing) to wykonywalny program przeznaczony do wyświetlania wykresów ze stron internetowych. Mogą animować i wyświetlać do 8 wymiarów, z kontrolą zmiennych. Działało to poprzez pobranie pliku ze strony internetowej, który kazałby przeglądarce uruchomić program i renderować wykresy. Pełna wersja została licencjonowana do kilku instytucji edukacyjnych do użytku w salach lekcyjnych i do nauki w celu tworzenia wykresów, a także darmowego odtwarzacza do ich przeglądania. Ostatnia aktualizacja miała miejsce w 2016 r., a w 2019 r. pełna wersja DPGraph stała się bezpłatna dla każdego.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) to wtyczka do animacji wydana przez firmę Sharp w 2001 roku. Zaprojektowana z myślą o urządzeniach mobilnych, takich jak telefony i PDA, została wydana dla wybranych modeli telefonów wyłącznie w Japonii, a także jako wtyczka do przeglądarki. Szczycił się małym rozmiarem pliku i grafiką wektorową, która pasuje do każdego ekranu telefonu komórkowego. Technologia została udostępniona odbiorcom w USA w 2002 roku pod nazwą SharpMotionART. Żadne z nich nie przzetrwało długo, ponieważ e-animator opublikował swoją ostatnią aktualizację w 2003 roku, a SharpMotionART został wycofany w 2004 roku.",
  "Platforms_Envoy_Description": "Envoy był formatem dokumentu opracowanym w 1993 roku przez Tumbleweed Software, stworzonym przez wirtualne drukowanie ich w programie WordPerfect. Był konkurentem Adobe Acrobat i jego formatu PDF. WordPerfect Corporation został sprzedany firmie Novell w 1994 roku, w tym Envoy, ale Tumbleweed kontynuował współpracę z Novellem, tworząc w 1995 r. wtyczkę internetową do przeglądania plików online. Novell sprzedał WordPerfect firmie Corel w 1996 roku, ale zachował własność Envoy. W 1999 roku Novell przestał rozwijać Envoy, a firma Corel zrezygnowała ze wsparcia dla Envoy z WordPerfect 2000. To zakończyło współpracę Tumbleweeda z Novellem po przejęciu Envoy w 1994 roku, a wsparcie dla wtyczki zostało wycofane.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) to lekka wtyczka do animacji opracowana przez firmę Sharp w 1997 roku. Miała kilka wersji oprogramowania do tworzenia w pakiecie z komputerami Sharp i dla różnych grup demograficznych, z których główną jest „EVA Animator”. Bardziej przyjazna dzieciom „EVA Animator Kids” z witryną エバキッズクラブ (EVA Kids Club) została uruchomiona w 2000 roku. Zostały one przerwane w 2007 roku i zastąpione średniozaawansowanym „EVA Animator School II”. Ostatnia duża aktualizacja wtyczki pojawiła się w 2002 roku z jedną drobną poprawką w 2008 roku, ale mimo to utrzymywała niewielką społeczność użytkowników, dopóki Sharp nie zamknął głównej witryny w 2016 roku.",
  "Platforms_Flatland_Rover_Description": "Rover to wtyczka 3D oparta na języku 3DML opracowanym w 1997 roku przez Flatland. Użytkownicy mogli tworzyć „Spoty” za pomocą programu autorskiego Spotnik, składającego się z „Poziomów” zawierających „Bloki” dla ułatwienia programowania i uruchamiać je za pomocą Rovera, dostępnego jako wtyczka do przeglądarki i samodzielny program. Rozwój był żywy do czasu awarii dot-comu, kiedy większość zespołu rozeszła się, a ostatnia aktualizacja została wydana w 2005 roku, a strona internetowa została porzucona przed upadkiem w 2012 roku. Jeden z byłych programistów, Michael Powers, postanowił w 2014 roku wskrzesić stronę, stworzyć archiwum oprogramowania i zaktualizować je, aby działało na nowoczesnych systemach. Samodzielna aplikacja Rover została zaktualizowana w 2017 roku, lecz wtyczka nie powróciła.",
  "Platforms_Formula_One_Description": "Brak opisu.",
  "Platforms_Fractal_Viewer_Description": "Brak opisu.",
  "Platforms_FreeHand_Description": "FreeHand był kreatywnym pakietem grafiki wektorowej z 1988 roku stworzonym przez Altsys Corporation. Macromedia kupiła FreeHand w 1994 roku i dalej ją rozwijała. W październiku 1996 r. wypuszczono FreeHand 7.0 z wtyczką do sieci o nazwie Shockwave for FreeHand. Wtyczka umożliwiała osadzanie i wyświetlanie obrazów wektorowych utworzonych przez program na stronie internetowej. W listopadzie 1996 Macromedia kupiła FutureSplash, kolejną wtyczkę do grafiki wektorowej, której nazwę zmieniono na Flash. FreeHand 8.0 został wydany w 1998 roku, a teraz został wyeksportowany do Flasha zamiast wtyczki FreeHand. Ostatnia nowa wersja programu, FreeHand MX, została wydana w 2003 roku.",
  "Platforms_GoBit_Games_Plugin_Description": "Wtyczka GoBit Games została stworzona w 2008 roku przez GoBit, małe niezależne studio złożone z byłych pracowników PopCap. Ich pierwsza gra, Burger Shop, została wydana w październiku 2007 roku, a 4 miesiące później, zgodnie z powszechnym zainteresowaniem, otrzymała internetową wersję demonstracyjną, korzystając z nowej wtyczki do gier. Minął rok i demo zostało przerobione jako gra reklamowa dla Eggo, opublikowana przez Shockwave.com 1 lutego 2009. Wtyczka została porzucona wkrótce potem wraz z wydaniem Burger Shop 2 - jego odpowiedniego demo internetowego przy użyciu Flasha - pozostawiając Burger Shop i jego wersję ze zmienioną skórką jako jedyne gry, jakie kiedykolwiek stworzono dla niej.",
  "Platforms_HotSauce_Description": "Meta Content Framework (MCF) był formatem strukturyzowania metadanych opracowanym przez Apple Computer's Advanced Technology Group począwszy od 1995 roku, a w 1996 Project X stał się eksperymentalną wtyczką stworzoną do przeglądania ich w Internecie, później nazwaną HotSauce, która prezentowała mapy witryn w Przestrzeń 3D. Pod koniec 1996 roku ponad 200 stron korzystało z HotSauce, później rozrosło się do ponad 300, a firma NetCarta zawarła umowę, aby stworzyć bibliotekę ponad 30 000 stron internetowych do nawigacji za pomocą wtyczki. Chociaż standard MCF zyskał pewne pochwały, większość użytkowników nie dostrzegła zalet tej metody nawigacji 3D, a projekt zakończył się jako jeden z wielu anulowanych, gdy Steve Jobs wrócił do Apple w 1997 roku.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage to standard wyświetlania dokumentów przez przeglądarkę internetową. Pierwotnie opracowany przez Tima Bernersa-Lee we wczesnych latach 90. (z korzeniami sięgającymi 1980 r.) HTML stał się główną metodą udostępniania informacji przez Internet, a jego możliwości zostały rozszerzone o inne języki, takie jak CSS i JavaScript. Po raz pierwszy został wprowadzony na rynek w 1993 roku i otrzymał kolejne aktualizacje z HTML2 w 1995, a zarówno HTML3, jak i HTML4 w 1997. Ostatnia aktualizacja HTML4 miała miejsce w 2000 roku, a po latach jego połączone języki były w dużej mierze ignorowane jako platforma do gier, animacji i innych treści internetowych, a programiści zdecydowali się zamiast tego na technologię opartą na wtyczkach, ale wraz z rozwojem technologii i Internetu wtyczki stały się przestarzałe, więc podjęto wysiłek aktualizacji standardu, a w 2008 r. uruchomiono HTML5. Ponieważ Flash i inne wtyczki wyszły z mody, HTML5 stał się zalecanym standardem, wielu przeniosło swoje projekty do rodziny HTML – lub całkowicie porzuciło zastrzeżone wtyczki – przesyłając swoje treści na strony internetowe, takie jak YouTube. {Uwaga: ze względu na zwięzłość, Flashpoint oznacza każdy utwór, który nie zawiera struktur ani treści z obsługą wtyczek, etykietą „HTML”.}",
  "Platforms_HyperG_Description": "Hyper-G był opartym na Gopher systemem zarządzania treścią internetową (WCMS), opracowanym przez Institute for Information Processing and Computer Supported New Media (IICM) z Graz University of Technology w Austrii w 1995 roku. Stanowił alternatywę dla hiperłączy świata Wide Web, wykorzystujący przeglądarki obsługujące Hyper-G, które mogą wyświetlać modele 3D katalogów i plików, a także inne modele z wbudowaną przeglądarką. Ponieważ bazuje na coraz bardziej przestarzałym Gopherze, poprzedniku WWW, przekształcił się później w Hyperwave w 1996 roku, bez dodatkowych możliwości oferowanych przez przeglądarki Hyper-G, takich jak funkcje 3D. Zdecydowana większość jego zawartości jest teraz stracona z powodu sposobu przechowywania plików przez Gopher.",
  "Platforms_Hypercosm_Player_Description": "Oparty na technologii rozwijanej od 1989 roku, Hypercosm jest odtwarzaczem internetowym z treściami 3D, który został wprowadzony na rynek w 1999 roku. Firma dokonała ogromnej inwestycji, która nie zwróciła się, będąc jedną z wielu ofiar krachu dot-comów, bankrutująć w 2001 roku. Firma została jednak kupiona przez ORBITEC i dzięki umowie z NASA udało się jej nieco odbić i kontynuowała pracę nad nowymi projektami aż do restrukturyzacji w 2012 roku, kiedy to została wstrzymana przez ORBITEC, dopóki nowy partner biznesowy nie zainteresuje się współpracą z technologią. Tak się nigdy nie stało, co doprowadziło do zamknięcia Hypercosm w 2016 roku.",
  "Platforms_Illuminatus_Description": "Brak opisu.",
  "Platforms_iPix_Description": "Brak opisu.",
  "Platforms_Java_Plugin_Description": "Wydane wraz z językiem programowania Java jako jedna z jego funkcji, aplety Java były małymi oknami aplikacji osadzonymi na stronach w celu uzyskania dodatkowych interaktywnych funkcji. Zostały stworzone, aby były wzajemnie kompatybilne w różnych systemach operacyjnych i przeglądarkach, a także były bardziej wydajne niż standardowy HTML. Było to wydajną opcją przez ponad 10 lat, ale począwszy od 2013 r. technologia leżąca u podstaw apletów zaczęła przestać być obsługiwana w głównych przeglądarkach, a wiele z nich stało się bezużytecznych, co doprowadziło do ich wycofania w 2017 r. i usunięcia z Java SE 11 w 2018 r.",
  "Platforms_JCAMPDX_Description": "Brak opisu.",
  "Platforms_Lightning_Strike_Description": "Brak opisu.",
  "Platforms_LiveMath_Plugin_Description": "Wtyczka LiveMath to aplikacja do interaktywnej matematyki, tworząca okno, które może zawierać notatki, formuły, wykresy i inne funkcje matematyczne, które można osadzić na stronie internetowej. Pierwotnie wprowadzony jako Theorist w 1989 roku przez Prescience Corporation, a wtyczka internetowa została uruchomiona w 1994 roku, następnie została przemianowana na MathView w 1997 po zakupie przez Waterloo Maple, zanim została kupiona przez MathMonkeys i przemianowana na LiveMath w 1999. W 2014 roku, z narastającymi problemami i niekompatybilnością z najnowszymi przeglądarkami, wtyczka została wycofana, zastępując ją samodzielną przeglądarką o nazwie LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Brak opisu.",
  "Platforms_MHSV_Description": "Uruchomiony jako alfa o nazwie VSV ({V}irtual {S}pace {V}iewer) i później przemianowany na MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), był to plugin opracowany przez ParaGraph, który pozwalał na tworzenie interaktywnych światów 3D przy użyciu programu do authoringu VHSB ({V}irtual {H}ome {S}pace {B}uilder), który mógł tworzyć zarówno interaktywne światy MHSV, jak i standardowe statyczne światy VRML. W 1996 roku rozwój standardu VRML 2.0 dodał interaktywność, a ParaGraph zaktualizował VHSB, aby umożliwić tworzenie światów VRML 2.0, lecz ParaGraph zdecydował się na współpracę z Silicon Graphics i ich przeglądarką Cosmo VRML 2.0 player, dostosowując VHSB do lepszej pracy z nim, porzucając MHSV w procesie. Silicon Graphics przejęło firmę ParaGraph w 1997 roku, aby stworzyć Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Opracowane przez Microsoft w odpowiedzi na Flasha i Javę, a uruchomione w 2007 roku, Silverlight to narzędzie multimedialne, które koncentruje się na strumieniowaniu wideo, godne uwagi z tego, że jest używane przez Netflix. Późniejsze wersje dodały więcej możliwości dla innych aplikacji. Cieszył się przyzwoitą popularnością, ze wskaźnikiem przyjęcia wynoszącym 64,7% w 2011 roku. Jednak w 2012 roku, wraz z ogłoszeniem końca NPAPI, wydaniem Windows 8 i początkiem adopcji HTML5, Microsoft wycofał oprogramowanie i w 2015 roku wraz z wydaniem systemu Windows 10 wszedł w fazę End-of-Life, i został dyskontynuowany w październiku 2021 roku.",
  "Platforms_NoteWorthy_Composer_Description": "Brak opisu.",
  "Platforms_O2C_Player_Description": "Będąc częścią linii o2c (objects to see), o2c Player był w 1999 roku internetową wtyczką 3D do prezentacji obiektów i scen, opracowaną przez niemiecką firmę mb Software AG. Firma sprzedała technologię o2c firmie ELECO plc w 2003 r., która opracowała i uruchomiła w 2005 r. wersję 2.0 odtwarzacza o2c, zapewniającą znacznie lepszą wydajność dzięki akceleracji 3D i była bardziej określana jako narzędzie CAD dla architektów. Dodano obsługę większej liczby przeglądarek, ale nie wprowadzono do niej większych aktualizacji, składających się głównie z poprawek błędów. Od 2021 r. wtyczka jest nadal dostępna do pobrania, lecz Elcosoft przeniósł się na implementację technologii Unity WebGL.",
  "Platforms_Octree_View_Description": "Zaczynając jako starsza wtyczka o nazwie PicTree Viewer lub PicView, a następnie przebudowana jako nowa wtyczka Fastview przed zmianą nazwy w 1999 r., Octree View to przeglądarka obiektów 3D oparta na technologii Voxel opracowywanej od co najmniej 1980 r., która wykorzystuje specjalne kamery i skanery laserowe do tworzenia obrazów. Firma nadal korzystała ze swojej technologii i wtyczki, ale w 2007 roku jej strona internetowa przestała być aktualizowana, pozostawiając ją bez dalszej aktywności.",
  "Platforms_Pixound_Description": "Pixound był artystycznym pluginem muzycznym, uruchomionym w 1996 roku jako wspólne przedsięwzięcie Hologramophone Research i Frankfurt Balkind Partners. Działał jak klawiatura MIDI, która wykorzystywała wartości kolorów obrazów do tworzenia różnych nut i wysokości. W 2003 roku Hologramophone zmienił nazwę na Techné Media. W 2005 r. wtyczka została porzucona na rzecz samodzielnej aplikacji wyłącznie dla systemu Mac OS X. Później stał się aplikacją na iOS w 2011 roku.",
  "Platforms_Play3D_DeepV_Description": "Play3D to wtyczka 3D wydana w 1996 roku przez Heads Off, która w następnym roku została zmieniona i ponownie wydana jako DeepV. Poza garstką przykładów wtyczka nie była używana przez cały okres swojego istnienia. Witryna dewelopera przestała działać w 2001 roku.",
  "Platforms_PointPlus_Description": "PointPlus był wtyczką do osadzania prezentacji PowerPoint w Internecie, opracowanym przez Net-Scene, wydanym w maju 1996 roku dla Windows NT i 95. Pozycjonował się jako alternatywa dla bardziej złożonej Macromedia Shockwave, dla początkujących użytkowników do korzystania ze standardu PowerPointa. Do listopada opracowano przeglądarkę Java, która była kompatybilna z różnymi platformami i nie wymagała żadnych wtyczek. Została zachowana jako opcja dla wyspecjalizowanych przypadków, ale linia produktów przestała otrzymywać aktualizacje w 1997 roku. Witryna została zamknięta na początku 2001 roku.",
  "Platforms_PopCap_Plugin_Description": "Wtyczka PopCap była wtyczką do prezentowania wersji demonstracyjnych gier stworzonych przez programistę PopCap. Na początku firma wykorzystywała Javę do demonstracji gier online ze względu na jej dostępność. Później jednak rozwój został przeniesiony na wewnętrzną wtyczkę, która była dostępna jako kontrolka ActiveX i tradycyjna wtyczka do Firefoksa. Dało to PopCap korzyść posiadania własnej, zastrzeżonej platformy do dystrybucji wersji demo. Jednak jego niepełne wykorzystanie zarówno przez klientów, jak i samych PopCap doprowadziło programistę do przejścia na bardziej popularną wersję Flash do 2007 roku.",
  "Platforms_ProtoPlay_Description": "ProtoPlay to wtyczka przeznaczona do prezentacji prototypów interakcji konsumentów z produktami i symulacji ich funkcji. Wydany w 1996 roku, wykorzystywał autorski program Altia Design do tworzenia aplikacji składających się z dwuwymiarowych sprite'ów z interaktywnymi elementami. Wtyczka miała bardziej utylitarny charakter i nie była aktywnie reklamowana od końca 2003 roku, ponieważ istniała bardziej jako funkcja dostępna w razie potrzeby. Altia Design i wtyczka otrzymywały aktualizacje w celu poprawy funkcjonalności, a w 2007 roku wydano nowe narzędzie, które pozwoliło Photoshopowi tworzyć aplikacje wtyczek o nazwie PhotoProto. W 2009 roku Altia Inc. skupiła się na projektowaniu interfejsów użytkownika, pozostawiając w tyle prototypowy aspekt oprogramowania, a wraz z nim ProtoPlay.",
  "Platforms_Pulse_Player_Description": "Rozpoczynając rozwój w 1997 roku pod nazwą 3rd Degree, Pulse Player był wtyczką 3D z naciskiem na animację. Po raz pierwszy został wydany w 1999 roku dzięki finansowaniu i wsparciu kilku doświadczonych członków w dziedzinie mediów internetowych i był używany przez kilku znaczących klientów. Wtyczka była reklamowana jako zabawna i kreatywna platforma multimedialna i wydawała się odnosić sukcesy, ale na początku 2001 roku nastąpiła zmiana w tym, do czego firma chciała dążyć, zmieniając markę odtwarzacza na poważniejsze narzędzie biznesowe i edukacyjne. W 2003 r. wypuszczono ostatnią wersję 5.2, a wkrótce po tym, odcięto wsparcie.",
  "Platforms_REBOL_Plugin_Description": "REBOL to język programowania projektowany przez ponad 20 lat i wydany w 1997 roku, a w 2004 roku powstał eksperymentalny prototyp wtyczki internetowej REBOL wraz ze stroną zawierającą kilka przykładów. Wtyczka rozpoczęła się jako ActiveX tylko dla Internet Explorera, ale później w 2006 roku została wydana wersja wtyczki dla innych przeglądarek. Jednak wkrótce po tym wydano ostatnią aktualizację, pozostawiając ją w wersji beta jako niezabezpieczony prototyp.",
  "Platforms_ShiVa_Web_Player_Description": "Stworzony przez Stonetrip i nazwany Ston3D Web Player przed 2007 rokiem, ShiVa Web Player był wtyczką do treści internetowych 3D do uruchamiania oprogramowania stworzonego w silniku ShiVa 3D Engine. Pozwoliło to na tworzenie złożonych scen 3D z oświetleniem i fizyką przy niskich wymaganiach dotyczących przetwarzania. Stonetrip później zmienił nazwę w 2013 roku na ShiVa Technologies SAS i skupił się wyłącznie na silniku. Wraz z usunięciem NPAPI z większości przeglądarek, wsparcie dla wtyczki zmalało, co doprowadziło do tego, że w 2018 roku adresy URL kilku podstawowych plików uległy awarii i zepsuły większość gier, a w 2019 roku jego pobieranie zostało usunięte ze strony ShiVa.",
  "Platforms_Show_It_Description": "Show It! to wtyczka wprowadzona w 1997 roku wraz z WordPerfect Suite 8 jako jedna z funkcji programu Corel Presentations 8, konkurenta programu PowerPoint. Podczas eksportowania z opcją Internet Publisher, mogli wyeksportować prezentacje jako statyczny pokaz slajdów lub jako wbudowany projektor przy użyciu zastrzeżonego pliku, który działał tak jak oryginalna aplikacja komputerowa, zachowując wszystkie funkcje, które wymagały wtyczki. Nadal był obsługiwany w WordPerfect Office 2000 z Presentations 9, ale do 2001 roku obsługa opcji wtyczki została usunięta z Presentations 10 w WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Brak opisu.",
  "Platforms_Squeak_Etoys_Description": "Squeak był platformą open source, uruchomioną w 2001 roku, do tworzenia treści rozrywkowych i edukacyjnych. Użytkownicy mogli tworzyć małe aplikacje przeznaczone dla dzieci w różnym wieku, od najmłodszych „Etoys”, po „Omniuser” i „Expert”. Został przemianowany na Etoys w 2008 roku i przesunięty bardziej w kierunku młodszych dzieci. Etoys 5 to ostatnia wersja wtyczki, wydana w 2012 roku. Rozwój programu w wersji JavaScript rozpoczął się w 2013 roku z powodu obaw o bezpieczeństwo, pozostawiając wtyczkę porzuconą i zastąpioną nią.",
  "Platforms_Superscape_Viscape_Description": "Wprowadzony na rynek w 1996 roku przez wczesnego pioniera 3D Superscape przy wsparciu firmy Intel i pierwotnie nazywany VisNet, Viscape był wtyczką 3D, która miała wyraźną przewagę interaktywności ze światami, w przeciwieństwie do statycznych modeli VRML 1.0. Cieszył się krótkim okresem popularności i początkowo nie było planów wspierania VRML, ale wraz z implementacją interaktywności VRML97, aktualizacja o nazwie Viscape Universal została wydana w 1998 roku, dodając obsługę VRML, aby pozostała aktualna. Okazało się to niewystarczające, z problemami finansowymi i nieudanych partnerstwach, a recenzenci nazywali wtyczkę przestarzałą i nieporęczną pomimo wysiłków na rzecz odrodzenia. Chociaż ostatnia aktualizacja została wydana w 2000 roku, jej technologia była nadal wykorzystywana w serii Lego Creator firmy Superscape przez następny rok. Podjęto próbę zaktualizowania go poprzez osadzenie wtyczki w apletach Java, o nazwie Vislite, ale w końcu firma ponownie skupiła się na tworzeniu gier mobilnych i osiągnęła umiarkowany sukces, zanim została kupiona przez Glu Mobile w 2008 roku.",
  "Platforms_Surround_Video_Description": "Brak opisu.",
  "Platforms_SVF_Viewer_Description": "Brak opisu.",
  "Platforms_Tcl_Plugin_Description": "Opracowany przez mały zespół i uruchomiony w 1988 r., Tool Command Language (Tcl, wymawiane „tickle”) to dynamiczny język programowania open source. W 1994 roku firma Sun Microsystems zaangażowała zespół w dalszy rozwój technologii. Jednym z rezultatów tego przedsięwzięcia była wtyczka z 1996 roku, która mogła uruchamiać aplety Tcl („Tclets”) osadzone na stronach. Pod koniec 1997 roku rozwój Tcl został wydzielony do niezależnej firmy o nazwie Scriptics, a w 2000 roku ponownie przekształcił się w Tcl Core Team. Chociaż rozwój języka pozostaje żywy do dnia dzisiejszego, prace nad wtyczką zwolniły, mimo że nie zostały oficjalnie przerwane. Najnowsza wersja, 3.1.0, została wydana w 2006 roku.",
  "Platforms_ThingViewer_Description": "ThingViewer to wtyczka multimedialna z 1997 roku stworzona przez firmę Parable Corporation, która później zmieniła nazwę na ThingWorld w 1998 roku. Tworzyła „Things”, zasoby, które opcjonalnie można było chronić przed kradzieżą lub manipulacją i mieć unikalny identyfikator z uznaniami do udostępniania na stronach internetowych za pomocą prostego programowania modułowego, do tworzenia takich rzeczy jak obrazy, animacje, a nawet interaktywne gry, wykonane za pomocą programu do authoringu ThingMaker lub konwertowanie plików Shockwave Director za pomocą ThingConverter. Była stosunkowo popularna, w 1999 r. zawierała nawet umowy z Microsoftem i kilkoma innymi, ale pod koniec 2000 r. firma zredukowała personel i prowadziła rozmowy z nieznaną stroną w sprawie fuzji w celu sprzedaży technologii. Witryna została zamknięta w 2002 roku.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine to wieloplatformowy silnik gier, który ma na celu ułatwienie tworzenia gier i jest najpopularniejszym oprogramowaniem do tworzenia gier firmy trzeciej wśród deweloperów na całym świecie. Stworzony wraz z samym Unity i zaimplementowany w pierwszej łatce w 2005 roku, Unity Web Player był narzędziem do grania w gry Unity w sieci. Pozostała popularną platformą dla gier 3D, ale wraz z usunięciem obsługi NPAPI w 2016 r. wtyczka została porzucona na rzecz Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap to narzędzie do wizualizacji interaktywnych map osadzonych na stronie internetowej. Był kompatybilny z kilkoma plikami map z różnych programów autorskich, mógł wyświetlać szczegółowe informacje o sektorach i umożliwiał wykonywanie pomiarów. Po jego uruchomieniu w 1997 r. nie dokonano już żadnych zmian w tej technologii, pozostając niezmienioną do czasu, gdy strona przestała działać w 2004 r.",
  "Platforms_Vitalize_Description": "Stworzony w 1997 roku przez firmę Corel do wyświetlania treści stworzonych za pomocą autorskiego programu multimedialnego Click&Create, Vitalize! była wtyczką o niskiej przepustowości dedykowaną prostym grom internetowym, z naciskiem na gry, marketing i reklamę. Dystrybuowany z pomocą Europress, był dumny z tego, że jest „łatwy do nauczenia się i używania w przeciwieństwie do Javy czy Shockwave”. W 1999 roku byli pracownicy firmy Corel odeszli, aby stworzyć Clickteam, który następnie przejął rozwój w 2000 roku z wersją 2.0. Najnowsza wersja 4.0 została wydana w 2007/2008 i była dostępna na ich stronie internetowej do 2012 roku.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage jest otwartym standardem 3D i pierwszym stworzonym dla sieci. Kiedy po raz pierwszy określono go w listopadzie 1994 roku, format mógł reprezentować tylko modele statyczne bez interaktywności. Problem ten został rozwiązany w 1997 roku, kiedy opublikowano wersję 2.0, lepiej znaną jako VRML97. Pomimo tego, że nigdy nie znalazła zastosowania w głównym nurcie, stała się najpopularniejszą opcją dla internetowego 3D po wprowadzeniu na rynek, zanim została zastąpiona w 2001 roku przez X3D (który był wstecznie kompatybilny ze światami VRML). Ponieważ był to format pliku, a nie wtyczka sama w sobie, wiele różnych implementacji zostało wykonanych z VRML, często dodając własne niestandardowe funkcje.",
  "Platforms_X3D_Description": "Brak opisu.",
  "Platforms_Xara_Plugin_Description": "Wtyczka Xara była przeglądarką grafiki wektorowej, korzystającą z zastrzeżonego formatu o niskiej przepustowości. Wydana jako beta, a później pełna wersja w 1996 roku, umożliwiając przeglądanie plików Flare utworzonych za pomocą CORELXara w Internecie. Później, w 1997, Xara Webster została uruchomiona specjalnie do tworzenia grafiki internetowej dla wtyczki. W 1999 roku 2.08a była ostatnią wydaną wersją. W 2000 roku Xara Webster został zastąpiony przez XaraX, który mógł eksportować do Flasha, innej wtyczki wektorowej, więc porzucono wsparcie dla ich własnej zastrzeżonej opcji i przeniesiono ją do archiwum starszego oprogramowania.",
  "Platforms_Coming_Soon": "Dostępne wkrótce",
  "Platforms_Coming_Soon_Description": "Gry i animacje utworzone na tych platformach będą dostępne w następnej aktualizacji.",
  "Platforms_Common_Ground_Description": "Brak opisu.",
  "Platforms_DjVu_Description": "Brak opisu.",
  "Platforms_Jamagic_Description": "Brak opisu.",
  "Platforms_Jutvision_Description": "Brak opisu.",
  "Platforms_mBed_Description": "Brak opisu.",
  "Platforms_MrSID_Description": "Brak opisu.",
  "Platforms_PanoramIX_Description": "Brak opisu.",
  "Platforms_Petz_Player_Description": "Brak opisu.",
  "Platforms_Sibelius_Scorch_Description": "Brak opisu.",
  "Platforms_Sizzler_Description": "Brak opisu.",
  "Platforms_Ulead_COOL_360_Description": "Brak opisu.",
  "Platforms_VReam_WIRL_Description": "Brak opisu."
}