{
  "Discord_Title": "Discord",
  "Discord_Intro": "Veuillez lire les règles avant de rejoindre notre serveur Discord (elles peuvent aussi être consultées dans {#rules-and-faq} une fois que vous y êtes) :",
  "Discord_Rule1": "Respectez les règles de Discord et les nôtres : {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Be respectful towards others. Don't be a bigot, incite drama, act obnoxiously, mention users/roles repeatedly, or send DMs to server members (including staff) without permission.",
  "Discord_Rule3": "Gardez les sujets sur leurs canaux désignés. Lisez toujours la description si vous n'êtes pas tout à fait sûr de son utilité. Si un membre du personnel vous demande de déplacer la conversation, veuillez le faire.",
  "Discord_Rule4": "La distribution de contenu actuellement en vente ou dont la suppression de Flashpoint a été demandée n'est pas autorisée.",
  "Discord_Rule5": "{Never send emails relating to Flashpoint without the consent of staff, no matter how good you think it is.} Personne ne veut la chance de contacter un développeur aller à la poubelle, c'est pourquoi nous voulons nous assurer que cela ne se produise pas.",
  "Discord_Rule6": "La promotion de vous-même ou de parties affiliées via des invitations Discord, des liens YouTube, des entreprises lucratives ou autres est interdite, sauf dans le contexte de Flashpoint ou d'archivage numérique.",
  "Discord_Rule7": "Le contenu et les discussions NSFW doivent être conservés dans {#nsfw-lounge} (l'existence même de la chaîne devrait expliquer plus qu'assez).",
  "Discord_Rule8": "Le discours politique n'a pas sa place dans ce serveur. Parlez-en autre part ou n'en parlez pas du tout.",
  "Discord_Curation_Exception": "(Les conservations - discussion spécifique et contenu inclus - sont la seule exception aux règles 7 et 8.)",
  "Discord_Sanctions": "Team members are allowed to warn/silence/kick/ban users they feel are breaking these rules based on the severity of the rule broken. We encourage staff to show levity to first time or accidental rule breaks, but multiple broken rules will result in harsher punishments.",
  "Discord_Agreed": "J'ai lu les règles et je veux rejoindre le serveur !"
}