{
  "Downloads_Avast_Title": "ATTENTION POUR LES UTILISATEURS AVAST ET AVG :",
  "Downloads_Avast_Warning": "Un fichier requis par Flashpoint pour jouer aux jeux sera détecté comme un virus et mis en quarantaine ; c'est un faux positif ! {Suivez ces instructions} pour faire une exception pour Flashpoint. Nous faisons de notre mieux pour garder l'archive et les technologies qui l'entourent sans virus. {En savoir plus}",
  "Downloads_Title": "Téléchargements",
  "Downloads_Para1": "Tous les téléchargements Flashpoint sont portables, gratuits et {construit avec des logiciels open-source} (excluant évidemment les jeux et plateformes eux-mêmes). Une grande partie du code open-source est original au projet, que vous pouvez trouver sur notre page d'équipe GitHub {ici}.",
  "Downloads_Para2": "Pour savoir ce qui a changé depuis la nuit des temps, consultez le {journal des changements}. Attention : c'est grand.",
  "Downloads_Para3": "{Systèmes d'exploitation supportés :} Windows 7 SP1, Windows 8.1, Windows 10, Windows 11 (support expérimental pour {Mac} et {Linux} est également disponible)",
  "Downloads_Prerequisites": "{Prérequis :} {Visual C++ 2015 Redistributable},\n{Microsoft .NET Framework 4.7}\n({7-Zip} est requis pour extraire Ultimate et Core)",
  "Downloads_Content_Disclaimer_Title": "AVERTISSEMENT :",
  "Downloads_Content_Disclaimer_Warning": "En tant que musée de la culture internet, Flashpoint contient un très large éventail de contenus - dont certaines parties peuvent être illégales selon votre juridiction. Si vous n'êtes pas à l'aise avec ceci, {téléchargez Flashpoint Infinity} car cela vous permet de contrôler quel contenu est stocké sur votre appareil.",
  "Downloads_Size": "Taille",
  "Downloads_Size_Download": "télécharger",
  "Downloads_Size_Extracted": "à l'extraction",
  "Downloads_Ultimate_Line1": "La collection entière en un seul paquet géant",
  "Downloads_Ultimate_Line2": "Tous les jeux et animations sont disponibles hors ligne dès le départ - pas d'internet nécessaire",
  "Downloads_Ultimate_Line3": "Peut être mis à jour en utilisant le {Flashpoint Ultimate Updater}",
  "Downloads_Ultimate_Line4": "Fourni en tant qu'archive .7z ({qBittorrent} et {Free Download Manager} sont recommandés pour le torrent et le téléchargement direct, respectivement)",
  "Downloads_7z_Torrent": "Télécharger 7Z (Torrent)",
  "Downloads_7z_Direct": "Télécharger 7Z (Direct)",
  "Downloads_Hash_Placeholder": "(Empreintes de hachage bientôt disponibles)",
  "Downloads_Recommended": "Recommandé",
  "Downloads_Size_Grows": "la taille du fichier augmente avec utilisation",
  "Downloads_Infinity_Line1": "Un paquet léger pour les utilisateurs occasionnels",
  "Downloads_Infinity_Line2": "Les jeux et animations sont téléchargés automatiquement lorsque vous les jouez",
  "Downloads_Infinity_Line3": "Doit être retéléchargé pour appliquer les mises à jour",
  "Downloads_Infinity_Line4": "Fourni en tant qu'exécutable auto-extractible (il extraira Flashpoint dans le répertoire spécifié lors de son exécution)",
  "Downloads_Exe": "Télécharger EXE",
  "Downloads_Instructions": "Instructions",
  "Downloads_Mirror": "Miroir Archive.org (Lent)",
  "Downloads_Manual": "Référez-vous au {manuel d'aide} pour utiliser/dépanner Flashpoint !",
  "Downloads_Core": "Il y a aussi {Flashpoint Core}, une copie miniature de Flashpoint adaptée spécifiquement pour les contributeurs du projet. Il contient des exemples d'entrées pour chaque plateforme ainsi que des outils utiles pour la conservation. Vous pouvez le télécharger {ici}. Pour apprendre comment contribuer à l'archive en utilisant Flashpoint Core, lisez le {tutoriel de conservation}."
}