{
  "FAQ_Title": "Foire aux Questions",
  "FAQ_Question1": "Who/what is BlueMaxima?",
  "FAQ_Answer1": "BlueMaxima, or Ben Latimore is the Aussie who started Flashpoint and handles the master copies. No business or organization is involved with Flashpoint - it is a wholly community-run project.",
  "FAQ_Question2": "Quels systèmes d'exploitation supportez-vous ?",
  "FAQ_Answer2": "Flashpoint supports Windows 7 SP1 and newer (excluding stock Windows 8). MacOS and Linux versions are also available; however, they require extra steps to install and can only run a handful of the most popular browser technologies.",
  "FAQ_Question3": "Flashpoint pose-t-il des problèmes de sécurité ?",
  "FAQ_Answer3": "Pas de ce que l'on sache. L'intégralité de notre suite d'applications (moins la technologie de téléchargement de jeux Infinity) ne peut pas se connecter à internet ; toutes les modifications de registre effectuées par Flashpoint Secure Player sont supprimées une fois le jeu fermé; toutes les conservations entrantes passent par un PC avec un logiciel antivirus compétent et à jour ; et surtout, le lanceur et tout les rouages internes de Flashpoint sont open-source et peuvent être trouvés {here}. Nous avons fait de notre mieux pour nous assurer que la collection est aussi sûre que possible, mais malgré nos efforts, certains antivirus tels qu'Avast et AVG ont tendance à détecter des composants importants comme étant dangereux. Si vous êtes affecté par ce problème, {read this page} pour obtenir des instructions de dépannage.",
  "FAQ_Question4": "Combien de jeux/animations y a-t-il ?",
  "FAQ_Answer4": "As of Flashpoint 11, we have over 130,000 games and 20,000 animations. You can search the collection without use of the launcher {here}. Alternatively, you can view the respective lists {here} and {here}.",
  "FAQ_Question5": "What platforms does the collection offer?",
  "FAQ_Answer5": "Nous supportons les jeux et animations fonctionnant sur toutes les plateformes listées sur la page {Supported Platforms}.",
  "FAQ_Question6": "Où sont les jeux Nitrome ?",
  "FAQ_Answer6": "Nitrome nous a poliment demandé de retirer leur contenu de la collection. Si vous cherchez à jouer à leurs jeux, faites-le à leur {website}, et si Flash n'est pas une option, suivez leur {HTML5-compatible catalog} croissant. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "Comment puis-je demander un(e) jeu/animation ?",
  "FAQ_Answer7": "Vous pouvez faire une demande en lisant d'abord {this article} jusqu'au bout, puis en suivant les liens en bas.",
  "FAQ_Question8": "Puis-je ajouter un(e) jeu/animation moi-même ?",
  "FAQ_Answer8": "Yes. Follow the instructions listed in the {curation tutorial} to set up your curator audition. Once it's accepted, you can submit as many more curations as you desire.",
  "FAQ_Question9": "Je veux contribuer d'une autre manière (codage, tests, etc). Comment puis-je aider ?",
  "FAQ_Answer9": "Rejoignez notre {Discord server} pour plus de détails. La majorité de notre travail et communication se passe là-bas.",
  "FAQ_Question10": "Est-ce que Flashpoint est open source ?",
  "FAQ_Answer10": "Yes...ish. The sources for our custom-made tech such as the launcher are all available at our {GitHub}. The sources for the software we include in Flashpoint are available from their respective websites (we don't modify the source of any of the software we include). The binaries for the web plugins themselves aren't open source, but if they were, we wouldn't be here to begin with.",
  "FAQ_Question11": "Puis-je utiliser le logo/Est-il disponible sous Creative Commons ?",
  "FAQ_Answer11": "Oui - le logo est sous licence {CC-BY 4.0}. Pour l'attribution, vous pouvez éventuellement créditer Seirade et Flashpoint de BlueMaxima. Les fichiers source peuvent être trouvés {here}.",
  "FAQ_Question12": "Où puis-je faire un don au projet ?",
  "FAQ_Answer12": "Out of respect for the artists and developers whose works can be found in Flashpoint, we try to avoid soliciting donations. While we previously ran {a fundraiser} to cover server costs, we have no plans to launch another one in the future.",
  "FAQ_Question13": "Flashpoint ne fonctionne pas correctement !",
  "FAQ_Answer13": "Suivez les étapes de dépannage listées dans le {manual}. Si vous rencontrez encore des problèmes par la suite, demandez de l'aide sur notre Discord.",
  "FAQ_Question14": "Je veux un(e) jeu/animation retiré(e) de Flashpoint pour une raison ou une autre.",
  "FAQ_Answer14": "Alertez-nous, soit via notre Discord ou {directly by email}. Nous essaierons probablement de vous convaincre de nous laisser garder votre jeu pour des raisons historiques, mais nous ne sommes pas déraisonnables.",
  "FAQ_Question15": "J’ai une autre question.",
  "FAQ_Answer15": "Consultez notre {extended FAQ}. Si vous n'avez toujours pas réponse à votre question, rejoignez notre Discord."
}