{
  "FAQ_Title": "Foire aux Questions",
  "FAQ_Question1": "Qui est BlueMaxima ?",
  "FAQ_Answer1": "BlueMaxima ou Ben Latimore, est l'australien qui a commencé Flashpoint et qui s'occupe des copies maîtres. Aucune entreprise ou organisation n'est impliquée dans Flashpoint - c'est un projet entièrement géré par la communauté.",
  "FAQ_Question2": "Quels systèmes d'exploitation supportez-vous ?",
  "FAQ_Answer2": "Flashpoint supporte Windows 7 SP1 et plus récent (à l'exception de Windows 8 stock). Les versions Mac et Linux sont constamment en flux en raison du changement de technologie continu dans la version Windows et du manque de mainteneurs dédiés ; pour obtenir les informations les plus à jour, veuillez demander sur le Discord.",
  "FAQ_Question3": "Flashpoint pose-t-il des problèmes de sécurité ?",
  "FAQ_Answer3": "Pas de ce que l'on sache. L'intégralité de notre suite d'applications (moins la technologie de téléchargement de jeux Infinity) ne peut pas se connecter à internet ; toutes les modifications de registre effectuées par Flashpoint Secure Player sont supprimées une fois le jeu fermé; toutes les conservations entrantes passent par un PC avec un logiciel antivirus compétent et à jour ; et surtout, le lanceur et tout les rouages internes de Flashpoint sont open-source et peuvent être trouvés {ici}. Nous avons fait de notre mieux pour nous assurer que la collection est aussi sûre que possible, mais malgré nos efforts, certains antivirus tels qu'Avast et AVG ont tendance à détecter des composants importants comme étant dangereux. Si vous êtes affecté par ce problème, {lire cette page} pour obtenir des instructions de dépannage.",
  "FAQ_Question4": "Combien de jeux/animations y a-t-il ?",
  "FAQ_Answer4": "Dans Flashpoint 10.1, nous avons plus de 100 000 jeux et 10 000 animations. Vous pouvez rechercher dans la collection sans utiliser le lanceur {ici}. Vous pouvez également consulter les listes respectives {ici} et {ici}.",
  "FAQ_Question5": "Quelles plateformes la collection supporte ?",
  "FAQ_Answer5": "Nous supportons les jeux et animations fonctionnant sur toutes les plateformes listées sur la page {Plateformes supportées}.",
  "FAQ_Question6": "Où sont les jeux Nitrome ?",
  "FAQ_Answer6": "Nitrome nous a poliment demandé de retirer leur contenu de la collection. Si vous cherchez à jouer à leurs jeux, faites-le à leur {site web}, et si Flash n'est pas une option, suivez leur {catalogue compatible HTML5} croissant. {Flashpoint ne tolère pas le harcèlement lié à la décision de Nitrome.}",
  "FAQ_Question7": "Comment puis-je demander un(e) jeu/animation ?",
  "FAQ_Answer7": "Vous pouvez faire une demande en lisant d'abord {cet article} jusqu'au bout, puis en suivant les liens en bas.",
  "FAQ_Question8": "Puis-je ajouter un(e) jeu/animation moi-même ?",
  "FAQ_Answer8": "Oui. Suivez les instructions listées dans le {tutoriel de conservation} pour créer votre audition de conservateur. Une fois acceptée, vous pouvez soumettre autant de conservations que vous le souhaitez.",
  "FAQ_Question9": "Je veux contribuer d'une autre manière (codage, tests, etc). Comment puis-je aider ?",
  "FAQ_Answer9": "Rejoignez notre {serveur Discord} pour plus de détails. La majorité de notre travail et communication se passe là-bas.",
  "FAQ_Question10": "Est-ce que Flashpoint est open source ?",
  "FAQ_Answer10": "Oui... en quelque sorte. Les sources de nos technologies personnalisées tel que le lanceur sont toutes disponibles sur notre {GitHub}. Les sources des logiciels que nous incluons dans Flashpoint sont disponibles à partir de leurs sites web respectifs (nous ne modifions pas la source des logiciels que nous incluons). Les binaries pour les plugins web eux-mêmes ne sont pas open source, mais si c'était le cas, nous ne serions pas là pour commencer.",
  "FAQ_Question11": "Puis-je utiliser le logo/Est-il disponible sous Creative Commons ?",
  "FAQ_Answer11": "Oui - le logo est sous licence {CC-BY 4.0}. Pour l'attribution, vous pouvez éventuellement créditer Seirade et Flashpoint de BlueMaxima. Les fichiers source peuvent être trouvés {ici}.",
  "FAQ_Question12": "Où puis-je faire un don au projet ?",
  "FAQ_Answer12": "Par respect pour les artistes et les développeurs dont les travaux peuvent être trouvés dans Flashpoint, nous essayons d'éviter de solliciter des dons. Si nous avons bien organisé {une collecte de fonds} pour couvrir les coûts du serveur, nous n'avons pas l'intention d'en lancer une autre à l'avenir.",
  "FAQ_Question13": "Flashpoint ne fonctionne pas correctement !",
  "FAQ_Answer13": "Suivez les étapes de dépannage listées dans le {manuel}. Si vous rencontrez encore des problèmes par la suite, demandez de l'aide sur notre Discord.",
  "FAQ_Question14": "Je veux un(e) jeu/animation retiré(e) de Flashpoint pour une raison ou une autre.",
  "FAQ_Answer14": "Alertez-nous, soit via notre Discord ou {directement par e-mail}. Nous essaierons probablement de vous convaincre de nous laisser garder votre jeu pour des raisons historiques, mais nous ne sommes pas déraisonnables.",
  "FAQ_Question15": "J’ai une autre question.",
  "FAQ_Answer15": "Consultez notre {FAQ étendue}. Si vous n'avez toujours pas réponse à votre question, rejoignez notre Discord."
}