{
  "About_Welcome": "Bienvenue",
  "About_Title": "Flashpoint de BlueMaxima est un projet de préservation de jeux web.",
  "About_Para1": "L'histoire et la culture d'internet sont importantes, et le contenu créé sur les plateformes web, y compris mais pas limité à Adobe Flash, constitue une part importante de cette culture. Ce projet est dédié à préserver autant d'expériences que possible de ces plateformes, afin qu'elles ne soient pas perdues avec le temps. Depuis début 2018, Flashpoint a sauvé plus de 100 000 jeux et 10 000 animations sur 35 plateformes différentes.",
  "About_Para2": "Flashpoint a été commencé en Janvier 2018 par BlueMaxima dans une tentative de devancer la disparition de contenu avant la mort de Flash. Ceci a depuis évolué en un projet international impliquant plus de 100 contributeurs communautaires, englobant à la fois les jeux web et les animations créées pour de nombreux plugins, frameworks et standards internet.",
  "About_Para3": "Flashpoint utilise une grande sélection de logiciels open-source. En combinant la puissance d'Apache, un lanceur personalisé et notre propre application appelée Flashpoint Secure Player, nous pouvons lire des médias web dans un environnement rapide et convivial sans laisser de changements permanents ou de trous de sécurité sur votre ordinateur.",
  "About_Para4": "Nous proposons deux versions du logiciel ; Ultimate, qui contient tous les médias en un format hors ligne, et Infinity, une distribution plus petite qui vous permet de télécharger et de lire le contenu à volonté. Les deux versions ne sont pas affectées par la fin du support de Flash et d'autres plugins.",
  "About_Para5": "Ce projet est et sera toujours à but non lucratif, afin de préserver le sens de la communauté et de partage qui sont venu avec Flash et ces semblables. Pour en savoir plus sur Flashpoint, référez-vous à la barre latérale à gauche de la page.",
  "Search_Collection": "Rechercher dans la collection",
  "Request_Archival": "Demander du contenu pour archivage"
}