{
  "News_Title": "Actualités",
  "News_Description": "Tous les événements notables dans l'histoire de Flashpoint à partir d'octobre 2019.",
  "News_Flashpoint_Started": "Flashpoint de BlueMaxima a été lancé.",
  "News_Flashpoint_0": "Flashpoint Zero est sorti.",
  "News_Flashpoint_1": "Flashpoint Version One est sorti.",
  "News_Was_Released": "est sorti",
  "News_Flashpoint_3_0": "Keys to the Kingdom",
  "News_Flashpoint_3_0_Meta": "Cette version introduit le Redirecteur, qui était la dernière pièce du puzzle pour faire fonctionner la configuration du serveur - nous permettant de préserver 99.9% de jeux Flash sans piratage. Les clés du royaume de la préservation Flash, si vous le souhaitez.",
  "News_Flashpoint_3_1": "Opening Night",
  "News_Flashpoint_3_1_Meta": "Cette version a été la première à avoir Flashpoint Théatre (bien que ce soit une instance séparée de LaunchBox à l'époque).",
  "News_Flashpoint_3_2": "Shock and Awe",
  "News_Flashpoint_3_2_Meta": "Cette version a été la première à supporter les titres Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Nommée d'après le fait que nous avions passé 4000 jeux dans la collection à ce stade. Comme le temps passe...",
  "News_Flashpoint_4_0": "The Living Infinite",
  "News_Flashpoint_4_0_Meta": "Cette version introduit Flashpoint Infinity, qui permet aux gens de diffuser des jeux depuis l'Internet, le nom est tiré de l'album de 2013 de Soilwork du même nom.",
  "News_Flashpoint_4_1": "Javality",
  "News_Flashpoint_4_1_Meta": "C'est la version qui a introduit le support des applets Java. Le nom vient de DarkMoe.",
  "News_Flashpoint_5_0": "Go For Launch",
  "News_Flashpoint_5_0_Meta": "Le Lanceur que nous connaissons et aimons tous a été introduit dans cette version.",
  "News_Flashpoint_5_1": "The Great Filter",
  "News_Flashpoint_5_1_Meta": "Les playlists ont été ajoutées ici (un filtre, si vous voulez). Le nom est tiré de l'EP The Great Filter de Mesarthim.",
  "News_Flashpoint_5_2": "Type III",
  "News_Flashpoint_5_2_Meta": "The Great Filter et Type III sont deux EPs de Mesarthim qui sont souvent ensemble. Aucun autre nom n'est venu quand nous en avions besoin.",
  "News_Flashpoint_5_3": "Revolution",
  "News_Flashpoint_5_3_Meta": "Cette version a été publiée à l'approche de l'anniversaire d'un an de Flashpoint, et nous avons senti que c'était vraiment une révolution. (Il allait également être appelé à l'origine 'Orbit', mais c'était un nom stupide pour le concept.)",
  "News_Flashpoint_5_4": "Recombination",
  "News_Flashpoint_5_4_Meta": "Cette version a déplacé les animations avec les jeux, qui étaient auparavant dans des dossiers séparés avec des clients séparés. 'Recombination' et '74%' ont également été le nom de deux titres dans l'album de Mesarthim The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Un ensemble rapide de patchs fait en même temps que le temps de téléversement de la version 5.4. Ce n'était pas comme si Flashpoint 5.4 était seulement 74% achevé quand nous l'avons sorti.",
  "News_Flashpoint_5_5": "Iron & Copper",
  "News_Flashpoint_5_5_Meta": "BlueMaxima jouait un peu trop à Deus Ex à l'époque.",
  "News_Flashpoint_6_0": "Alignment",
  "News_Flashpoint_6_0_Meta": "Une autre référence de Mesarthim !",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "Un jeu sur les mots de termes logiciels couramment utilisés en informatique, tels que \"freeware\" et \"shareware\".",
  "News_Flashpoint_6_2": "Moe's Great Escape",
  "News_Flashpoint_6_2_Meta": "Le membre du personnel DarkMoe a conservé une quantité invraisemblable de jeux d'évasion dans cette version.",
  "News_Flashpoint_6_3": "Nous parlons de jeux Flash, pas de philosophie abstraite",
  "News_Flashpoint_6_3_Meta": "Nommé d'après une ligne hors de la main de nosamu, un membre du personnel.",
  "News_Old_Releases_Title": "Chronologie rétroactive des versions",
  "News_Old_Releases_Description": "Puisqu'une colonne pour les actualités n'existe que depuis décembre 2019, la majorité des publications jusqu'à ce jour n'ont pas été cataloguées. Cette section compte pour les versions manquantes.",
  "News_Is_Available": "est maintenant disponible !",
  "News_Grab_Download": "Obtenez-le via la {downloads page}",
  "News_Flashpoint_Update_October_2019": "La mise à jour du statut Flashpoint pour Octobre 2019 est maintenant disponible sur Medium. Consultez la {ici}.",
  "News_Flashpoint_Update_November_2019": "La mise à jour du statut Flashpoint pour Novembre 2019 est maintenant disponible sur Medium. Consultez la {ici}.",
  "News_Flashpoint_7_0": "Eight Thousand Hours",
  "News_Flashpoint_7_0_Meta": "Huit mille heures étaient à peu près la durée de vie de Flash restante au moment de la sortie.",
  "News_Flashpoint_7_1": "Stay on Target",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0, selon nos standards, était un désordre complet. 7.1 était une grosse version corrective.",
  "News_Featured_Kotaku_Link": "Nous avons été mis en vedette sur Kotaku !",
  "News_Featured_Kotaku_Rest": "C'est une étape majeure. Merci à tous pour votre soutien !",
  "News_Flashpoint_Update_March_2020": "La mise à jour du statut Flashpoint pour Mars 2020 est maintenant disponible sur Medium. Consultez la {ici}.",
  "News_Flashpoint_Update_April_2020": "La mise à jour du statut Flashpoint pour Avril 2020 est maintenant disponible sur Medium. Consultez la {ici}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Cette version a vu la fin du logiciel Redirecteur, précédemment utilisé pour faire fonctionner le serveur. Le code HTTP 301 est 'déplacé de manière permanente', c'est-à-dire qu'il ne redirige plus.",
  "News_Flashpoint_Update_June_2020": "La mini mise à jour du statut de Flashpoint pour Juin 2020 est maintenant disponible sur Medium. Consultez la {ici}.",
  "News_Flashpoint_8_1": "Spirit of Adventure",
  "News_Flashpoint_8_1_Meta": "Nommé d'après une ligne du tout récent album d'Aether Realm, Redneck Vikings from Hell. Pour être plus précis, le titre \"One Hollow Word\".",
  "News_Flashpoint_Update_August_2020": "La mise à jour du statut Flashpoint pour Août 2020 est maintenant disponible sur Medium. Consultez la {ici}.",
  "News_Flashpoint_8_2": "Approaching Planet Nine",
  "News_Flashpoint_8_2_Meta": "Un portmanteau (étiré, je vous l'accorde) de \"approaching version nine\" et Planet Nine, l'EP de Mesarthim.",
  "News_Flashpoint_9_0": "Glorious Sunset",
  "News_Flashpoint_9_0_Meta": "Nommée après Glorious Morning, la chanson très connue dans Age of War. Il s'agit de la dernière version à sortir avant la mort de Flash, d'où 'coucher de soleil'.",
  "News_Flashpoint_Update_April_2021": "La mise à jour du statut Flashpoint pour avril 2021 a été publiée aujourd'hui. Consultez la {ici}.",
  "News_Flashpoint_10_0": "Absence",
  "News_Flashpoint_10_0_Meta": "Il s'agit de la première version sortie sur un internet post-Flash, d'où le nom \"Absence\". C'est également le nom de la dernière piste sur l'EP \"Vacuum Solution\" de Mesarthim.",
  "News_Flashpoint_10_1": "Absence II",
  "News_Flashpoint_10_1_Meta": "Devinez.",
  "News_Flashpoint_11": "Oops, All Plugins!",
  "News_Flashpoint_11_Meta": "C'est un mème, car 11 a ajouté trois douzaines de nouveaux plugins.",
  "News_Flashpoint_11_1": "Operation Cherry Blossom",
  "News_Flashpoint_11_1_Meta": "Une référence au jeu Muv-Luv (allez l'acheter sur Steam)."
}