{
  "Platforms_Title": "Plateformes supportées",
  "Platforms_Description1": "Flashpoint supporte des jeux et animations créés par une variété de plugins et de standards web - pas seulement Flash. Cette page contient un aperçu de chaque technologie, à côté de leur nombre d'entrées dans la version 10.1.",
  "Platforms_Description2": "Ceci sert de résumé \"Qui ? Quoi ? Quand ?\" et point de départ pour de nouvelles recherches, ce n'est pas un historique complet de chaque plateforme. Nous faisons de notre mieux pour présenter des faits exacts, mais des erreurs sont toujours possibles. Veuillez nous contacter s'il vous plait pour corriger.",
  "Platforms_By": "par",
  "Platforms_3D_Groove_GX_Description": "Fondée en 1998, The Groove Alliance était le développeur de 3D Groove SX, un moteur de jeu 3D compatible avec Shockwave. Plus tard, en 2002, le moteur s'est détaché de Shockwave pour devenir son propre moteur, appelé 3D Groove GX. Les deux variantes pouvaient être utilisées pour le développement de jeux en ligne et d'applications de bureau. Ce fut un succès pour l'entreprise, qui s'est constitué une large base d'utilisateurs professionnels et a créé plusieurs titres prestigieux pour des émissions télévisées et d'autres propriétés importantes. Une fois le succès retombé, The Groove Alliance a été transformée en OTOY en 2008, mais le site web 3D Groove est resté en ligne jusqu'en 2009. La cause exacte de la disparition de l'entreprise originale n'est pas connue, mais des luttes internes ont été confirmées.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (anciennement 3D Life Player, Virtools Player, et NeMo Web Player, à ne pas confondre avec 3DVIA Studio/Beta Player ou 3DVIA Composer Player) était un plugin de navigateur de Dassault Systèmes pour la lecture d'expériences 3D réalisées dans Virtools. Il était destiné aux applications pratiques et avancées de la 3D, telles que la formation assistée par ordinateur, les visites virtuelles et l'immobilier. 3DVIA Player a également été utilisé pour les jeux en ligne, avec parmi ses principaux utilisateurs le studio de jeux québécois Sarbakan et Little Chicken Game Company, basé à Amsterdam. La dernière mise à jour, la version 5.0, est sortie en 2009. La page de téléchargement est restée en ligne pendant les années suivantes, jusqu'à ce qu'elle soit retirée en 2016. À cette date, le jeu avait été installé plus de 30 millions de fois.",
  "Platforms_AboutPeople_Description": "Pas encore de description.",
  "Platforms_AboutTime_Description": "Pas encore de description.",
  "Platforms_ActiveX_Controls_Description": "Lancé en 1996 par Microsoft, ActiveX est un cadre logiciel qui sert de norme permettant d'encapsuler des programmes en tant que conteneurs à utiliser dans d'autres programmes non liés, appelés contrôles ActiveX. Ils pouvaient être intégrés dans du contenu HTML, et des contrôles à usage unique pouvaient être créés spécifiquement pour être utilisés dans Internet Explorer, dans le but de lire des jeux Web. Après le lancement de Edge en 2015, le logiciel a été déprécié, et son utilisation pour les applications web a apparemment cessé, étant reléguée à Internet Explorer 11 pour la prise en charge des logiciels hérités.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Lancé en 1996 sous le nom de V3O par Rocket Science Games, puis transféré à Attitude Software sous le nom de 3D Anarchy, vendu à Adobe en 2000 et rebaptisé en 2001, Atmosphere Player est un plugin Web conçu pour afficher des mondes 3D interactifs, similaires à la norme VRML, créés dans Atmosphere Builder. Il était principalement destiné aux galeries virtuelles de médias, qui pouvaient présenter des images/audio/vidéo et les modèles 3D eux-mêmes. À ses débuts, sous le nom de 3D Anarchy, le logiciel était encore en version bêta lorsque Adobe a acquis la technologie pour la développer davantage, où il a passé les 3 années suivantes en test bêta, et la dernière version 1.0 du lecteur a été publiée en février 2004. En décembre 2004, il a été annoncé qu'Atmosphere serait abandonné, le support étant interrompu en janvier 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (également appelé Flash, anciennement Macromedia Shockwave Flash Player) est un lecteur d'animations et de graphiques vectoriels, souvent avec une interactivité supplémentaire. Il a été utilisé comme support pour les jeux web en raison de sa compression efficace, de son faible prix, de sa facilité d'utilisation et de sa large base d'installation. Développé en 1995 et présenté pour la première fois par FutureWave en 1996, il ne permettait guère plus que des animations de base et des boutons pour les contrôler. À mesure qu'il gagnait en popularité, des fonctions plus avancées ont été ajoutées au lecteur, comme le langage de programmation ActionScript. Cependant, alors que les gens se méfiaient de ses problèmes de sécurité potentiels et que le HTML5 gagnait en popularité parmi les développeurs web, Adobe a annoncé la fin de vie de Flash pour le 31 décembre 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (également appelé Shockwave, anciennement Macromedia Shockwave Player ou Shockwave Director Player) est un lecteur de médias interactifs lancé en 1995. Basé sur une technologie développée 10 ans auparavant par MacroMind, il n'est devenu un plugin web qu'après son acquisition par Macromedia. Contrairement à Flash, Shockwave est doté du langage de script Lingo et du support C++ grâce à l'utilisation de Xtras, ce qui donne au lecteur un large éventail de capacités, y compris la 3D. Il a été largement utilisé sur les débuts de l'Internet et sur les jeux sur CD-ROM, et a gagné en popularité. La plateforme a connu une baisse de popularité significative après l'acquisition de Macromedia par Adobe, au profit de Flash, dont les fonctionnalités se développaient rapidement et qui était désormais également détenu par Adobe. Finalement, en février 2019, Adobe a annoncé son abandon et a coupé le support deux mois plus tard.",
  "Platforms_Alambik_Plugin_Description": "Le plugin Alambik est un lecteur web pour le contenu fait avec Alambik, une plateforme de développement. Sorti en 2001, il était capable de graphiques 2D et 3D, de vecteurs et de nombreuses autres applications. En 2002, Alambik a organisé un concours avec des prix pour célébrer la sortie de Alambik Script. En 2004, Alambik a créé un nouveau site web de démos, mais après cela la société est devenue silencieuse et n'a jamais sorti quoi que ce soit de nouveau pour la plateforme ou mis à jour le plugin.",
  "Platforms_Ambulant_Description": "Ambulant est un lecteur de fichiers SMIL, créé par de nombreuses personnes qui se coordonnent au CWI à Amsterdam, aux Pays-Bas. Le nom semble faire référence à \"ambulation\", un autre mot pour marcher, ce qui est confirmé par le logo représentant une personne en train de marcher. SMIL était une spécification élaborée par le W3C, le consortium international du web, mais n'a pas réussi à gagner beaucoup de popularité. Ambulant a tenté d'être un lecteur open source qui prend en charge tous les fichiers SMIL. Cependant, le désir de rendre toutes les parties open source a empêché la prise en charge de certains formats de médias propriétaires. Le développement a commencé en avril 2003 et la première version, \"AMBULANT/G\", a été publiée en juillet de la même année. La dernière version stable, 2.6, a été publiée en février 2015, mais le travail sur une version instable d'Ambulant 2.7 s'est poursuivi jusqu'en juillet 2016, date à laquelle le dernier commit a été fait sur leur repo Github. Les développeurs d'Ambulant sont toujours actifs sur d'autres projets.",
  "Platforms_AnimaFlex_Description": "AnimaFlex était un plugin de lecture graphique capable de lire des animations de petite taille, réalisées avec RubberWeb Composer, qui pouvaient étirer et déformer les images. Il pouvait commencer à lire les animations avant que le fichier entier ne soit téléchargé et s'adapter à des vitesses Internet plus lentes. Malgré ses promesses, RubberFlex disposait de plusieurs autres produits, exportant tous des gifs, concurrençant leur option propriétaire, et a même lancé FlexToGif pour convertir les fichiers du plugin en gifs 2 jours après le plugin. Au début de 1998, RubberWeb Composer a cessé d'être distribué, laissant AnimaFlex sans programme de création.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics est un programme de présentation créé en 1986 par Software Publishing Corporation (SPC) pour les PC MS-DOS. Après le passage à Windows en 1991, il n'a pas réussi à regagner la part de marché qu'il avait perdue au profit de PowerPoint. En 1996, Allegro New Media (rebaptisé Vizacom plus tard dans l'année) a racheté SPC et Serif. SPC a créé ASAP WordPower, un programme permettant de créer facilement des diaporamas, qui peuvent être publiés sur le web à l'aide du plugin ASAP WebShow. SPC a fusionné avec Serif en 1997. En 1998, la marque Harvard a été revitalisée avec le programme de création Harvard Graphics 98, et le plugin a été remplacé par un nouveau programme appelé Harvard Graphics WebShow. En 2000, Advanced Presentations, la nouvelle version du logiciel auteur, exporte vers le standard Flash au lieu du format propriétaire du plugin. En 2001, Vizacom a revendu Serif à sa direction initiale, ce qui a relégué la gamme Harvard au rang de logiciel hérité, pris en charge et vendu jusqu'à son abandon en 2017.",
  "Platforms_Authorware_Web_Player_Description": "L'Authorware Web Player a été créé par Macromedia en 1996 comme l'une des nouvelles fonctionnalités d'Authorware 3.5. Il a été conçu comme un moyen d'exécuter des programmes interactifs développés avec Macromedia Authorware sur le Web. Contrairement à la plupart des plugins Web, l'objectif principal d'Authorware était de faciliter l'apprentissage en ligne, ce qui a conduit à son utilisation dans les entreprises et dans le domaine universitaire comme moyen d'assembler du matériel d'apprentissage multimédia sans avoir besoin d'expérience en programmation. La version finale du plugin a été publiée en 2004, avant l'acquisition de Macromedia par Adobe en 2005, après quoi le développement s'est arrêté jusqu'à l'annonce de son abandon en 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Pas encore de description.",
  "Platforms_AXEL_Player_Description": "AXEL Player était un plugin de contenu 3D interactif créé par MindAvenue en 2002. Il permettait d'afficher des modèles et des animations sur le programme de création web AXELedge et sur AXELpublisher, qui convertissait des fichiers provenant d'autres logiciels 3D tels que 3ds Max. Le logiciel a été bien accueilli par les critiques, malgré quelques limitations, l'une d'entre elles étant le manque d'utilisateurs pour le plugin. En 2005, MindAvenue a été rachetée par 20-20 Technologies, spécialisée dans les logiciels de design d'intérieur et de développement de meubles. En 2006, le site web de MindAvenue est devenu une page dirigée vers 20-20. Tous les produits de la marque AXEL, y compris le plugin, ont été abandonnés.",
  "Platforms_BitPlayer_Description": "BitPlayer était une application de bureau basée sur les technologies Flash et Shockwave, créée en 1999 par la société néerlandaise BitMagic. Elle proposait des courts métrages quotidiens, produits en interne et par des clients, qui étaient accompagnés de publicités et de quiz. Initialement évaluée à 6 millions de dollars, elle a été victime de l'effondrement des dot-com à la suite de ses annonceurs et a cessé sa production en janvier 2001. Une grande partie de son contenu a depuis survécu sous forme de fichiers SWF convertis, malgré la perte de la fonctionnalité supplémentaire qu'offrait le lecteur personnalisé.",
  "Platforms_Blender_Description": "Blender est un logiciel 3D créé en 1994 par le studio d'animation néerlandais NeoGeo. Sa première version est sortie en 1995. La société a été dissoute en 1998, mais le copropriétaire Ton Roosendaal a créé Not a Number Technologies (NaN) pour poursuivre le développement de Blender. La version 2.0, également connue sous le nom de GameBlender, est sortie en 2000 et s'est orientée vers l'interactivité et le développement de jeux. C'est pourquoi un plugin pour navigateur a été lancé en 2001, d'abord sous la forme d'une version bêta ouverte, puis d'une seconde version bêta en janvier 2002. Malgré un succès rapide, NaN a connu des difficultés financières et a fermé ses portes au début de l'année 2002. Roosendaal a alors décidé de rendre Blender open source et a réussi après un crowdfunding à racheter les parts des investisseurs. Des tentatives ont été faites pour poursuivre le développement du plugin, mais le passage à l'open source a entraîné l'absence de composants pour le moteur de jeu ; sa restauration était la priorité absolue et le plugin a été mis en attente. La dernière version est restée disponible pendant quelques années - en indiquant qu'il n'y avait pas de support pour elle ou de plans pour une nouvelle version à l'époque - avant d'être supprimée en 2005.",
  "Platforms_Burster_Description": "Burster était une implémentation 2010 du moteur de jeu Blender de 2000. Le projet était une tentative de relance d'un plugin officiel lancé avec Blender, qui avait été abandonné pour des raisons de sécurité. Il a amélioré l'original, en tirant parti des nouvelles versions du moteur pour de meilleures performances et de meilleurs graphismes. La dernière version a été lancée en 2013, et après 3 ans sans mise à jour, Burster a été officiellement abandonné en 2016. Le moteur de jeu lui-même a été retiré de Blender en 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin est un outil de productivité créé par Logic Pulse en 1996. Il s'agissait d'une nouvelle fonctionnalité ajoutée à la version 3.2 de Calendar Quick, une application de bureau de calendrier et de planification. Il permettait aux utilisateurs de les publier à l'aide de la fonction d'exportation dans des pages Internet qui pouvaient être liées à d'autres personnes et visualisées avec le plugin. Après avoir corrigé un bogue de l'an 2000 en 1999, le site Web a été laissé à l'abandon, sans autre mise à jour, et a disparu en 2001.",
  "Platforms_Cult3D_Description": "Cult3D était une visionneuse web pour le contenu 3D réalisé à l'aide du programme de création Cult3D Designer. Il a connu un succès modéré, avec 6 millions d'utilisateurs en 2001 et plusieurs clients notables qui l'utilisaient, et des options d'importation de modèles 3D provenant d'autres programmes ont été ajoutées. La version 5.3 a été la dernière à être publiée en 2002, la dernière mise à jour du plugin datant de 2004, lorsque la technologie a été vendue à Mental Images GmbH. Nvidia a ensuite racheté Mental Images en 2007, devenant ainsi la filiale Nvidia Advanced Rendering Center. Malgré la mise à jour du site Web, le plugin n'a reçu aucune mise à jour et, à partir de 2011, il a cessé d'être présenté comme une option viable, et la page de téléchargement a été maintenue grâce aux utilisateurs qui disposaient encore d'une licence d'auteur, avant d'être retirée en 2013.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion est une gamme de programmes de RA (réalité augmentée) dont le développement a débuté en 1999 par Total Immersion et qui utilisait des caméras vidéo pour afficher des objets 3D en temps réel. L'un de ces programmes était D'Fusion @Home, sorti en 2008, avec un plugin plus tard en 2009. Les applications étaient créées à l'aide du programme de création, D'Fusion Studio, et l'accent était mis sur le marketing et les expériences courtes. En 2011, la technologie a eu du mal à être largement adoptée. Même avec une mise en œuvre plus accessible de Flash et la gratuité du logiciel auteur, son adoption restait très limitée. Suite à l'essor des smartphones, TryLive a été développé comme une autre solution basée sur la RA pour prévisualiser facilement des produits tels que des meubles et des lunettes, qui a connu le succès contrairement à la ligne D'Fusion qui n'a plus reçu de mises à jour après 2013. En 2015, la société a été vendue à ACEP, une entreprise de lunettes.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Pas encore de description.",
  "Platforms_DPGraph_Description": "Créé en 1999 par David Parker, DPGraph (Dynamic Photorealistic Graphing) est un programme exécutable dédié à l'affichage de graphiques à partir de pages web. Ils peuvent s'animer et afficher jusqu'à 8 dimensions, avec contrôle des variables. Il fonctionne en téléchargeant un fichier dans une page web qui indique au navigateur d'exécuter le programme et de rendre les graphiques. Une version complète a été concédée sous licence à plusieurs établissements d'enseignement pour une utilisation en classe et en étude afin de créer des graphiques, ainsi qu'un lecteur gratuit pour les visualiser. La dernière mise à jour date de 2016, et en 2019, la version complète de DPGraph est devenue libre d'utilisation pour tous.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-animator a été un plugin d'animation publié par Sharp en 2001. Conçu avec des appareils mobiles tels que des téléphones et des PDA à l'esprit, il a sorti pour certains modèles de téléphone exclusivement au Japon ainsi qu'un plugin de navigation. Il était fier de sa petite taille de fichier et de ses graphismes vectoriels qui s'adaptent à n'importe quel écran mobile. La technologie a été diffusée au public américain en 2002 sous le nom de SharpMotionART. Aucun des deux n'a duré longtemps, e-animator a publié sa dernière mise à jour en 2003 et SharpMotionART a été discontinuée en 2004.",
  "Platforms_Envoy_Description": "Envoy était un format de document développé en 1993 par Tumbleweed Software, créé en les imprimant virtuellement dans WordPerfect. Il s'agissait d'un concurrent d'Adobe Acrobat et de son format PDF. WordPerfect Corporation a été vendu à Novell en 1994, ce qui a inclus Envoy, mais Tumbleweed a continué à travailler avec Novell, créant un plugin web en 1995 pour visualiser les fichiers en ligne. Novell a vendu WordPerfect à Corel en 1996, mais a conservé la propriété d'Envoy. En 1999, Novell a cessé de développer Envoy, et Corel a abandonné la prise en charge d'Envoy dans WordPerfect 2000. Cela a mis fin à la collaboration entre Tumbleweed et Novell après l'acquisition d'Envoy en 1994, et le support du plugin a été abandonné.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) est un plugin d'animation léger développé par Sharp en 1997. Il possédait plusieurs versions du logiciel de création regroupées avec des ordinateurs Sharp et pour différentes démographies, la principale étant « EVA Animator ». Un site web « EVA Animator Kids Kids » plus convivial pour les enfants, avec un site web « エバキッズクラブ (EVA Kids Club) » a été lancé en 2000. Celles-ci ont été arrêtées en 2007 et remplacées par un niveau intermédiaire « EVA Animator School II ». La dernière mise à jour majeure du plugin a été effectuée en 2002 avec une correction mineure en 2008, mais malgré cela, il a maintenu une petite communauté d'utilisateurs jusqu'à ce que Sharp ferme le site principal en 2016.",
  "Platforms_Flatland_Rover_Description": "Rover est un plugin 3D basé sur le langage 3DML développé en 1997 par Flatland. Les utilisateurs pouvaient créer des \"Spots\" avec le programme de création Spotnik, composés de \"Levels\" contenant des \"Blocks\" pour faciliter le développement, et les exécuter avec Rover, disponible sous forme de plugin pour navigateur et de programme autonome. Le développement a été animé jusqu'à l'effondrement de la bulle Internet, lorsque la plupart des membres de l'équipe se sont dissous. La dernière mise à jour est sortie en 2005 et le site Web a été abandonné avant de disparaître en 2012. L'un des anciens développeurs, Michael Powers, a décidé en 2014 de faire revivre le site web, de créer une archive du logiciel et de le mettre à jour pour qu'il fonctionne sur des systèmes modernes. L'application autonome Rover a été révisée en 2017, mais le plugin n'est pas revenu.",
  "Platforms_Formula_One_Description": "Pas encore de description.",
  "Platforms_Fractal_Viewer_Description": "Pas encore de description.",
  "Platforms_FreeHand_Description": "FreeHand était une suite créative de graphisme vectoriel créée en 1988 par Altsys Corporation. Macromedia a racheté FreeHand en 1994 et a continué à la développer. En octobre 1996, FreeHand 7.0 a été lancé avec un plugin pour le web, appelé Shockwave for FreeHand. Ce plugin permet d'intégrer et de visualiser dans une page Web des images vectorielles créées par le programme. En novembre 1996, Macromedia a acheté FutureSplash, un autre plugin pour le Web pour les graphiques vectoriels, qui a été renommé Flash.  FreeHand 8.0 est sorti en 1998, et exportait désormais vers Flash, au lieu du plugin FreeHand. La dernière nouvelle version du programme, FreeHand MX, est sortie en 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "Le Plugin GoBit Games a été créé en 2008 par GoBit, un petit studio indépendant composé d'anciens employés de PopCap. Leur premier jeu, Burger Shop, est sorti en Octobre 2007 et par demande populaire, a reçu une démo web 4 mois plus tard en utilisant, à l'époque, leur tout nouveau plugin. Après une année écoulée, la démo fût retravaillée comme advergame pour Eggo, et publié par Shockwave.com le 1er février 2009. Le plugin a ensuite été abandonné peu de temps après avec la sortie de Burger Shop 2 - sa démo web respective utilisant Flash à la place - laissant Burger Shop et son reskin comme étant les seuls jeux jamais créés avec le plugin.",
  "Platforms_HotSauce_Description": "Le Meta Content Framework (MCF) était un format de structuration des métadonnées développé par l'Advanced Technology Group d'Apple Computer à partir de 1995. En 1996, Project X devenait un plugin expérimental créé pour les visualiser sur Internet, appelé plus tard HotSauce, qui présentait les sitemaps dans un espace 3D. À la fin de 1996, plus de 200 sites Web utilisaient HotSauce, puis plus de 300, et un accord a été conclu avec NetCarta pour créer une bibliothèque de plus de 30 000 sites Web à parcourir à l'aide du plugin. Bien que la norme MCF ait reçu quelques éloges, la plupart des utilisateurs ne voyaient pas d'avantage à cette méthode de navigation en 3D, et le projet a fini par être l'un des nombreux projets annulés lorsque Steve Jobs est revenu chez Apple en 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage est un standard pour l'affichage des documents par le biais d'un navigateur Web. Développé à l'origine par Tim Berners-Lee au début des années 1990 (ses racines remontent à 1980), HTML est devenu la première méthode de partage de l'information par Internet, ses capacités étant étendues par d'autres langages, comme le CSS et le JavaScript. Il a été lancé pour la première fois en 1993, et a reçu les mises à jour suivantes avec HTML2 en 1995, et à la fois HTML3 et HTML4 en 1997. La dernière mise à jour vers HTML4 était en 2000, et dans les années qui ont suivi son intégration dans les langues ont été largement ignorées comme une plate-forme pour les jeux, les animations et autres contenus web, avec les développeurs optant pour la technologie basée sur des plugins, mais comme la technologie et l'internet ont évolué, les plugins ont commencé à devenir obsolètes, donc un effort a été fait pour mettre à jour le standard, et en 2008 HTML5 a été lancé. Comme Flash et d'autres plugins sont tombés en panne, HTML5 est devenu la norme recommandée, Beaucoup ont déplacé leurs projets vers la famille HTML - ou complètement abandonnés plugins propriétaires - au lieu de télécharger leur contenu sur des sites Web tels que YouTube. {Note: Pour des raisons de brièveté, Flashpoint désigne toute entrée qui ne contient pas de frameworks ou de contenu activé par le plugin comme \"HTML\".}",
  "Platforms_HyperG_Description": "Hyper-G était un système de gestion de contenu Web basé sur Gopher (WCMS), développé par l'Institut pour le traitement de l'information et les nouveaux médias assistés par ordinateur (IICM) de l'Université de technologie de Graz, en Autriche, en 1995. Il s'agissait d'une alternative aux hyperliens du World Wide Web, utilisant des navigateurs compatibles Hyper-G, qui pouvaient afficher des modèles 3D de répertoires et de fichiers, ainsi que d'autres modèles, avec une visionneuse intégrée. Étant donné qu'il était basé sur Gopher, le prédécesseur du WWW, de plus en plus obsolète, il a ensuite évolué vers Hyperwave en 1996, sans les capacités supplémentaires offertes par les navigateurs Hyper-G, telles que les fonctions 3D. La grande majorité de son contenu est aujourd'hui perdue en raison de la manière dont les fichiers étaient stockés avec Gopher.",
  "Platforms_Hypercosm_Player_Description": "Basé sur une technologie en développement depuis 1989, Hypercosm est un lecteur web à contenu 3D qui a été lancé en 1999. La société a fait un investissement important qui n'a pas été rentabilisé, étant l'une des nombreuses victimes du crash des dot-com, et a fermé en 2001. Cependant, la société a été rachetée par ORBITEC, et grâce à un contrat avec la NASA, la société a réussi à rebondir quelque peu, et a continué à travailler sur de nouveaux projets jusqu'à une restructuration en 2012, quand elle a été mise en attente par ORBITEC jusqu'à ce qu'un nouveau partenaire commercial soit intéressé à travailler avec la technologie. Ce n'est jamais arrivé, ce qui a conduit Hypercosm à fermer ses portes en 2016.",
  "Platforms_Illuminatus_Description": "Pas encore de description.",
  "Platforms_iPix_Description": "Pas encore de description.",
  "Platforms_Java_Plugin_Description": "Lancées en même temps que le langage de programmation Java, dont elles constituent l'une des fonctions, les applets Java sont de petites fenêtres d'application intégrées à des pages pour des fonctions interactives supplémentaires. Elles ont été conçues pour être compatibles avec différents systèmes d'exploitation et navigateurs, et pour être plus puissantes que le HTML standard. Elles sont restées une option performante pendant plus de 10 ans, mais à partir de 2013, la technologie sous-jacente aux applets a commencé à ne plus être prise en charge par les principaux navigateurs, et nombre d'entre elles sont devenues inutilisables, ce qui a conduit à leur dépréciation en 2017 et à leur suppression de Java SE 11 en 2018.",
  "Platforms_JCAMPDX_Description": "Pas encore de description.",
  "Platforms_Lightning_Strike_Description": "Pas encore de description.",
  "Platforms_LiveMath_Plugin_Description": "Le plugin LiveMath est une application de mathématiques interactives, créant une fenêtre pouvant contenir des notes, des formules, des graphiques et d'autres fonctions mathématiques, à intégrer dans une page Web. Lancé à l'origine sous le nom de Theorist en 1989 par Prescience Corporation, avec le plugin web lancé en 1994, il a ensuite été renommé MathView en 1997 après avoir été racheté par Waterloo Maple, avant d'être racheté par MathMonkeys et renommé LiveMath en 1999. En 2014, en raison de problèmes croissants et de l'incompatibilité avec les derniers navigateurs, le plugin a été retiré, étant remplacé par une visionneuse autonome appelée LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Pas encore de description.",
  "Platforms_MHSV_Description": "Lancé sous la forme d'une version alpha appelée VSV ({V}irtual {S}pace {V}iewer), puis renommée MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), il s'agissait d'un plugin développé par ParaGraph qui permettait de créer des mondes 3D interactifs à l'aide du programme de création VHSB ({V}irtual {H}ome {S}pace {B}uilder), qui pouvait créer des mondes MHSV interactifs et des mondes VRML statiques standard. En 1996, le développement de la norme VRML 2.0 a ajouté de l'interactivité, et ParaGraph a mis à jour VHSB pour permettre la création de mondes VRML 2.0, mais ParaGraph a décidé de travailler avec Silicon Graphics et leur lecteur Cosmo VRML 2.0, adaptant VHSB pour mieux fonctionner avec lui, abandonnant MHSV dans le processus. Silicon Graphics a racheté ParaGraph en 1997 pour créer Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Développé par Microsoft en réponse à Flash et Java, et lancé en 2007, Silverlight est un outil multimédia axé sur le streaming vidéo, notamment utilisé par Netflix. Les versions ultérieures ont ajouté des capacités supplémentaires pour d'autres applications. Il a bénéficié d'une popularité décente, avec un taux d'adoption de 64,7 % en 2011. Cependant, en 2012, avec l'annonce de la fin de NPAPI, la sortie de Windows 8 et le début de l'adoption de HTML5, Microsoft a déprécié le logiciel, et en 2015, avec la sortie de Windows 10, il est entré en fin de vie, étant abandonné en octobre 2021.",
  "Platforms_NoteWorthy_Composer_Description": "Pas encore de description.",
  "Platforms_O2C_Player_Description": "Faisant partie de la ligne o2c (objects to see), le o2c Player était un plugin 3D web de 1999 pour présenter des objets et des scènes, développé par la société allemande mb Software AG. Cette société a vendu la technologie o2c à ELECO plc en 2003, qui a développé et lancé en 2005 la version 2.0 de l'o2c Player, offrant de bien meilleures performances grâce à l'accélération 3D, et se présentant davantage comme un outil de CAO pour les architectes. La prise en charge d'un plus grand nombre de navigateurs a été ajoutée, mais aucune mise à jour majeure n'a été effectuée, consistant principalement en des corrections de bogues. En 2021, le plugin est toujours disponible au téléchargement, mais Elcosoft est passé à une implémentation Unity WebGL de la technologie.",
  "Platforms_Octree_View_Description": "Ayant débuté sous la forme d'un ancien plugin appelé PicTree Viewer ou PicView, puis redéveloppé sous la forme du nouveau plugin Fastview avant d'être renommé en 1999, Octree View est un visualiseur d'objets 3D basé sur la technologie Voxel en développement depuis au moins 1980, qui utilise des caméras spéciales et des scanners laser pour créer des images. La société a continué à utiliser sa technologie et le plugin, mais en 2007, son site Web a cessé d'être mis à jour, laissant le site sans activité supplémentaire.",
  "Platforms_Pixound_Description": "Pixound était un plugin musical artistique, lancé en 1996 en tant que coentreprise par Hologramophone Research et Frankfurt Balkind Partners. Il s'agissait d'un clavier MIDI qui utilisait les valeurs de couleur des images pour produire différentes notes et hauteurs. En 2003, Hologramophone a changé de nom pour devenir Techné Media. En 2005, le plugin a été abandonné au profit d'une application autonome pour Mac OS X exclusivement. Il est ensuite devenu une application iOS en 2011.",
  "Platforms_Play3D_DeepV_Description": "Play3D était un plugin 3D publié en 1996 par Heads Off, avant d'être rebaptisé et relancé l'année suivante sous le nom de DeepV. À l'exception d'une poignée d'exemples, le plugin a été peu utilisé au cours de son existence. Le site Web du développeur a été fermé en 2001.",
  "Platforms_PointPlus_Description": "PointPlus était un plugin permettant d'intégrer des présentations PowerPoint sur le Web, développé par Net-Scene et lancé en mai 1996 pour Windows NT et 95. Il se positionne comme une alternative à Macromedia Shockwave, plus complexe, pour les utilisateurs débutants qui souhaitent utiliser la norme PowerPoint. En novembre, une visionneuse Java a été développée, compatible avec toutes les plates-formes et ne nécessitant aucun plugin. Il a été conservé comme option pour les cas spécialisés, mais la ligne de produits a cessé d'être mise à jour en 1997. Le site Web a été fermé au début de 2001.",
  "Platforms_PopCap_Plugin_Description": "Le plugin PopCap était un plugin pour mettre en valeur les démos de jeu créées par le développeur PopCap. A ses débuts, la société utilisait Java pour ses démos de jeux en ligne en raison de son accessibilité. Plus tard cependant, le développement a été déplacé vers un plugin interne qui était disponible en tant que contrôle ActiveX et en plugin Firefox traditionnel. Cela a donné à PopCap l'avantage d'avoir leur propre plateforme propriétaire pour la distribution de leur démos. Cependant, sa sous-utilisation par les clients et PopCap eux-mêmes les ont conduit à passer au plus populaire Flash vers 2007.",
  "Platforms_ProtoPlay_Description": "ProtoPlay était un plugin destiné à présenter des prototypes d'interaction des consommateurs avec des produits et une simulation de leurs caractéristiques. Sorti en 1996, il utilisait le programme de création Altia Design pour créer des applications, composées de sprites 2D avec des éléments interactifs. Le plugin était de nature plus utilitaire et il n'a pas fait l'objet d'une publicité active à partir de la fin 2003, étant plutôt considéré comme une fonctionnalité disponible en cas de besoin. Altia Design et le plugin ont continué à être mis à jour pour améliorer la fonctionnalité, et en 2007, un nouvel outil permettant à Photoshop de créer des applications de plugin, appelé PhotoProto, a été publié. En 2009, Altia Inc. s'est concentré sur la conception d'interfaces utilisateur, laissant derrière elle l'aspect prototypage du logiciel, et ProtoPlay avec lui.",
  "Platforms_Pulse_Player_Description": "Lancé en 1997 sous le nom de 3rd Degree, Pulse Player était un plugin 3D axé sur l'animation. Il a été lancé en 1999 grâce au financement et au soutien de plusieurs membres expérimentés dans le domaine des médias Internet, et a été utilisé par plusieurs clients importants. Le plugin a été commercialisé comme une plateforme médiatique amusante et créative, et a connu un certain succès, mais au début de l'année 2001, la société a changé d'orientation et a fait du Player un outil commercial et éducatif plus sérieux. En 2003, la 5.2 a été la dernière version lancée, et peu de temps après, le support a été interrompu.",
  "Platforms_REBOL_Plugin_Description": "REBOL est un langage de programmation conçu pendant plus de 20 ans et publié en 1997. En 2004, un prototype expérimental de plugin web REBOL a été créé, ainsi qu'une page contenant plusieurs exemples. Le plugin a commencé sous forme d'ActiveX pour Internet Explorer uniquement, mais plus tard en 2006, une version du plugin pour d'autres navigateurs a été publiée. Peu de temps après, cependant, la dernière mise à jour a été faite, le laissant en version bêta comme un prototype non sécurisé.",
  "Platforms_ShiVa_Web_Player_Description": "Créé par Stonetrip, et nommé Ston3D Web Player avant 2007, ShiVa Web Player était un plugin de contenu web 3D permettant d'exécuter des logiciels réalisés avec le moteur 3D ShiVa. Il permettait de réaliser des scènes 3D complexes avec éclairage et physique tout en ayant de faibles besoins en traitement. En 2013, Stonetrip s'est rebaptisé ShiVa Technologies SAS et s'est concentré exclusivement sur le moteur. Avec la suppression de NPAPI de la plupart des navigateurs, le support du plugin a diminué, ce qui a conduit à la chute des URL de plusieurs fichiers de base en 2018 et à la rupture de la plupart des jeux, et en 2019, son téléchargement a été supprimé du site Web de ShiVa.",
  "Platforms_Show_It_Description": "Show It! était un plugin introduit en 1997 avec WordPerfect Suite 8 comme l'une des fonctionnalités de Corel Presentations 8, un concurrent de PowerPoint. Lors de l'exportation avec l'option Internet Publisher, ils pouvaient exporter les présentations soit sous forme de diaporama d'images statiques, soit sous forme de projecteur intégré à l'aide d'un fichier propriétaire qui fonctionnait comme l'application de bureau originale, en préservant toutes les fonctionnalités, ce qui nécessitait le plugin. Cette option a continué à être prise en charge dans WordPerfect Office 2000 avec Presentations 9, mais en 2001, la prise en charge de l'option de plugin a été abandonnée dans Presentations 10 de WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Pas encore de description.",
  "Platforms_Squeak_Etoys_Description": "Squeak était une plateforme open source, lancée en 2001, pour la création de contenus ludiques et éducatifs. Les utilisateurs pouvaient créer de petites applications destinées aux enfants de différentes tranches d'âge, de la plus jeune, appelée \"Etoys\", à \"Omniuser\" et \"Expert\". Il a été rebaptisé Etoys en 2008 et s'est orienté davantage vers les jeunes enfants. Etoys 5 a été la dernière version du plugin, sortie en 2012. Le développement d'une version JavaScript du programme a commencé en 2013 après des problèmes de sécurité, laissant le plugin abandonné et remplacé par celui-ci.",
  "Platforms_Superscape_Viscape_Description": "Lancé en 1996 par Superscape, pionnier de la 3D, avec le soutien d'Intel, et appelé à l'origine VisNet, Viscape était un plugin 3D qui présentait l'avantage distinct de l'interactivité avec les mondes, contrairement aux modèles statiques de VRML 1.0. Il a connu une brève période de popularité et, au départ, il n'était pas prévu de prendre en charge VRML, mais VRML97 ayant implémenté l'interactivité, une mise à jour appelée Viscape Universal a été publiée en 1998, ajoutant la prise en charge de VRML pour rester pertinent. Cela s'est avéré insuffisant, avec des problèmes financiers et des partenariats ratés, et des critiques qualifiant le plugin de daté et encombrant malgré ses efforts de relance. Bien que la dernière mise à jour ait été publiée en 2000, sa technologie a continué à être utilisée dans la série Lego Creator de Superscape l'année suivante. Une tentative a été faite pour le mettre à jour en intégrant le plugin dans des applets Java, appelée Vislite, mais la société s'est finalement recentrée sur le développement de jeux mobiles et a connu un succès modéré avant d'être rachetée par Glu Mobile en 2008.",
  "Platforms_Surround_Video_Description": "Pas encore de description.",
  "Platforms_SVF_Viewer_Description": "Pas encore de description.",
  "Platforms_Tcl_Plugin_Description": "Développé par une petite équipe et lancé en 1988, Tool Command Language (Tcl, prononcé \"tickle\") est un langage de programmation dynamique open source. En 1994, Sun Microsystems a fait appel à l'équipe pour développer davantage la technologie. L'un des résultats de cette entreprise a été le plugin de 1996 qui permettait d'exécuter des applets Tcl (\"Tclets\") intégrés dans des pages. À la fin de l'année 1997, le développement de Tcl a été confié à une société indépendante appelée Scriptics, puis à nouveau à Tcl Core Team en 2000. Alors que le développement du langage reste animé jusqu'à aujourd'hui, le travail sur le plugin a ralenti, même s'il n'a pas été officiellement abandonné. La dernière version, 3.1.0, a été publiée en 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer est un plugin multimédia créé en 1997 par Parable Corporation, qui a ensuite changé de nom pour devenir ThingWorld en 1998. Il permet de créer des \"objets\", des ressources qui peuvent être protégées contre le vol ou la falsification et qui ont un identifiant unique avec un crédit à partager sur les sites Web, en utilisant une programmation modulaire simple, pour créer des choses telles que des images, des animations et même des jeux interactifs, réalisés à l'aide du programme de création ThingMaker ou en convertissant des fichiers Shockwave Director à l'aide de ThingConverter. Le site était relativement populaire, obtenant même des contrats avec Microsoft en et plusieurs autres en 1999, mais à la fin de l'année 2000, la société a réduit son personnel et était en pourparlers avec une partie inconnue pour une fusion en vue de vendre la technologie. Le site Web a été fermé en 2002.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine est un moteur de jeu multiplateforme qui vise à rendre le développement de jeux plus accessible. Il s'agit du logiciel de développement de jeux tiers le plus populaire auprès des développeurs du monde entier. Créé parallèlement à Unity lui-même et mis en œuvre dans le premier patch en 2005, Unity Web Player était un outil permettant de jouer aux jeux Unity sur le Web. Il est resté une plateforme populaire pour les jeux 3D, mais avec la suppression de la prise en charge de NPAPI en 2016, le plugin a été abandonné au profit de Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap était un outil permettant de visualiser des cartes interactives intégrées dans une page web. Il était compatible avec plusieurs fichiers cartographiques provenant de différents programmes de création, pouvait afficher des informations détaillées sur les secteurs et permettait d'effectuer des mesures. Après son lancement en 1997, la technologie n'a plus évolué et est restée inchangée jusqu'à la fermeture de la page en 2004.",
  "Platforms_Vitalize_Description": "Créé en 1997 par Corel pour l'affichage de contenu réalisé avec son programme de création multimédia Click&Create, Vitalize ! était un plugin à faible bande passante dédié aux jeux Web simples mettant l'accent sur le jeu, le marketing et la publicité. Distribué avec l'aide d'Europress, il était fier d'être \"facile à apprendre et à utiliser, contrairement à Java ou Shockwave\". En 1999, les anciens employés de Corel sont partis pour créer Clickteam, qui a ensuite repris le développement en 2000 avec la version 2.0. La dernière version 4.0 est sortie en 2007/2008, et a été disponible sur leur site web jusqu'en 2012.",
  "Platforms_VRML_Description": "Le {V}irtual {R}eality {M}odeling {L}anguage est une norme 3D ouverte et la toute première créée pour le web. Lorsqu'il a été initialement spécifié en novembre 1994, le format ne pouvait représenter que des modèles statiques sans interactivité. Ce problème a été résolu en 1997 lorsque la version 2.0, mieux connue sous le nom de VRML97, a été publiée. Bien qu'il n'ait jamais été utilisé par le grand public, il est devenu l'option la plus populaire pour la 3D sur Internet dès son lancement avant d'être remplacé en 2001 par X3D (qui était rétrocompatible avec les mondes VRML). Comme il s'agissait d'un format de fichier et non d'un plugin en soi, de nombreuses implémentations différentes ont été faites de VRML, ajoutant souvent leurs propres fonctionnalités non standard.",
  "Platforms_X3D_Description": "Pas encore de description.",
  "Platforms_Xara_Plugin_Description": "Le plugin Xara était un visualiseur de graphiques vectoriels, utilisant un format propriétaire à faible bande passante. Il a fait l'objet d'une version bêta puis d'une version complète en 1996, permettant de visualiser sur le Web des fichiers Flare créés avec CORELXara. Plus tard en 1997, Xara Webster a été lancé pour créer spécifiquement les graphiques Web pour le plugin. En 1999, la 2.08a a été la dernière version publiée. En 2000, Xara Webster a été remplacé par XaraX qui pouvait exporter vers Flash, un autre plugin vectoriel, de sorte que la prise en charge de leur propre option propriétaire a été abandonnée et qu'elle a été reléguée dans les archives des anciens logiciels.",
  "Platforms_Coming_Soon": "Bientôt disponible",
  "Platforms_Coming_Soon_Description": "Les jeux et animations créés sur ces plateformes seront disponibles lors de la prochaine mise à jour.",
  "Platforms_Common_Ground_Description": "Pas encore de description.",
  "Platforms_DjVu_Description": "Pas encore de description.",
  "Platforms_Jamagic_Description": "Pas encore de description.",
  "Platforms_Jutvision_Description": "Pas encore de description.",
  "Platforms_mBed_Description": "Pas encore de description.",
  "Platforms_MrSID_Description": "Pas encore de description.",
  "Platforms_PanoramIX_Description": "Pas encore de description.",
  "Platforms_Petz_Player_Description": "Pas encore de description.",
  "Platforms_Sibelius_Scorch_Description": "Pas encore de description.",
  "Platforms_Sizzler_Description": "Pas encore de description.",
  "Platforms_Ulead_COOL_360_Description": "Pas encore de description.",
  "Platforms_VReam_WIRL_Description": "Pas encore de description."
}