{
  "Source_Title": "Code source",
  "Source_Desc": "Le logiciel qui alimente Flashpoint est libre et open-source, excluant évidemment la plupart des plugins/technologies de navigateur supportés (nous ne pouvons pas faire grand-chose à ce sujet). Les applications et les utilitaires développés par les contributeurs du projet sont disponibles sur notre {page d'équipe GitHub} et sur notre {GitLab}.",
  "Source_Developed_Projects_Title": "Projets développés par Flashpoint",
  "Source_Developed_Projects_Desc": "Les projets suivants sont publiés sous licence MIT :",
  "Source_Flashpoint_Launcher_Desc": "{Flashpoint Launcher}, un lanceur extensible basé sur Electron, inspiré de LaunchBox.",
  "Source_Flashpoint_Proxy_Desc": "{Flashpoint Proxy}, une bibliothèque qui permet la communication entre un navigateur/projecteur et l'internet simulé de Flashpoint.",
  "Source_Flashpoint_Secure_Player_Desc": "{Flashpoint Secure Player}, une application avancée qui permet de lire des contenus basés sur des plugins sans apporter de modifications permanentes au registre de Windows.",
  "Source_Flashpoint_VM_Desc": "{flashpointvm}, une image disque Linux configurée par Apache qui sert en toute sécurité le contenu des archives ZIP.",
  "Source_Flashpoint_OldCPUSimulator_Desc": "{OldCPUSimulator}, un outil qui exécute des applications avec des vitesses d'horloge simulées.",
  "Source_Utilized_Projects_Title": "Projets utilisés par Flashpoint",
  "Source_Utilized_Projects_Desc": "Les projets suivants sont inclus directement dans le téléchargement de Flashpoint :",
  "Source_Apache_Desc": "{Apache HTTP Server}, un serveur web publié sous la licence Apache-2.0.",
  "Source_Basilisk_Desc": "{Basilisk}, un navigateur web publié sous la licence MPL-2.0. Flashpoint utilise une version 32 bits personnalisée avec sa propre marque, qui peut être trouvée {ici}.",
  "Source_Chromium_Desc": "{Chromium}, un navigateur web publié sous diverses licences open-source.",
  "Source_PHP_Desc": "{PHP}, un langage de script web publié sous la licence PHP.",
  "Source_QEMU_Desc": "{QEMU}, un émulateur de machine publié sous licence GPL-2.0-only."
}