{
  "Discord_Title": "Discord",
  "Discord_Intro": "Bitte lies die Regeln, bevor du unserem Discord-Server beitrittst (sie können auch in {#rules-and-faq} angesehen werden, sobald du drin bist):",
  "Discord_Rule1": "Befolge unsere und die Regeln von Discord: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Sei respektvoll gegenüber anderen. Sei nicht scheinheilig, starte kein Drama, handele nicht obszön, erwähne keine Benutzer/Rollen wiederholt und schicke keine DMs ohne Erlaubnis an Servermitglieder (einschließlich Personal).",
  "Discord_Rule3": "Behalte Themen auf ihren bestimmten Kanälen. Lies immer die Beschreibung, wenn du dir bei dem Kanal unsicher bist. Wenn ein Mitarbeiter dich bittet, die Unterhaltung zu verschieben, tu es bitte auch.",
  "Discord_Rule4": "Die Verbreitung von Inhalten, die derzeit verkauft werden, oder von Flashpoint entfernt werden sollen, ist nicht gestattet.",
  "Discord_Rule5": "{Never send emails relating to Flashpoint without the consent of staff, no matter how good you think it is.} Niemand möchte die eigene Chance, einen Entwickler zu kontaktieren, vergeuden, deshalb wollen wir sicherstellen, dass es nicht passiert.",
  "Discord_Rule6": "Werbung über dich oder dir verbundene Gruppen durch Discord-Einladungen, YouTube-Links, gewinnbringende Unternehmungen oder Ähnliches ist verboten, außer, es ist im Rahmen von Flashpoint oder digitaler Archivierung.",
  "Discord_Rule7": "NSFW-Inhalte und -Diskussion müssen in {#nsfw-lounge} bleiben (das Vorhandensein des Kanals allein sollte mehr als genug erklären).",
  "Discord_Rule8": "Politik hat auf diesem Server keinen Platz. Bitte besprich politische Themen woanders oder überhaupt nicht.",
  "Discord_Curation_Exception": "(Kuratierungen - spezifische Diskussionen derer und der enthaltenen Inhalte - sind die einzige Ausnahme von Regeln 7 und 8.)",
  "Discord_Sanctions": "Teammitglieder dürfen Benutzer warnen/schweigen/kicken/bannen, die ihrer Meinung nach gegen diese Regeln verstoßen, basierend auf der Schwere des Verstoßes. Wir ermutigen das Personal, beim ersten Mal oder bei zufälligen Regelverstößen größzügig zu sein, mehrere Verstöße führen aber zu härteren Strafen.",
  "Discord_Agreed": "Ich habe die Regeln gelesen und möchte dem Server beitreten!"
}