{
  "FAQ_Title": "Häufig gestellte Fragen",
  "FAQ_Question1": "Wer/was ist BlueMaxima?",
  "FAQ_Answer1": "BlueMaxima, oder Ben Latimore, ist der Australier, der mit Flashpoint begonnen hat und die Master-Kopien handhabt. Kein Unternehmen oder keine Organisation ist an Flashpoint beteiligt - es handelt sich um ein komplett durch die Community betriebenes Projekt.",
  "FAQ_Question2": "Welche Betriebssysteme werden unterstützt?",
  "FAQ_Answer2": "Flashpoint unterstützt Windows 7 SP1 und neuer (ausgenommen Windows 8). Mac- und Linux-Versionen sind ständig im Wandel, da sich die Technik links und rechts in der Windows-Version ändert und es an engagierten Mitwirkenden fehlt; für die aktuellsten Informationen musst du auf Discord nachfragen.",
  "FAQ_Question3": "Gibt es Sicherheitsbedenken bei Flashpoint?",
  "FAQ_Answer3": "Nicht das wir wüssten. Die Gesamtheit unserer Anwendungspakete (abzüglich der Spiele-Download-Technik) kann sich nicht mit dem offenen Internet verbinden; alle Änderungen der Registry durch den Flashpoint Secure Player werden entfernt, sobald das Spiel geschlossen wird; alle eingehenden Kuratierungen werden über einen PC mit kompetenter und aktueller Antivirensoftware geleitet; und am wichtigsten ist, dass der Launcher und alle Software von Flashpoint Open-Source sind und {here} gefunden werden können. Wir haben unser Bestes getan, um sicherzustellen, dass die Sammlung so sicher wie möglich ist, aber trotz unserer Anstrengungen identifizieren einige Antiviren wie Avast und AVG wichtige Komponenten als gefährlich. Wenn du von diesem Problem betroffen bist, {read this page} für Anweisungen zur Fehlerbehebung.",
  "FAQ_Question4": "Wie viele Spiele/Animationen gibt es?",
  "FAQ_Answer4": "Mit Flashpoint 11 haben wir über 130.000 Spiele und 20.000 Animationen. Du kannst die Sammlung ohne den Launcher {here} durchsuchen. Alternativ kannst du die entsprechenden Listen {here} und {here} ansehen.",
  "FAQ_Question5": "Welche Plattformen bietet die Sammlung?",
  "FAQ_Answer5": "Wir unterstützen Spiele und Animationen, die auf jeder Plattform auf der {Supported Platforms} Seite aufgelistet sind.",
  "FAQ_Question6": "Wo sind die Nitrome-Spiele?",
  "FAQ_Answer6": "Nitrome hat uns gebeten, ihren Inhalt aus der Sammlung zu entfernen. Wenn du ihre Spiele spielen möchtest, tu dies auf ihrer {website}, und, wenn Flash keine Option ist, folge ihrem wachsenden {HTML5-compatible catalog}. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "Wie kann ich eine Spiele/Animation anfordern?",
  "FAQ_Answer7": "Du kannst einen Antrag stellen, indem du {this article} zuerst komplett durchliest und dann den Links unten folgst.",
  "FAQ_Question8": "Kann ich selbst ein Spiele/eineAnimation hinzufügen?",
  "FAQ_Answer8": "Ja. Folge den in {curation tutorial} aufgeführten Anweisungen, um dein Kurator-Casting einzurichten. Sobald du akzeptiert wurdest, kannst du so viele weitere Kurationen einreichen, wie du willst.",
  "FAQ_Question9": "Ich möchte auf eine andere Weise beitragen (Coden, Testen, etc.). Wie kann ich helfen?",
  "FAQ_Answer9": "Trete unserem {Discord server} für weitere Details bei. Die Großteil unserer Arbeit und Kommunikation geschieht dort.",
  "FAQ_Question10": "Ist Flashpoint Open Source?",
  "FAQ_Answer10": "Jein. Die Quellen für unsere selbstgemachte Technologie wie der Launcher sind alle auf unserem {GitHub} verfügbar. Die Quellen für die Software, die wir in Flashpoint aufnehmen, sind auf ihren entsprechenden Webseiten verfügbar (wir ändern keine Quelle der Software, die wir enthalten). Die Binärdateien für die Web-Plugins selbst sind nicht Open Source, aber wenn sie es wären, dann wären wir gar nicht erst hier.",
  "FAQ_Question11": "Kann ich das Logo verwenden/ist es unter Creative Commons erhältlich?",
  "FAQ_Answer11": "Ja - das Logo fällt unter die {CC-BY 4.0}-Lizenz. Für die Zuschreibung kannst du freiwillig Seirade und BlueMaximas Flashpoint anerkennen. Quelldateien findest du {here}.",
  "FAQ_Question12": "Wo kann ich an das Projekt spenden?",
  "FAQ_Answer12": "Aus Respekt vor den Künstlern und Entwicklern, deren Werke in Flashpoint zu finden sind, versuchen wir, nicht um Spenden zu bitten. Obwohl wir zuvor {a fundraiser} durchgeführt haben, um die Serverkosten zu decken, haben wir keine Pläne, in Zukunft einen weiteren zu starten.",
  "FAQ_Question13": "Flashpoint funktioniert nicht korrekt!",
  "FAQ_Answer13": "Folge den in {manual} aufgelisteten Schritten zur Fehlerbehebung. Falls du danach immer noch Probleme hast, frage in unserem Discord nach Hilfe.",
  "FAQ_Question14": "Ich möchte, dass ein Spiel/eine Animation aus dem einen oder anderen Grund von Flashpoint entfernt wird.",
  "FAQ_Answer14": "Mache uns darauf aufmerksam, entweder über unseren Discord oder {directly by email}. Wir werden wahrscheinlich versuchen, dich davon überzeugen, dein Spiel um der Geschichte willen beizubehalten, aber wir sind nicht unvernünftig.",
  "FAQ_Question15": "Ich habe eine weitere Frage.",
  "FAQ_Answer15": "Besuche unser {extended FAQ}. Wenn deine Frage dort nicht beantwortet wird, trete unserem Discord bei."
}