{
  "About_Welcome": "Willkommen",
  "About_Title": "BlueMaxima's Flashpoint ist ein Projekt zur Erhaltung von Spielen im Internet.",
  "About_Para1": "Internetgeschichte und -kultur sind wichtig und Inhalte auf Web-Plattformen einschließlich, aber nicht beschränkt auf Adobe Flash, machen einen wesentlichen Teil dieser Kultur aus. Dieses Projekt ist darauf ausgerichtet, so viele Erfahrungen wie möglich von diesen Plattformen zu erhalten, sodass sie nicht verloren gehen. Seit Anfang 2018 hat Flashpoint mehr als 100.000 Spiele und 10.000 Animationen auf 35 verschiedenen Plattformen gerettet.",
  "About_Para2": "Flashpoint wurde im Januar 2018 von BlueMaxima gegründet, um Inhalte vor dem Tod von Flash vor dem Verschwinden zu retten. Seitdem hat es sich zu einem internationalen Projekt mit über 100 Community-Mitwirkenden entwickelt. Dazu gehören sowohl Webgames als auch Animationen, die für zahlreiche Internet-Plugins, Frameworks und Standards erstellt wurden.",
  "About_Para3": "Flashpoint verwendet eine starke Auswahl an Open-Source-Software. Durch die Kombination der Leistung von Apache, einem benutzerdefinierten Launcher und unserer eigenen Anwendung namens Flashpoint Secure Player können webbasierte Medien in einer schnellen, benutzerfreundlichen Umgebung abgespielt werden, ohne permanente Änderungen oder Sicherheitslücken auf Deinem Computer zu hinterlassen.",
  "About_Para4": "Wir bieten zwei Versionen der Software an; Ultimate, welches alle Medien in einem fertigen Format zur Offline-Nutzung enhält, und Infinity, eine kleinere Distribution, die es ermöglicht, Inhalte nach Belieben herunterzuladen und abzuspielen. Beide Versionen sind nicht vom Ende der Unterstützung von Flash oder anderer Plugins betroffen.",
  "About_Para5": "Dieses Projekt ist nicht und wird nie gewinnorientiert sein, um das Gefühl der Gemeinschaft, das mit Flash und seinesgleichen kam, zu bewahren und zu teilen. Weitere Informationen über Flashpoint findest Du in der Seitenleiste links.",
  "Search_Collection": "Suche in der Sammlung",
  "Request_Archival": "Inhalt zum Archivieren anfordern"
}