{
  "About_Welcome": "Willkommen",
  "About_Title": "Das Flashpoint-Archiv ist eine gemeinschaftliche Leistung, um Spiele und Animationen aus dem Internet zu erhalten.",
  "About_Para1": "Internetgeschichte und -kultur sind wichtig. Das Netz entwickelt sich so schnell, dass das, was heute alltäglich ist, morgen veraltet sein könnte. Dieses Projekt ist darauf ausgerichtet, so viele Erfahrungen wie möglich von diesen Plattformen zu erhalten, sodass sie nicht verloren gehen. Seit Dezember 2017 wurden {over {} games and animations} mit über hundert Browser-Plugins und Web-Technologien erhalten.",
  "About_Para2": "Neben unserem Erhaltungsaufwand bieten wir auch ein hochflexibles Softwarepaket für die zuverlässige Navigation und Wiedergabe von erhaltenen Inhalten. Unter der Software hinter Flashpoint ist {a fully-featured launcher}, der als Frontend für die Sammlung fungiert, {a proxy}, der Spielen vortäuscht im Internet zu laufen, und {a sandbox}, die die sichere Wiedergabe von plugin-fähigen Inhalten erlauben - alle sind {open-source software}.",
  "About_Para3": "Das Projekt {was originally started} von BlueMaxima in einem Versuch, das Verschwinden von Webgames mit dem Ende der Unterstützung von Flash aufzuhalten. Seitdem hat es sich zu einem großen Vorhaben entwickelt, an dem hunderte von Mitwirkenden aus der ganzen Welt beteiligt sind. Es umfasst sowohl Spiele als auch Animationen, die für zahlreiche Internet-Plugins, Frameworks und Standards erstellt wurden.",
  "About_Para4": "Das Flashpoint Archiv arbeitet gemeinnützig mit dem Ziel, die Anstrengungen zur Erhaltung und Zugänglichkeit von Spielen, Animationen und anderen digitalen, interaktiven Erfahrungen aus dem Internet zu fördern. Wenn du uns unterstützen oder mehr darüber erfahren möchtest, wie wir uns finanzieren und wo diese Mittel ausgegeben werden, benutze bitte den Spenden-Button in der linken Seitenleiste oder besuche unsere {Open Collective page}.",
  "Search_Collection": "Suche in der Sammlung",
  "Request_Archival": "Inhalt zum Archivieren anfordern"
}