{
  "News_Title": "Neuigkeiten",
  "News_Description": "Alle nennenswerten Ereignisse in der Flashpoint-Geschichte ab Oktober 2019.",
  "News_Flashpoint_Started": "BlueMaximas Flashpoint wurde gestartet.",
  "News_Flashpoint_0": "Flashpoint Zero wurde veröffentlicht.",
  "News_Flashpoint_1": "Flashpoint Version One wurde veröffentlicht.",
  "News_Was_Released": "wurde veröffentlicht",
  "News_Flashpoint_3_0": "Schlüssel zum Königreich",
  "News_Flashpoint_3_0_Meta": "Diese Version führte den Redirector ein, das letzte nötige Puzzleteil, damit das Server-Setup funktioniert - damit konnten wir 99,9% der Flash-Spiele bewahren, ohne zu hacken. Die Schlüssel zum Königreich der Flash-Bewahrung, wenn du willst.",
  "News_Flashpoint_3_1": "Eröffnungsabend",
  "News_Flashpoint_3_1_Meta": "Diese Version war die erste mit Flashpoint Theatre (obwohl es zu dieser Zeit eine separate Instanz von LaunchBox war).",
  "News_Flashpoint_3_2": "Angst und Schrecken",
  "News_Flashpoint_3_2_Meta": "Diese Version war die erste, die Shockwave-Titel unterstützte.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Benannt nach der Tatsache, dass wir zu diesem Zeitpunkt 4.000 Spiele in der Sammlung übertroffen hatten. Mann, wie die Zeit vergeht.",
  "News_Flashpoint_4_0": "Das lebende Unendliche",
  "News_Flashpoint_4_0_Meta": "Mit dieser Version wurde Flashpoint Infinity eingeführt, mit dem Spiele aus dem Internet gestreamt werden können.",
  "News_Flashpoint_4_1": "Javalität",
  "News_Flashpoint_4_1_Meta": "Mit dieser Version wurde die Unterstützung für Java-Applets eingeführt. Der Name war eine Idee von DarkMoe.",
  "News_Flashpoint_5_0": "Strebe den Launch an",
  "News_Flashpoint_5_0_Meta": "Der Launcher, den wir alle kennen und lieben wurde in dieser Version eingeführt.",
  "News_Flashpoint_5_1": "Der große Filter",
  "News_Flashpoint_5_1_Meta": "Playlists wurden hier hinzugefügt (ein Filter, wenn du willst). Der Name wurde von der EP The Great Filter von Mesarthim übernommen.",
  "News_Flashpoint_5_2": "Typ III",
  "News_Flashpoint_5_2_Meta": "The Great Filter und Type III sind zwei Mesarthim-EPs, die oft zusammengesetzt werden. Uns sind keine anderen Namen eingefallen, als wir sie brauchten.",
  "News_Flashpoint_5_3": "Revolution",
  "News_Flashpoint_5_3_Meta": "Diese Version wurde nah des 1-jährigen Jubiläums von Flashpoint veröffentlicht, und wir hielten es für eine echte Revolution. (Ursprünglich sollte es 'Orbit' genannt werden, das war aber ein dummer Name für das Konzept.)",
  "News_Flashpoint_5_4": "Rekombination",
  "News_Flashpoint_5_4_Meta": "Diese Version vereinte Animationen mit Spielen, welche zuvor in separaten Ordnern mit separaten Clients waren. 'Recombination' und '74%' sind zufällig auch der Name von zwei Tracks im Mesarthim-Album The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Ein kleiner Satz von Patches, die neben der Upload-Zeit von 5.4 erstellt wurden. Es war nicht so, als ob Flashpoint 5.4 nur zu 74% abgeschlossen war, als wir es veröffentlichten.",
  "News_Flashpoint_5_5": "Eisen & Kupfer",
  "News_Flashpoint_5_5_Meta": "BlueMaxima spielte damals ein bisschen zu viel Deus Ex.",
  "News_Flashpoint_6_0": "Ausrichtung",
  "News_Flashpoint_6_0_Meta": "Eine weitere Mesarthim-Referenz!",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "Ein Wortspiel mit Software-Begriffen, die häufig in der Technik verwendet werden, wie \"Freeware\" und \"Shareware\".",
  "News_Flashpoint_6_2": "Moe's großartige Flucht",
  "News_Flashpoint_6_2_Meta": "Der Mitarbeiter DarkMoe kuratierte eine wirklich wahnsinnige Menge von Escape-the-room-Spielen in dieser Version.",
  "News_Flashpoint_6_3": "Wir sprechen über Flash-Spiele, nicht abstrakte Philosophie",
  "News_Flashpoint_6_3_Meta": "Benannt nach einer flapsigen Zeile von nosamu, einem Mitarbeiter.",
  "News_Old_Releases_Title": "Retroaktive Zeitleiste der Releases",
  "News_Old_Releases_Description": "Aufgrund der Tatsache, dass es erst seit Dezember 2019 eine Neuigkeiten-Spalte gibt, sind die meisten Veröffentlichungen bis zu diesem Zeitpunkt nicht katalogisiert. Dieser Abschnitt berücksichtigt die fehlenden Versionen.",
  "News_Is_Available": "ist jetzt verfügbar!",
  "News_Grab_Download": "Lad' es dir von der {downloads page} herunter",
  "News_Flashpoint_Update_October_2019": "Das Flashpoint-Statusupdate für Oktober 2019 ist jetzt auf Medium verfügbar. Schaue es dir {here} an.",
  "News_Flashpoint_Update_November_2019": "Das Flashpoint-Statusupdate für November 2019 ist jetzt auf Medium verfügbar. Schaue es dir {here} an.",
  "News_Flashpoint_7_0": "Acht Tausend Stunden",
  "News_Flashpoint_7_0_Meta": "8000 Stunden waren ungefähr wie lange Flash zum Zeitpunkt der Veröffentlichung leben durfte.",
  "News_Flashpoint_7_1": "Auf dem Ziel bleiben",
  "News_Flashpoint_7_1_Meta": "Flashpoint 7.0, nach unseren Standards, war ein Durcheinander. 7.1 war ein schwerer Bugfix-Release.",
  "News_Featured_Kotaku_Link": "Wir wurden auf Kotaku vorgestellt!",
  "News_Featured_Kotaku_Rest": "Das ist ein riesiger Meilenstein. Vielen Dank an alle für die Unterstützung!",
  "News_Flashpoint_Update_March_2020": "Das Flashpoint-Statusupdate für März 2020 ist jetzt auf Medium verfügbar. Schaue es dir {here} an.",
  "News_Flashpoint_Update_April_2020": "Das Flashpoint-Statusupdate für April 2020 ist jetzt auf Medium verfügbar. Schaue es dir {here} an.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Diese Version sah das Ende der Redirector Software, die zuvor verwendet wurde, um den Server funktionsfähig zu machen. HTTP-Code 301 ist 'permanent verschoben' wie 'wird nicht mehr weitergeleitet'.",
  "News_Flashpoint_Update_June_2020": "Das Flashpoint Mini-Status-Update für Juni 2020 ist jetzt auf Medium verfügbar. Schaue es dir {here} an.",
  "News_Flashpoint_8_1": "Geist des Abenteuers",
  "News_Flashpoint_8_1_Meta": "Benannt nach einer Zeile aus dem damals aktuellen Album von Aether Realm, Redneck Vikings from Hell. Der Song 'One Hollow Word', um genau zu sein.",
  "News_Flashpoint_Update_August_2020": "Das Flashpoint-Statusupdate für August 2020 ist jetzt auf Medium verfügbar. Schaue es dir {here} an.",
  "News_Flashpoint_8_2": "Annäherung an Planet Neun",
  "News_Flashpoint_8_2_Meta": "Ein (gestrecktes, so viel gönne ich dir) Portmanteau der \"Annäherung an Version neun\", und Planet Nine, der Mesarthim EP.",
  "News_Flashpoint_9_0": "Glorreicher Sonnenuntergang",
  "News_Flashpoint_9_0_Meta": "Benannt nach Glorious Morning, dem Lied, das am bekanntesten in Age of War ist. Dies war die letzte Version, die vor Flash's Tod veröffentlicht wurde, daher \"Sonnenuntergang\".",
  "News_Flashpoint_Update_April_2021": "Das Flashpoint-Statusupdate für April 2021 wurde heute veröffentlicht. Schaue es dir {here} an.",
  "News_Flashpoint_10_0": "Abwesenheit",
  "News_Flashpoint_10_0_Meta": "Dies ist die erste Version, die in einem Post-Flash Internet veröffentlicht wird, daher der Name \"Abwesenheit\". Es war auch der Name des letzten Lieds auf der Mesarthim EP \"Vacuum Solution\".",
  "News_Flashpoint_10_1": "Abwesenheit II",
  "News_Flashpoint_10_1_Meta": "Na los, rate mal.",
  "News_Flashpoint_11": "Hoppla, alle Plugins!",
  "News_Flashpoint_11_Meta": "Das ist ein Witz, denn Flashpoint 11 hat drei Dutzend neue Plugins hinzugefügt.",
  "News_Flashpoint_11_1": "Operation Kirschblüte",
  "News_Flashpoint_11_1_Meta": "Anspielung auf das Spiel Muv-Luv (Kauf es auf Steam)."
}