{
  "Platforms_Title": "Unterstützte Plattformen",
  "Platforms_Description1": "Flashpoint unterstützt Spiele und Animationen, die für eine Vielzahl von Web-Plugins und -Standards erstellt wurden - nicht nur Flash. Diese Seite enthält einen Überblick über jede Technologie und deren Anzahl an Einträgen mit Version 11.",
  "Platforms_Description2": "Dies dient als eine \"Wer? Wann? Was?\"-Zusammenfassung und Startpunkt für weitere Forschung, es ist keine ausführlich Geschichte jeder Plattform. Wir versuchen unser Bestes, um genaue Fakten zu zeigen, aber Fehler sind immer noch möglich. Bitte kontaktiere uns mit relevanten Informationen für Berichtigungen.",
  "Platforms_By": "von",
  "Platforms_Entries": "Einträge",
  "Platforms_Entry": "Eintrag",
  "Platforms_3D_Groove_GX_Description": "Die 1998 gegründete Groove Alliance hat 3D Groove SX, eine Shockwave-fähige 3D-Spiele-Engine, entwickelt. Im Laufe des Jahres 2002 wurde sie ausgehend von Shockwave eine eigene Sache namens 3D Groove GX. Beide Varianten konnten zur Entwicklung von Online-Spielen und Desktop-Anwendungen verwendet werden. Dies erwies sich als Erfolg für das Unternehmen, welches eine große kommerzielle Nutzerbasis anhäufen konnte und zu der Erstellung mehrerer hochkarätiger Titel für Fernsehserien und andere große Medien führte. Nachdem der Hype abgeklungen war, wurde die Groove Alliance 2008 in OTOY umgestaltet, die 3D Groove-Website blieb aber bis 2009 online. Die genaue Ursache für den Untergang der ursprünglichen Firma ist unbekannt, interne Streitigkeiten wurden aber bestätigt.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (ehemals 3D Life Player, Virtools Player und NeMo Web Player, nicht zu verwechseln mit 3DVIA Studio/Beta Player oder 3DVIA Composer Player) war ein Browser-Plugin von Dassault Systemés für die Wiedergabe von 3D-Erfahrungen in Virtools. Es war für fortgeschrittene, praktische Anwendungen von 3D-Technik, wie computergestütztes Training, virtuelle Touren und Immobilien, gedacht. 3DVIA Player wurde auch für Webspiele verwendet. Einige seiner Hauptanwender für diese Zwecke waren das Studio Sarbakan aus Quebec und die in Amsterdam ansässige Little Chicken Game Company. Das letzte Update, Version 5.0, wurde 2009 veröffentlicht. Die Download-Seite würde für die kommenden Jahre online bleiben, bis sie 2016 abgeschaltet wurde. Bis dahin wurde es mehr als 30 Millionen Mal installiert.",
  "Platforms_AboutPeople_Description": "Noch keine Beschreibung.",
  "Platforms_AboutTime_Description": "Noch keine Beschreibung.",
  "Platforms_ActiveX_Controls_Description": "1996 von Microsoft veröffentlicht, war ActiveX ein Software-Framework, das als Standard zum Abkapseln von Programmen als Behälter für die Verwendung in anderen, nicht verwandten Programmen namens ActiveX Controls zur Verfügung stellte. Sie konnten in HTML-Inhalte eingebettet werden und Controls speziell für den Einsatz in Internet Explorer zum Zwecke der Webgame-Wiedergabe erstellt werden. Nach dem Start von Edge im Jahr 2015 war die Software veraltet und ihre Verwendung für Webanwendungen scheint eingestellt. Es wurde auf Internet Explorer 11 verwiesen, um alte Software zu unterstützen.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Mit Beginn der Entwicklung 1996 als V3O von Rocket Science Games, später auf Attitude Software übertragen und in 3D Anarchy umbenannt, dann im Jahr 2000 an Adobe verkauft und 2001 umfirmiert, ist Atmosphere Player ein Webplugin für interaktive 3D-Welten, ähnlich dem VRML-Standard, der im Atmosphere Builder erstellt wurde. Es war hauptsächlich für virtuelle Medien-Galerien gedacht, die Bilder/Audio/Video und die 3D-Modelle selbst präsentieren konnten. Als es zunächst in 3D Anarchy umbenannt wurde, war die Software noch in der Beta und Adobe hat die Technologie für die Weiterentwicklung erworben. Die nächsten 3 Jahre verbrachte sie in Beta-Tests und die letzte Release-Version 1.0 des Players wurde im Februar 2004 veröffentlicht. Im Dezember 2004 wurde angekündigt, dass die Atmosphere eingestellt werden würde. Die Unterstützung wurde im Januar 2005 beendet.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (auch nur Flash, früher Macromedia Shockwave Flash Player) ist ein Player für Vektoranimationen und Grafiken, oft mit zusätzlicher Interaktivität. Es wurde als Medium für Webgames verwendet, aufgrund seiner effektiven Komprimierung, niedrigen Kosten, Benutzerfreundlichkeit und einer großen Installationsbasis. 1995 entwickelt und 1996 erstmals von FutureWave eingeführt, war es kaum in der Lage, mehr als grundlegende Animationen und Tasten zur Steuerung darzustellen. Als es populär wurde, wurden dem Player erweiterte Funktionen hinzugefügt, wie zum Beispiel die Programmiersprache ActionScript. Als die Menschen jedoch vor den potenziellen Sicherheitslücken misstrauisch wurden, und die Beliebtheit von HTML5 bei Webentwicklern wuchs, kündigte Adobe das End-of-Life-Datum von Flash für den 31. Dezember 2020 an.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (auch Shockwave, früher Macromedia Shockwave Player oder Shockwave Director Player) ist ein Player für interaktive Medien, der 1995 veröffentlicht wurde. Basierend auf Technologie, die 10 Jahre zuvor von MacroMind in der Entwicklung waren, wurde es erst nach seiner Übernahme durch Macromedia ein Web-Plugin. Im Gegensatz zu Flash hat Shockwave die Lingo-Skriptsprache und C++ durch die Verwendung von Xtras unterstützt, was dem Spieler eine große Bandbreite an Möglichkeiten gab, einschließlich 3D. Es wurde vielfach im frühen Internet und auf CD-ROM-Spielen verwendet und gewann allgemeine Popularität. Die Beliebtheit der Plattform nahm nach Adobes Übernahme von Macromedia zugunsten von Flash, dessen Anzahl an Funktionen sich schnell ausweitete und nun auch im Besitz von Adobe war, deutlich ab. Adobe kündigte seine Einstellung schließlich im Februar 2019 und das Ende der Unterstützung zwei Monate später an.",
  "Platforms_Alambik_Plugin_Description": "Das Alambik Plugin ist ein Webplayer für Inhalte, die mit Alambik, einer Entwicklungsplattform, erstellt wurden. 2001 erschienen, war es fähig, 2D- und 3D-Grafiken, Vektoren und viele andere Anwendungen zu nutzen. 2002 führte Alambik einen Wettbewerb mit Preisen durch, um die Veröffentlichung von Alambik Script zu feiern. 2004 hat Alambik eine neue Demo-Website erstellt, aber danach verstummte die Firma und veröffentlichte nie etwas Neues für die Plattform oder aktualisierte das Plugin.",
  "Platforms_Ambulant_Description": "Ambulant ist ein Player für SMIL-Dateien, erstellt von zahlreichen Einzelpersonen koordiniert auf CWI in Amsterdam, Niederlande. Der Name scheint sich auf „Ambulation“ (Bewegung) zu beziehen, ein weiteres Wort für Gehen; dies wird auch durch das Logo unterstützt, das als Fußgänger erscheint. SMIL war eine Spezifikation von W3C, dem internationalen Web-Konsortium, genoss aber keine große Popularität. Ambulant versuchte ein Open Source Player zu sein, der alle SMIL Dateien unterstützt. Der Wunsch, alle Teile Open Source zu machen, verhinderte jedoch, einige proprietäre Medienformate zu unterstützen. Die Entwicklung begann im April 2003 und die erste Version „AMBULANT/G“ wurde im Juli desselben Jahres veröffentlicht. Die letze stabile Version, 2.6, wurde im Februar 2015 veröffentlicht, aber Arbeit an einem instabilen Build von Ambulant 2.7 setzte sich bis Juli 2016 fort, als der letzte Commit zu ihrem Github-Repo gemacht wurde. Die Entwickler von Ambulant sind aber noch in anderen Projekten aktiv.",
  "Platforms_AnimaFlex_Description": "AnimaFlex war ein Grafik-Playback-Plugin, das mit dem RubberWeb Composer erstellte Animationen mit einer kleinen Dateigröße abspielen konnte, das Bilder strecken und verzerren konnte. Es konnte auch Animationen abspielen, bevor die gesamte Datei heruntergeladen wurde und sich an langsamere Internetgeschwindigkeiten anpassen. Trotz seiner Versprechen hatte RubberFlex selber mehrere andere Produkte, die alle GIFs exportieren konnten, welche mit ihrer proprietären Option konkurrierten, und startete sogar FlexToGif, um Plugin-Dateien in GIFs zu konvertieren, 2 Tage nach der Veröffentlichung des Plugins. Anfang 1998 hat der RubberWeb Composer den Vertrieb eingestellt, wodurch AnimaFlex ohne Autorenprogramm verblieb.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics was a presentations program created in 1986 by Software Publishing Corporation (SPC) for MS-DOS PCs. After their transition to Windows in 1991, it failed to regain the market share it had and lost to PowerPoint. In 1996 Allegro New Media (renamed to Vizacom later that year) bought SPC and Serif. SPC created ASAP WordPower, a program to easily create slideshows, that could be published on the web using the ASAP WebShow plugin. SPC merged with Serif in 1997. 1998 saw the Harvard brand revitalised with the Harvard Graphics 98 authoring program, and the plugin was replaced with a new one called Harvard Graphics WebShow. In 2000 Advanced Presentations, the new version of the authoring software, exported to the Flash standard instead of the proprietary plugin format. Vizacom sold Serif back to their original management in 2001, which relegated the Harvard range to legacy software, being supported and sold until being discontinued in 2017.",
  "Platforms_Authorware_Web_Player_Description": "Der Authorware Web Player wurde 1996 von Macromedia als eine der neuen Funktionen von Authorware 3.5 erstellt. Er wurde entwickelt, um interaktive Programme, die mit Macromedia Authorware im Web entwickelt wurden, auszuführen. Im Gegensatz zu den meisten Webplugins war der Hauptzweck von Authorware E-Learning zu unterstützen, was zu seinem Einsatz in Unternehmen und im akademischen Bereich führte, um multimediale Lernmaterialien ohne Programmiererfahrung zusammenzustellen. Die endgültige Version des Plugins wurde 2004 veröffentlicht, vor der Übernahme von Macromedia durch Adobe im Jahr 2005. Danach stagnierte die Entwicklung bis zur Ankündigung ihrer Einstellung im Jahr 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Noch keine Beschreibung.",
  "Platforms_AXEL_Player_Description": "AXEL Player war ein interaktives 3D-Inhalts-Plugin, das von MindAvenue im Jahr 2002 erstellt wurde. Es war ein Weg, um Modelle und Animationen auf dem AXELedge Web-Authoring-Programm, und AXELpublisher, welches Dateien aus anderen 3D-Programmen wie 3ds Max konvertiert haben. Die Software wurde von Kritikern trotz einiger Einschränkungen gut empfangen. Eine davon war das Fehlen vieler Anwender für das Plugin. Im Jahr 2005 wurde MindAvenue von 20-20 Technologies übernommen, die sich auf Innenarchitektur und Möbelentwicklungssoftware spezialisiert haben. Im Jahr 2006 wurde ihre Website zu einer Umleitungsseite zu 20-20. Alle AXEL-Markenprodukte einschließlich des Plugins wurden eingestellt.",
  "Platforms_BitPlayer_Description": "BitPlayer war eine Desktop-Anwendung, die auf Flash- und Shockwave-Technologie basiert, die 1999 von der niederländischen Firma BitMagic erstellt wurde. Sie bot tägliche Shorts an, die im eigenen Haus und von Kunden produziert wurden, die von Anzeigen und Quizen begleitet wurden. Anfangs lag der Wert bei 6 Millionen Dollar. Es ist nach den Werbetreibenden dem Dot-com-Crash zum Opfer gefallen und die Produktion eingestellt wurde im Januar 2001. Ein Großteil seines Inhalts hat seitdem als konvertierte SWF-Dateien überlebt, obwohl die zusätzliche Funktionalität des benutzerdefinierten Players verloren ging.",
  "Platforms_Blender_Description": "Noch keine Beschreibung.",
  "Platforms_Burster_Description": "Burster war eine Implementierung aus dem Jahre 2010 der Blender Game Engine von 2000. Das Projekt war ein Versuch, ein offizielles Plugin mit Blender, das aufgrund von Sicherheitsbedenken eingestellt wurde, wiederzubeleben. Er verbesserte das Original, indem er die neueren Versionen der Engine für bessere Leistung und Grafik nutzte. Die letzte Version wurde 2013 veröffentlicht, und nach 3 Jahren ohne Updates wurde Burster im Jahr 2016 offiziell eingestellt. Die Spiel-Engine selbst wurde 2018 von Blender entfernt.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin ist ein Produktivitätswerkzeug von Logic Pulse aus dem Jahr 1996. Es war eine neue Funktion in Version 3.2 von Calendar Quick, einer Kalender- und Zeitplan-Desktop-Anwendung. Es ermöglichte, diese mit der Exportfunktion auf Internetseiten zu veröffentlichen, die mit anderen verlinkt und mit dem Plugin betrachtet werden konnten. Nachdem 1999 ein Y2K-Fehler behoben wurde, wurde die Website ohne weitere Updates verlassen und 2001 heruntergefahren.",
  "Platforms_Cult3D_Description": "Cult3D war ein Webviewer für 3D-Inhalte, die mit dem Cult3D Designer Authoring Programm erstellt wurden. Mit 6 Millionen Benutzern bis 2001 und mehreren nennenswerten Kunden konnte er einen moderaten Erfolg verzeichnen und weitere Importoptionen für 3D-Modelle aus anderen Programmen wurden hinzugefügt. 5.3 war die letzte 2002 veröffentlichte Version, mit dem letzten veröffentlichten Update des Plugins 2004, als die Technologie an die Mental Images GmbH verkauft wurde. Nvidia kaufte im Jahr 2007 Mental Images, wodurch diese zur Tochtergesellschaft Nvidia Advanced Rendering Center wurde. Trotz Aktualisierung der Website erhielt das Plugin keine Updates und ab 2011 wurde es nicht mehr als nutzbare Option dargestellt. Die Download-Seite wurde aufgrund von Benutzern, die noch eine Autorenlizenz hatten, auffrecht erhalten. Sie wurde 2013 entfernt.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion war eine Reihe von AR(Augmented Reality)-Programmen, deren Entwicklung im Jahr 1999 durch Total Immersion begann. Es verwendete Videokameras zur Anzeige von 3D-Objekten in Echtzeit. Eines dieser Programme war D'Fusion @Home, veröffentlicht im Jahr 2008, mit einem Plugin später im Jahr 2009. Anwendungen für sie wurden mit dem Authoring-Programm, D'Fusion Studio, erstellt und sein Schwerpunkt lag auf Marketing und kurzen Erfahrungen. Bis 2011 kämpfte die Technologie um eine weit verbreitete Anwendung. Selbst mit zugänglicheren Flash-Implementation und dem kostenlosen Anbieten der Authoring-Software war seine Annahme immer noch sehr begrenzt. Nach dem Aufkommen von Smartphones wurde TryLive als eine weitere AR-basierte Lösung entwickelt, um Produkte wie Möbel und Brillen einfach vorzuzeigen. Diese war, im Gegensatz zu der D'Fusion-Serie, die nach 2013 keine weiteren Updates erhielt, erfolgreich. Im Jahr 2015 wurde das Unternehmen an ACEP verkauft, eine Brillenfirma.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Noch keine Beschreibung.",
  "Platforms_DPGraph_Description": "DPGraph (Dynamic Photorealist Graphing) wurde 1999 von David Parker entwickelt und ist ein ausführbares Programm, das sich der Darstellung von Graphen von Webseiten widmet. Diese können mit der Kontrolle von Variablen bis zu 8 Dimensionen animieren und zeigen. Es funktionierte durch das Herunterladen einer Datei auf einer Webseite, die dem Browser vorschreibt, das Programm auszuführen und die Graphen zu rendern. Eine Vollversion wurde an mehrere Bildungseinrichtungen zur Verwendung in Klassenzimmern und zur Erstellung von Graphen lizenziert sowie ein kostenloser Player, um sie anzusehen. Es wurde zuletzt 2016 aktualisiert, und 2019 wurde die Vollversion von DPGraph für alle kostenlos verwendbar.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) war ein von Sharp im Jahr 2001 veröffentlichtes Animations-Plugin. Entwickelt für mobile Geräte wie Telefone und PDAs, wurde es für ausgewählte Telefonmodelle exklusiv in Japan sowie als Browser-Plugin veröffentlicht. Es zeichnete sich durch seine kleine Dateigröße und Vektorgrafiken, die auf jedem mobilen Bildschirm passen, aus. Die Technologie wurde 2002 unter dem Namen SharpMotionART in den USA veröffentlicht. Keine von beiden hielte lange durch, da e-animator seine letzte Aktualisierung im Jahr 2003 erhielt und SharpMotionART im Jahr 2004 eingestellt wurde.",
  "Platforms_Envoy_Description": "Envoy war ein 1993 von Tumbleweed Software entwickeltes Dokumentenformat. Erstellt wurde es durch das virtuelle Drucken von Dokumenten in WordPerfect. Es war ein Konkurrent von Adobe Acrobat und seinem PDF-Format. WordPerfect Corporation wurde 1994 an Novell verkauft, einschließlich Envoy, aber Tumbleweed arbeitete weiter mit Novell, indem ein Web-Plugin um Dateien online anzusehen im Jahr 1995 veröffentlicht wurde. Novell verkaufte WordPerfect 1996 an Corel, Envoy blieb aber ihr Eigentum. 1999 hatte Novell die Entwicklung von Envoy eingestellt und Corel hat die Unterstützung von Envoy in WordPerfect 2000 aufgegeben. Dies beendete die Zusammenarbeit von Tumbleweed und Novell nach der Übernahme von Envoy 1994 und die Unterstützung für das Plugin wurde eingestellt.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) ist ein leichtes Animations-Plugin, das 1997 von Sharp entwickelt wurde. Es gab mehrere Versionen der Autorensoftware, die mit zusammen mit Sharp-Computern geliefert wurden, und auch solche für verschiedene Ziel- und Altersgruppen. Die Hauptversion war „EVA Animator“. Eine kinderfreundlichere Version, “EVA Animator Kids”, mit der Website エバキッズクラブ (EVA Kids Club), wurde im Jahr 2000 veröffentlicht. Diese wurden 2007 eingestellt und durch eine Version für Fortgeschrittene, „EVA Animator School II“, ersetzt. Das letzte große Update für das Plugin kam 2002 mit einem kleinen Fix im Jahr 2008. Trotzdem unterhielt es eine kleine Benutzergemeinschaft, bis Sharp die Hauptseite 2016 abgeschaltete.",
  "Platforms_Flatland_Rover_Description": "Rover ist ein 3D-Plugin basierend auf der 3DML Sprache, die 1997 von Flatland entwickelt wurde. Spots konnten mit dem Spotnik-Autorenprogramm, das aus „Blöcken“ aufgebaute „Levels“ enthielt, um die Entwicklung zu erleichtern, erstellt und mit Rover, als Browser-Plugin und als eigenständiges Programm verfügbar, gestartet werden. Die Entwicklung war bis zum Dot-Com-Crash dynamisch, als sich der Großteil des Teams aufgelöst hat und die Website aufgegeben wurde. Die letzte veröffentlichte Aktualisierung erschien 2005 und die Website wurde 2012 abgeschaltet. Einer der ehemaligen Entwickler, Michael Powers, hat 2014 beschlossen, die Website wiederzubeleben, ein Archiv der Software zu erstellen und für das Verwenden auf modernen Systemen zu aktualisieren. Die eigenständige Rover-App wurde 2017 überarbeitet, das Plugin kehrte aber nicht zurück.",
  "Platforms_Formula_One_Description": "Noch keine Beschreibung.",
  "Platforms_Fractal_Viewer_Description": "Noch keine Beschreibung.",
  "Platforms_FreeHand_Description": "FreeHand war eine Kreativ-Suite für Vektorgrafik, die 1988 von Altsys Corporation veröffentlicht wurde. Macromedia kaufte FreeHand 1994 und entwickelte es weiter: Im Oktober 1996 wurde FreeHand 7.0 mit einem Plugin für das Web veröffentlicht. Es hieß Shockwave for FreeHand. Das Plugin ermöglichte es, Vektorgrafiken, die vom Programm erstellt wurden, in eine Website einzubetten und anzusehen. Im November 1996 kaufte Macromedia FutureSplash, ein weiteres Web-Plugin für Vektorgrafik, das in Flash umbenannt wurde. FreeHand 8.0 wurde 1998 veröffentlicht und ermöglichte nun den Export nach Flash anstelle des Freehand-Plugins. Die letzte neue Version des Programms, FreeHand MX, wurde 2003 veröffentlicht.",
  "Platforms_GoBit_Games_Plugin_Description": "Das GoBit Games Plugin wurde 2008 von GoBit erstellt, einem kleinen unabhängigen Studio aus ehemaligen PopCap Mitarbeitern. Ihr erstes Spiel, Burger Shop, wurde im Oktober 2007 veröffentlicht und erhielt aufgrund der großen Nachfrage 4 Monate später eine Webdemo mit dem damals neuen Games Plugin. Ein Jahr verging und die Demo wurde als ein Anzeigenspiel für Eggo überarbeitet, das am 1. Februar 2009 von Shockwave.com veröffentlicht wurde. Das Plugin wurde kurz danach mit der Veröffentlichung von Burger Shop 2 - dessen entsprechende Webdemo Flash verwendete - aufgegeben, sodass Burger Shop und sein Reskin die einzigen Spiele sind, die jemals für ihn erstellt wurden.",
  "Platforms_HotSauce_Description": "Ein Meta Content Framework (MCF) war ein Metadaten-Strukturierungsformat, das von der Advanced Technology Group von Apple Computer ab 1995 entwickelt wurde. 1996 würde Project X ein experimentelles Plugin werden, das erstellt wurde, um sie im Internet anzuzeigen, später HotSauce genannt, die Sitemaps in einem 3D-Raum zeigen. Ende 1996 nutzten mehr als 200 Websites HotSauce, später mehr als 300, und eine Vereinbarung mit NetCarta wurde getroffen, um eine Bibliothek von über 30.000 mit dem Plugin navigierbarer Webseiten zu erstellen. Obwohl der MCF-Standard etwas Lob erlangte, sahen die meisten Nutzer keinen Vorteil für diese 3D-Navigationsmethode, und das Projekt endete als eines der vielen Projekte, die aufgegeben wurden, als Steve Jobs 1997 zu Apple zurückkehrte.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage ist ein Standard für das Anzeigen von Dokumenten über einen Webbrowser. Ursprünglich entwickelt von Tim Berners-Lee in den frühen 1990er Jahren (mit Wurzeln bis 1980), wurde HTML zur ersten Methode, um Informationen über das Internet zu teilen. Ihre Fähigkeiten werden durch andere Sprachen wie CSS und JavaScript erweitert. Sie wurde 1993 veröffentlicht und erhielt anschließend die Aktualisierung mit HTML2 1995 sowie HTML3 und HTML4 1997. Das letzte Update für HTML4 erschien im Jahr 2000 und in den folgenden Jahren wurden die beigefügten Sprachen als Plattform für Spiele, Animationen und andere Webinhalte weitgehend ignoriert. Entwickler entschieden sich stattdessen für Plugin-basierte Technologie, welche aber mit der Entwicklung von Technologie und Internet veralteten. Daher wurde versucht, den Standard zu aktualisieren und im Jahr 2008 wurde HTML5 veröffentlicht. Da Flash und andere Plugins aus dem Stil fielen, wurde HTML5 der empfohlene Standard. Viele haben ihre Projekte auf die HTML-Familie verschoben - oder ihre proprietären Plugins insgesamt aufgegeben - und stattdessen ihre Inhalte auf Websites wie YouTube hochgeladen. {Anmerkung: Aus Gründen der Übersichtlichkeit kennzeichnet Flashpoint alle Einträge, die keine Frameworks oder plugin-fähigen Inhalte enthalten, als \"HTML\".}",
  "Platforms_HyperG_Description": "Hyper-G war ein Gopher-basiertes Web Content Management System (WCMS), das 1995 vom Institut für Informationsverarbeitung und computerunterstützte neue Medien (IICM) der Technischen Universität Graz in Österreich entwickelt. Es war eine Alternative zu den Hyperlinks des World Wide Web unter Verwendung von Hyper-G-fähigen Browsern, die 3D-Modelle von Verzeichnissen und Dateien, sowie andere Modelle, mit einem eingebauten Viewer anzeigen können. Da es auf dem zunehmend veralteten Gopher, dem Vorgänger des WWW, basiert, entwickelte es sich im Jahr 1996 zu Hyperwave ohne die zusätzlichen Möglichkeiten von Hyper-G-Browsern, wie zum Beispiel die 3D-Funktionen. Der größte Teil des Inhalts ist inzwischen verloren gegangen, da die Dateien mit Gopher gespeichert wurden.",
  "Platforms_Hypercosm_Player_Description": "Hypercosm basiert auf seit 1989 in Entwicklung befindlicher Technologie und ist ein 3D-Content-Web-Player, der 1999 veröffentlicht wurde. Das Unternehmen hat eine große Investition getätigt, die sich nicht bezahlt gemacht hat, und wurde eines der vielen Opfer des Dot-com-Crashs. Es wurde 2001 zahlungsunfähig. Das Unternehmen wurde jedoch von ORBITEC gekauft, und dank eines Vertrags mit der NASA gelang es der Firma, wieder Fuß zu fassen und die Arbeit an neuen Projekten bis zur Umstrukturierung 2012 fortzusetzen, als die Entwicklung von ORBITEC auf Eis gelegt wurde, bis ein neuer Geschäftspartner an der Zusammenarbeit mit der Technik interessiert war. Das ist nie geschehen, was dazu führte, dass Hypercosm 2016 eingestellt wurde.",
  "Platforms_Illuminatus_Description": "Noch keine Beschreibung.",
  "Platforms_iPix_Description": "Noch keine Beschreibung.",
  "Platforms_Java_Plugin_Description": "Neben der Programmiersprache Java als eine ihrer Funktionen erschienen, waren Java Applets kleine Anwendungsfenster, die auf Seiten für zusätzliche interaktive Funktionen eingebettet waren. Sie wurden dazu gemacht, auf verschiedenen Betriebssystemen und Browsern kreuzkompatibel sowie leistungsfähiger als HTML zu sein. Es blieb eine leistungsfähige Option für mehr als 10 Jahre, ab 2013 aber begannen die gängisten Browser die den Applets zugrunde liegende Technologie nicht weiter zu unterstützen. Vielen wurden unbrauchbar, was dazu führte, dass sie 2017 veraltet und 2018 aus Java SE 11 entfernt wurden.",
  "Platforms_JCAMPDX_Description": "Noch keine Beschreibung.",
  "Platforms_Lightning_Strike_Description": "Noch keine Beschreibung.",
  "Platforms_LiveMath_Plugin_Description": "Das LiveMath Plugin ist eine Anwendung für interaktive Mathematik und erstellt ein Fenster, das Notizen, Formeln, Grafiken und andere mathematische Funktionen enthalten kann, um diese auf einer Webseite einzubetten. Ursprünglich 1989 als Theorist von der Prescience Corporation gestartet, wurde das Webplugin 1994 veröffentlicht. Später, 1997, wurde es in MathView umbenannt, nachdem es von Waterloo Maple gekauft wurde, bevor es von 1999 MathMonkeys gekauft und in LiveMath umbenannt wurde. 2014 wurde das Plugin aufgrund zunehmender Probleme und fehlender Kompatibilität mit den neuesten Browsern durch ein eigenständiges Programm namens LiveMath Viewer ersetzt.",
  "Platforms_Live_Picture_Viewer_Description": "Noch keine Beschreibung.",
  "Platforms_MHSV_Description": "ParaGraph entwickelte ein Plugin, welches zunächst als Alpha namens VSV ({V}irtual {S}Space {V}iewer) veröffentlicht und später in MHSV ({M}ultimedia {H}ome {S}pace {V}iewer) umbenannt wurde. Es ermöglichte interaktive 3D-Welten, die mit dem VHSB ({V}irtuelle {H}ome {S}pace {B}uilder) erstellt wurden. Dieser konnte sowohl interaktive MHSV- als auch standardisierte, statische VRML-Welten erzeugen. 1996 fügte die Entwicklung des VRML 2.0-Standards Interaktivität hinzu, und ParaGraph aktualisierte VHSB, um die Erstellung von VRML 2.0-Welten zu ermöglichen. Jedoch entschied sich ParaGraph für die Zusammenarbeit mit Silicon Graphics und ihrem Viewer Cosmo VRML 2.0 Player. VHSB wurde angepasst, um mit diesem besser arbeiten zu können. Infolgedessen wurde MHSV aufgegeben. Im Jahre 1997 übernahm Silicon Graphics ParaGraph um Cosmo Software zu gründen.",
  "Platforms_Microsoft_Silverlight_Description": "Von Microsoft als eine Antwort auf Flash und Java entwickelt und 2007 veröffentlicht, ist Silverlight ein Multimedia-Tool, das für Video-Streaming konzipiert war, insbesondere für Netflix. In folgenden Versionen wurden weitere Funktionen für andere Anwendungen implementiert. Mit einer Annahmequote von 64% im Jahr 2011 konnte es sich einer gewissen Beliebtheit erfreuen. Allerdings hat Microsoft die Software im Jahr 2012 mit der Ankündigung des Endes von NPAPI, der Veröffentlichung von Windows 8 und dem Beginn der Einführung von HTML5 veralten lassen. Mit der Veröffentlichung von Windows 10 2015 begann es mit dem End-of-Life-Stadium, bevor es im Oktober 2021 eingestellt wurde.",
  "Platforms_NoteWorthy_Composer_Description": "Noch keine Beschreibung.",
  "Platforms_O2C_Player_Description": "Der o2c Player war ein Web-3D-Plugin als Teil der o2c (\"objects to see\", Objekte zu sehen) Serie zur Darstellung von Objekten und Szenen, welcher 1999 veröffentlicht wurde. Entwickelt wurde er von der deutschen Firma mb Software AG. Die Firma hat die o2c Technologie 2003 an ELECO plc verkauft, die 2005 die Version 2.0 des o2c Player, der wesentlich bessere Leistung durch 3D-Beschleunigung brachte und mehr als CAD-Werkzeug für Architekten angeworben wurde, entwickelt und veröffentlicht hat. Unterstützung für mehr Browser wurde hinzugefügt, aber es wurden keine größeren Updates vorgenommen; diese bestanden stattdessen hauptsächlich aus Fehlerbehebungen. Stand 2021 steht das Plugin noch zum Download zur Verfügung, aber Elcosoft ist auf eine Unity WebGL-Implementierung der Technik umgestiegen.",
  "Platforms_Octree_View_Description": "Beginnend als älteres Plugin namens PicTree Viewer oder PicView, dann als neues Fastview Plugin neu entwickelt, bevor es 1999 umbenannt wurde, ist Octree View ein 3D-Objekt-Viewer. Es basierend auf Voxel-Technologie, die seit mindestens 1980 in der Entwicklung ist und spezielle Kameras sowie Laserscanner zum Erstellen von Bildern nutzt. Das Unternehmen setzte seine Technologie und das Plugin weiterhin ein, aktualisierte seine Website seit 2007 aber und erhielt sie ohne weitere Aktivitäten aufrecht.",
  "Platforms_Pixound_Description": "Pixound war ein künstlerisches Musik-Plugin, das 1996 als Joint Venture von Hologramophone Research und Frankfurt Balkind Partners ins Leben gerufen wurde. Es handelte sich um eine MIDI-Tastatur, die die Farbwerte von Bildern verwendete, um verschiedene Noten und Tonhöhen zu erzeugen. Im Jahr 2003 änderte Hologramophone seinen Namen in Techné Media. Im Jahr 2005 wurde das Plugin zugunsten einer eigenständigen Anwendung ausschließlich für Mac OS X aufgegeben und wurde später im Jahr 2011 zu einer iOS-App.",
  "Platforms_Play3D_DeepV_Description": "Play3D war ein 1996 von Heads Off veröffentlichtes 3D-Plugin. Innerhalb des darauffolgenden Jahres wurde es als DeepV umbenannt und neu veröffentlicht. Neben wenigen Beispielen wurde das Plugin im Laufe seines Lebens wenig genutzt, die Entwicklerwebsite war ab 2001 nicht mehr verfügbar.",
  "Platforms_PointPlus_Description": "PointPlus war ein Plugin für die Einbettung von PowerPoint-Präsentationen im Internet, entwickelt von Net-Scene. Im Mai 1996 wurde es für Windows NT und 95 veröffentlicht. Es positionierte sich als Alternative zu dem komplexeren Macromedia Shockwave, damit Unerfahrene den PowerPoint-Standard nutzen können. Bis November war ein Java-Viewer entwickelt worden, der plattformübergreifend kompatibel war und keine Plugins benötigte. Dieser wurde als Option für Spezialfälle aufbewahrt, aber die Produktlinie wurde ab 1997 nicht mehr aktualisiert, die Webseite wurde Anfang 2001 abgeschaltet.",
  "Platforms_PopCap_Plugin_Description": "Das PopCap Plugin war ein Plugin, um die Demos des Entwicklers PopCap darzustellen. In seinen frühen Tagen nutzte das Unternehmen Java für seine Online-Spieldemos aufgrund seiner Zugänglichkeit. Später wurde die Entwicklung jedoch auf ein firmeninternes Plugin verlagert, das als ActiveX-Steuerung und als traditionelles Firefox-Plugin verfügbar war. Dies gab PopCap den Vorteil, eine eigene proprietäre Plattform für die Demoverteilung zu haben. Allerdings hat die Nichtausschöpfung seines Potentials sowohl von Kunden als auch PopCap selbst dazu geführt, dass der Entwickler 2007 zu dem populäreren Flash wechselte.",
  "Platforms_ProtoPlay_Description": "ProtoPlay war ein Plugin zur Präsentation von Prototypen für die Verbraucherinteraktion mit Produkten und eine Simulation ihrer Funktionen. 1996 erschienen, nutzte es das Altia Design-Autorenprogramm zur Erstellung von Anwendungen bestehend aus 2D Sprites mit interaktiven Elementen. Das Plugin war eher nützlicher Natur und wurde bis Ende 2003 nicht aktiv beworben; es existierte mehr als eine Funktion, die bei Bedarf zur Verfügung stand. Altia Design und das Plugin erhalten ständig Updates zur Verbesserung der Funktionen und 2007 wurde ein neues Tool namens PhotoProto veröffentlicht, das es Photoshop ermöglichte, Plugin-Apps zu erstellen. Im Jahr 2009 hat Altia Inc. ihren Fokus auf die Gestaltung von Benutzeroberflächen verlagert und damit den Prototyping-Aspekt der Software zusammen mit ProtoPlay hinter sich gelassen.",
  "Platforms_Pulse_Player_Description": "Mit der Entwicklung beginnend im Jahr 1997 unter dem Namen 3rd Degree, war Pulse Player ein 3D-Plugin mit Schwerpunkt auf Animation. Es wurde 1999 erstmals mit der Finanzierung und Unterstützung mehrerer erfahrener Mitglieder im Bereich der Internetmedien veröffentlicht und wurde von mehreren namhaften Kunden verwendet. Das Plugin wurde als unterhaltsame und kreative Medienplattform vermarktet und schien erfolgreich zu sein, aber zu Beginn des Jahres 2001 verschoben sich die Ziele des Unternehmens; der Player sollte als ernstzunehmendes Geschäfts- und Bildungswerkzeug aufgenommen werden. Im Jahr 2003 wurde mit 5.2 die letzte Version veröffentlicht und kurz nachdem die Unterstützung aufgegeben.",
  "Platforms_REBOL_Plugin_Description": "REBOL ist eine Programmiersprache, die seit 20 Jahren entwickelt und 1997 veröffentlicht wurde. Im Jahr 2004 wurde neben einer Seite mit mehreren Beispielen ein experimenteller Prototyp für ein REBOL-Web-Plugin erstellt. Das Plugin startete als ActiveX allein für den Internet Explorer. Später, im Jahr 2006, wurde auch eine Plugin-Version für andere Browser veröffentlicht. Kurz darauf wurde jedoch das letzte Update veröffentlicht, sodass es in einer Beta als unsicherer Prototyp blieb.",
  "Platforms_ShiVa_Web_Player_Description": "Von Stonetrip erstellt und vor 2007 mit dem Namen Ston3D Web Player benannt, war ShiVa Web Player ein 3D-Web-Content-Plugin für die Ausführung von Software in der ShiVa 3D Engine. Es ermöglichte komplexe 3D-Szenen mit Beleuchtung und Physik mit geringen Leistungsanforderungen. Stonetrip benannte sich im Jahr 2013 in ShiVa Technologies SAS um und konzentrierte sich ausschließlich auf die Engine. Mit der Entfernung von NPAPI von den meisten Browsern verringerte sich die Unterstützung für das Plugin, was 2018 zu dem Verschwinden von URLs zu mehreren Kerndateien führte. Die meisten Spiele funktionierten damit nicht weter und im Jahr 2019 wurde der Download von ShiVas Website entfernt.",
  "Platforms_Show_It_Description": "Show It! war ein 1997 mit WordPerfect Suite 8 eingeführtes Plugin als eine der Funktionen von Corel Presentations 8, ein Konkurrenten von PowerPoint. Beim mit der Option Internet Publisher konnten die Präsentationen entweder als statische Slideshow oder als eingebetteter Projektor, der eine proprietäre Datei verwendet, die genau wie die ursprüngliche Desktop-App funktioniert und dabei alle Funktionen beibehält, die das Plugin benötigt, exportiert werden. Es wurde weiterhin in WordPerfect Office 2000 mit Presentations 9 unterstützt. 2001 wurde die Unterstützung für die Plugin-Option aus Presentations 10 in WordPerfect Office 2002 gestrichen.",
  "Platforms_SmoothMove_Panorama_Description": "Noch keine Beschreibung.",
  "Platforms_Squeak_Etoys_Description": "Squeak war eine Open-Source-Plattform, die 2001 ins Leben gerufen wurde, um Unterhaltungs- und Bildungsinhalte zu schaffen. Benutzer konnten kleine Anwendungen für Kinder verschiedener Altersgruppen erstellen, von den jüngsten sogenannten \"Etoys\", über \"Omniuser\" bis \"Expert\". 2008 wurde es in Etoys umbenannt und eher auf jüngere Kinder zugeschnitten. Etoys 5 war die letzte Version des Plugins, die 2012 veröffentlicht wurde. Die Entwicklung einer JavaScript-Version des Programms begann 2013 nach Sicherheitsbedenken, sodass das Plugin aufgegeben und durch diese ersetzt wurde.",
  "Platforms_Superscape_Viscape_Description": "1996 von dem frühen 3D-Pionier Superscape mit Unterstützung von Intel veröffentlicht und ursprünglich VisNet genannt, war Viscape ein 3D-Plugin, das den klaren Vorteil der Interaktivität mit Welten hatte, im Gegensatz zu den statischen Modellen von VRML 1.0. Es genoß eine kurze Zeit der Popularität und zunächst gab es keine Pläne zur Unterstützung von VRML. Stattdessen implementierte VRML97 Interaktivität und 1998 wurde ein Update namens Viscape Universal veröffentlicht, das VRML-Unterstützung hinzufügte, um relevant zu bleiben. Dies erwies sich wegen finanzieller Schwierigkeiten, gescheiterter Partnerschaften und Kritiken, die das Plugin, trotz Superscapes Bemühungen um eine Wiederbelebung, als veraltet und umständlich bezeichneten als nicht ausreichend. Obwohl das letzte Update im Jahr 2000 veröffentlicht wurde, wurde die Technologie weiterhin in der Lego Creator Serie von Superscape für das folgende Jahr verwendet. Es wurde versucht, das Plugin durch Einbetten in Java Applets namens Vislite zu aktualisieren, am Ende aber konzentrierte sich das Unternehmen auf die Entwicklung von Handyspielen und erzielte einen moderaten Erfolg, bevor es von Glu Mobile im Jahr 2008 erworben wurde.",
  "Platforms_Surround_Video_Description": "Noch keine Beschreibung.",
  "Platforms_SVF_Viewer_Description": "Noch keine Beschreibung.",
  "Platforms_Tcl_Plugin_Description": "Entwickelt von einem kleinen Team, das 1988 ins Leben gerufen wurde, ist Tool Command Language (Tcl, ausgesprochen „tickle“) eine quelloffene Dynamische Programmiersprache. 1994 brachte Sun Microsystems das Team ein, um die Technologie weiter zu entwickeln. Eines der Ergebnisse dieses Vorhabens war ein Plugin von 1996, das Tcl Applets („Tclets“) in Seiten einbetten konnte. Ende 1997 wurde Tcls Entwicklung an eine eigenständige Firma namens Scriptics weitergeleitet und im Jahr 2000 wieder in das Tcl Core Team aufgenommen. Während sich die Entwicklung der Sprache bis heute fortsetzt, hat sich die Arbeit an dem Plugin zwar stark verlangsamt, wurde aber nicht offiziell eingestellt. Die neuste Version, 3.1.0, wurde 2006 veröffentlicht.",
  "Platforms_ThingViewer_Description": "ThingViewer war ein 1997 von Parable Corporation entwickeltes Multimedia-Plugin, das 1998 den Namen in ThingWorld änderte. Es machte \"Things\", Objekte, die optional vor Diebstahl oder Manipulation geschützt werden konnten und eine einzigartige ID mit Anerkennung hatten, die mit einfacher modularer Programmierung auf Websites geteilt werden konnte. Mit dem ThingMaker-Authorenprogramm konnten Dinge wie Bilder, Animationen und sogar interaktive Spiele erstellt werden. Außerdem konnten Shockwave Director-Dateien mit ThingConverter konvertiert werden. Es war relativ populär, sogar Abkommen mit Microsoft und Weiteren wurden im Jahr 1999 getroffen. Ende 2000 reduzierte das Unternehmen seine Belegschaft und war in Gesprächen mit unbekannten Beeiligten für eine Fusion zum Verkauf der Technik. Die Website wurde 2002 abgeschaltet.",
  "Platforms_Unity_Web_Player_Description": "Die Unity Engine ist eine plattformübergreifende Spiele-Engine, die darauf abzielt, die Spielentwicklung zugänglicher zu machen, und ist die beliebteste Drittanbieter-Spieleentwicklungssoftware unter Entwicklern weltweit. Gemeinsam mit Unity selbst erstellt und im ersten Patch 2005 implementiert wurde mit Unity Web Player ein Tool, um Unity-Spiele im Internet zu spielen. Es blieb eine beliebte Plattform für 3D-Spiele, aber mit dem Wegfall der NPAPI-Unterstützung im Jahr 2016 wurde das Plugin zugunsten von Unity WebGL eingestellt.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap war ein Werkzeug zur Visualisierung interaktiver Karten, eingebettet in eine Website. Es war mit mehreren Kartendateien aus verschiedenen Autorenprogrammen kompatibel, konnte detaillierte Informationen über Sektoren anzeigen und ermöglichte Messungen durchzuführen. Nach dem Start im Jahr 1997 wurden keine weiteren Entwicklungen mit der Technologie vorgenommen, bis die Seite im Jahr 2004 abgeschaltet wurde.",
  "Platforms_Vitalize_Description": "1997 von Corel für die Darstellung von Inhalten mit dem Click&Create Multimedia-Autorenprogramm erstellt, war Vitalize! ein Plugin mit niedriger Bandbreite für einfache Web-Spiele mit einem Schwerpunkt auf Spielen, Marketing und Werbung. Es wurde mit Hilfe von Europress vertrieben. Es zeichnete sich selbst damit aus, „im Gegensatz zu Java oder Schockwelle einfach zu lernen und zu verwenden\" zu sein. Irgendwann im Jahr 1999 gründeten die ehemaligen Corel-Mitarbeiter Clickteam, das die Entwicklung im Jahr 2000 mit der Version 2.0 übernahm. Die neueste Version 4.0 wurde 2007/2008 veröffentlicht und war bis 2012 auf ihrer Website verfügbar.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage it ein offener 3D-Standard und der allererste für das Web. Als er ursprünglich im November 1994 spezifiziert wurde, konnte das Format nur statische Modelle ohne Interaktivität darstellen. Dieses Problem wurde 1997 gelöst, als die Version 2.0, besser bekannt als VRML97, veröffentlicht wurde. Obwohl es nie eine allgemeine Anwendung gab, würde es zur Veröffentlichung die beliebteste Option für internetbasierte 3D-Inhalte werden, bevor es 2001 durch X3D ersetzt wurde (was rückwärtskompatibel mit VRML-Welten war). Da es ein Dateiformat und kein Plugin an sich war, wurde VRML auf viele verschiedene Arten implementiert, oft mit eigenen, nicht-standardmäßigen Features.",
  "Platforms_X3D_Description": "Noch keine Beschreibung.",
  "Platforms_Xara_Plugin_Description": "Das Xara Plugin war ein Vektorgrafik-Viewer, der ein proprietäres Format mit geringer Bandbreite verwendete. Es startete als Beta und eine spätere Vollversion, die in der Lage war, mit CORELXara erstellte Flare-Dateien im Web darzustellen, wurde im Jahr 1996 veröffentlich. Später, 1997, wurde Xara Webster speziell dafür veröffentlicht, um Webgrafiken für das Plugin zu erstellen. 1999 wurde mit 2.08a die letzte Version veröffentlicht. Ein Jahr später, 2000, wurde Xara Webster durch XaraX ersetzt, das zu Flash, einem anderen Vektor-Plugin, exportieren konnte; so wurde die Unterstützung für ihre eigene proprietäre Option eingestellt und in das Legacy-Software-Archiv verwiesen.",
  "Platforms_Coming_Soon": "Demnächst",
  "Platforms_Coming_Soon_Description": "Spiele und Animationen, die auf diesen Plattformen erstellt wurden, werden im nächsten Update verfügbar sein.",
  "Platforms_Common_Ground_Description": "Noch keine Beschreibung.",
  "Platforms_DjVu_Description": "Noch keine Beschreibung.",
  "Platforms_Jamagic_Description": "Noch keine Beschreibung.",
  "Platforms_Jutvision_Description": "Noch keine Beschreibung.",
  "Platforms_mBed_Description": "Noch keine Beschreibung.",
  "Platforms_MrSID_Description": "Noch keine Beschreibung.",
  "Platforms_PanoramIX_Description": "Noch keine Beschreibung.",
  "Platforms_Petz_Player_Description": "Noch keine Beschreibung.",
  "Platforms_Sibelius_Scorch_Description": "Noch keine Beschreibung.",
  "Platforms_Sizzler_Description": "Noch keine Beschreibung.",
  "Platforms_Ulead_COOL_360_Description": "Noch keine Beschreibung.",
  "Platforms_VReam_WIRL_Description": "Noch keine Beschreibung."
}