{
  "Discord_Title": "Discord",
  "Discord_Intro": "Si prega di leggere le regole prima di unirsi al nostro server Discord (possono anche essere visionate in {#rules-and-faq} una volta entrato):",
  "Discord_Rule1": "Rispetta le regole di Discord, e le nostre: {https://discordapp.com/terms} / {https://discordapp.com/guidelines}.",
  "Discord_Rule2": "Sii rispettoso verso gli altri. Non essere bigotto, non incitare dramma, non agire in modo odioso, non menzionare utenti/ruoli ripetutamente, e non inviare DM ai membri del server (staff incluso) senza permesso.",
  "Discord_Rule3": "Discuti gli argomenti nei loro canali designati. Leggi sempre la descrizione se non sei completamente sicuro del suo scopo. Se un membro dello staff ti chiede di spostare la conversazione, per cortesia fallo.",
  "Discord_Rule4": "Non è consentita la distribuzione di contenuti che sono attualmente in vendita o la cui rimozione da Flashpoint è stata richiesta.",
  "Discord_Rule5": "{Never send emails relating to Flashpoint without the consent of staff, no matter how good you think it is.} Nessuno vuole che la possibilità di contattare uno sviluppatore vada sprecata, ecco perché vogliamo assicurarci che non accada.",
  "Discord_Rule6": "Pubblicizzare te stesso o affiliati tramite inviti Discord, link di YouTube, imprese a scopo di profitto o simili è vietato a meno che non sia nel contesto di Flashpoint o archiviazione digitale.",
  "Discord_Rule7": "Contenuto rischioso e relative discussioni devono essere tenuti in {#nsfw-lounge} (la sola esistenza del canale dovrebbe spiegare più che abbastanza).",
  "Discord_Rule8": "Non c'è posto per parlare di politica in questo server. Spostate la discussione da qualche altra parte o non discutetene affatto.",
  "Discord_Curation_Exception": "(Curare - specifiche discussioni, incluso il contenuto - sono l'unica eccezione alle regole 7 e 8)",
  "Discord_Sanctions": "Il personale può ammonire/silenziare/espellere/bannare gli utenti che essi ritengono violino queste regole in base alla severità della regola infranta. Incoraggiamo il personale a mostrare clemenza per le prime volte o per infrazioni accidentali delle regole, ma più infrazioni comporteranno pene più severe.",
  "Discord_Agreed": "Ho letto le regole e voglio unirmi al server!"
}