{
  "FAQ_Title": "Domande Frequenti",
  "FAQ_Question1": "Questo non era stato chiamato Flashpoint di BlueMaxima?",
  "FAQ_Answer1": "Sì - il progetto utilizzato per operare con BlueMaxima in nome fino al suo ritiro dal progetto nel gennaio 2023.",
  "FAQ_Question2": "Quali sistemi operativi sono supportati?",
  "FAQ_Answer2": "Flashpoint supporta Windows 7 SP1 e successivi (Windows 8 stock escluso). Sono disponibili anche versioni per MacOS e Linux; queste però richiedono ulteriori passaggi per essere installate e possono eseguire solo alcune delle più popolari tecnologie da browser.",
  "FAQ_Question3": "Flashpoint costituisce problemi di sicurezza?",
  "FAQ_Answer3": "Non che ne sappiamo. L'intero gruppo di applicazioni (tranne la tecnologia per scaricare giochi in Infinity) non può connettersi apertamente Internet; ogni modifica apportata al registro di sistema da Flashpoint Secure Player viene rimossa una volta chiuso il gioco; tutti i giochi curati passano attraverso un PC dotato di software antivirus competente e aggiornato; e soprattutto, il launcher e tutti i lavori interni di Flashpoint sono open-source e possono essere trovati {here}. Abbiamo fatto del nostro meglio per garantire che la collezione sia sicura, ma nonostante i nostri sforzi, alcuni antivirus come Avast e AVG tendono a rilevare componenti importanti come pericolosi. Se hai questo problema, visita la risoluzione dei problemi {read this page}.",
  "FAQ_Question4": "Quanti giochi/animazioni ci sono?",
  "FAQ_Answer4": "Flashpoint offre attualmente oltre {} giochi e {} animazioni. Puoi cercare la collezione senza scaricare Flashpoint {here}.",
  "FAQ_Question5": "Quali piattaforme del browser preservano su Flashpoint?",
  "FAQ_Answer5": "Preserviamo i giochi e le animazioni in esecuzione su ogni piattaforma elencata al Flashpoint Database {statistics page}.",
  "FAQ_Question6": "Dove sono i giochi di Nitrome?",
  "FAQ_Answer6": "Nitrome ci ha gentilmente chiesto di rimuovere i loro contenuti dalla collezione. Se stai cercando di giocare ai loro giochi, fallo sul loro {website}, e se Flash non funziona, segui il loro  {HTML5-compatible catalog}. {Flashpoint does not condone harassment over Nitrome's decision.}",
  "FAQ_Question7": "Come posso richiedere un gioco/animazione?",
  "FAQ_Answer7": "È possibile fare una richiesta prima leggendo {this article} fino in fondo, quindi seguendo i collegamenti in basso.",
  "FAQ_Question8": "Posso aggiungere io stesso un gioco/animazione?",
  "FAQ_Answer8": "Sì! Segui le istruzioni elencate in {curation tutorial} per impostare l'audizione del curatore. Una volta che è accettato, è possibile inviare quante più curazioni desiderate.",
  "FAQ_Question9": "Voglio contribuire in qualche altro modo (codifica, test, ecc). Come posso aiutare?",
  "FAQ_Answer9": "Unisciti al nostro {Discord server} per maggiori dettagli. La maggior parte del nostro lavoro e delle nostre comunicazioni avviene lì.",
  "FAQ_Question10": "Flashpoint è open source?",
  "FAQ_Answer10": "Più o meno. I file sorgente della nostra tecnologia su misura come il launcher sono tutte disponibili presso il nostro {GitHub}. Le fonti per il software che includiamo in Flashpoint sono disponibili nei loro rispettivi siti web (non modifichiamo la fonte di alcun software che includiamo). I binari per le plugin web stesse non sono open source, ma se lo fossero, non saremmo qui del tutto.",
  "FAQ_Question11": "Posso usare il logo/è disponibile con Creative Commons?",
  "FAQ_Answer11": "Sì - il logo cade sotto la licenza {CC-BY 4.0}. Per l'attribuzione, è possibile accreditare Seirade e Flashpoint. I file sorgente possono essere trovati {here}.",
  "FAQ_Question12": "Dove posso donare al progetto?",
  "FAQ_Answer12": "Flashpoint Archive opera come un non-profit collettivo. Puoi trovare maggiori dettagli su come donare e dove il tuo denaro va sul nostro {Open Collective page}.",
  "FAQ_Question13": "Flashpoint non funziona correttamente!",
  "FAQ_Answer13": "Segui i passaggi per la risoluzione dei problemi elencati qui {manual}. Se in seguito hai ancora problemi, chiedi aiuto nel nostro Discord.",
  "FAQ_Question14": "Voglio un gioco/animazione rimosso/a da Flashpoint per un motivo o per un altro.",
  "FAQ_Answer14": "Avvisaci, o tramite il nostro Discord o {directly by email}. Probabilmente cercheremo di convincervi a farci tenere il vostro gioco a scopo di archiviazione storica, ma non siamo irragionevoli.",
  "FAQ_Question15": "Ho un'altra domanda.",
  "FAQ_Answer15": "Consulta la nostra {extended FAQ}. Se la tua domanda non trova risposta, unisciti al nostro Discord."
}