{
  "About_Welcome": "Benvenuti",
  "About_Title": "Flashpoint Archive è uno sforzo della comunità per preservare i giochi e le animazioni dal web.",
  "About_Para1": "La storia e la cultura di Internet sono importanti, e il web si sta evolvendo a un ritmo così rapido che quello che oggi potrebbe essere un luogo comune potrebbe essere obsoleto domani. Questo progetto è dedicato a preservare il maggior numero possibile di esperienze da queste piattaforme, in modo da non perdersi nel tempo. Da dicembre 2017, {over {} giochi e animazioni} sono stati preservati attraverso più di un centinaio di browser plugin e tecnologie web.",
  "About_Para2": "Oltre ai nostri sforzi di conservazione, forniamo anche un pacchetto software altamente flessibile per una navigazione affidabile e la riproduzione di contenuti conservati. Tra i software che alimentano Flashpoint è {a fully-featured launcher} che funge da frontend per la raccolta, {a proxy} che inganna i giochi a pensare che sono in esecuzione sul live web, e {a sandbox} che consente la riproduzione sicura di contenuti abilitati al plugin - tutti che sono {open-source software}.",
  "About_Para3": "Il progetto {was originally started} di BlueMaxima nel tentativo di sconfiggere la scomparsa dei giochi web prima della morte di Flash. Da allora si è trasformata in una grande impresa che coinvolge centinaia di collaboratori comunitari provenienti da tutto il mondo, che comprende giochi e animazioni creati per numerosi plugin, framework e standard internet.",
  "About_Para4": "Flashpoint Archive opera come non-profit con l'obiettivo di promuovere gli sforzi per la conservazione e l'accessibilità dei giochi, animazioni e altre esperienze digitali interattive dal web. Se vuoi supportarci o saperne di più su come siamo finanziati e dove questi fondi sono spesi, si prega di utilizzare il pulsante Dona nella barra laterale sinistra o visitare il nostro {Open Collective page}.",
  "Search_Collection": "Cerca nella Collezione",
  "Request_Archival": "Richiedi Contenuto per l'Archiviazione"
}