{
  "About_Welcome": "Benvenuti",
  "About_Title": "BlueMaxima's Flashpoint è un progetto di preservazione di giochi web.",
  "About_Para1": "La storia e la cultura di Internet sono importanti e i contenuti realizzati sulle piattaforme web, inclusi, ma non solo a Adobe Flash, costituiscono una parte significativa di quella cultura. Questo progetto è dedicato a preservare il maggior numero possibile di esperienze da queste piattaforme, in modo da non perdersi nel tempo. Dall'inizio del 2018, Flashpoint ha salvato {} giochi e {} animazioni in esecuzione su {} diverse piattaforme.",
  "About_Para2": "Flashpoint è stato avviato nel gennaio 2018 da BlueMaxima, nel tentativo di contrastare la scomparsa di contenuto prima della fine di Flash. Da allora si è evoluto in un progetto internazionale che ha coinvolto oltre 100 collaboratori della comunità, e che comprende giochi web e animazioni creati con numerose plugin, framework e standard.",
  "About_Para3": "Flashpoint utilizza una vasta selezione di software open-source. Combinando la potenza di Apache, un launcher personalizzato, e la nostra applicazione chiamata Flashpoint Secure Player, possiamo eseguire media basati sul web in un ambiente rapido e facile da usare senza causare cambiamenti permanenti o buchi nella sicurezza nel tuo computer.",
  "About_Para4": "Offriamo due versioni del software; Ultimate, che contiene ogni media in un formato pronto per l'utilizzo offline, e Infinity, una versione più piccola che consente di scaricare ed eseguire  contenuti su richiesta. Entrambe le versioni non sono influenzate dalla fine del supporto per Flash e altre plugin.",
  "About_Para5": "Questo progetto è e sarà sempre del tutto privo di scopo di lucro, per preservare il senso di comunità e condivisione proprio di Flash e simili. Per saperne di più su Flashpoint, fare riferimento alla barra laterale sulla sinistra della pagina.",
  "Search_Collection": "Cerca nella Collezione",
  "Request_Archival": "Richiedi Contenuto per l'Archiviazione"
}