{
  "News_Title": "Notizie",
  "News_Description": "Tutti gli eventi importanti nella storia di Flashpoint fino ad ottobre 2019.",
  "News_Flashpoint_Started": "BlueMaxima's Flashpoint viene fondato.",
  "News_Flashpoint_0": "Flashpoint Zero viene pubblicato.",
  "News_Flashpoint_1": "Flashpoint Version One viene pubblicato.",
  "News_Was_Released": "è stato pubblicato",
  "News_Flashpoint_3_0": "Keys to the Kingdom",
  "News_Flashpoint_3_0_Meta": "Questa versione ha introdotto Redirector, l'ultimo pezzo del puzzle necessario per far funzionare il setup del server - permettendoci di preservare il 99,9 % di giochi Flash senza modificarli. Le chiavi per il regno della preservazione di Flash, se volete metterla così.",
  "News_Flashpoint_3_1": "Opening Night",
  "News_Flashpoint_3_1_Meta": "Questa versione è stata la prima ad avere Flashpoint Theatre (anche se all'epoca si trattava di una istanza a parte di LaunchBox).",
  "News_Flashpoint_3_2": "Shock and Awe",
  "News_Flashpoint_3_2_Meta": "Questa versione è stata la prima a supportare i titoli Shockwave.",
  "News_Flashpoint_3_3": "Ultra HD",
  "News_Flashpoint_3_3_Meta": "Chiamata così per il fatto che avevamo superato i 4.000 giochi nella collezione a quel punto. Ragazzi, come vola il tempo.",
  "News_Flashpoint_4_0": "The Living Infinite",
  "News_Flashpoint_4_0_Meta": "Questa versione ha introdotto Flashpoint Infinity, che consente di scaricare giochi da internet. Il nome è preso dall'album di Soilwork del 2013, dallo stesso nome.",
  "News_Flashpoint_4_1": "Javality",
  "News_Flashpoint_4_1_Meta": "Questa è stata la versione che ha introdotto il supporto per le applicazioni Java. DarkMoe ne inventò il nome.",
  "News_Flashpoint_5_0": "Go For Launch",
  "News_Flashpoint_5_0_Meta": "Questa versione introdusse il launcher che tutti noi conosciamo e amiamo.",
  "News_Flashpoint_5_1": "The Great Filter",
  "News_Flashpoint_5_1_Meta": "In questa versione furono aggiunte le scalette (un filtro, se volete metterla così). Il nome viene dall'EP dei Mesarthim, The Great Filter.",
  "News_Flashpoint_5_2": "Type III",
  "News_Flashpoint_5_2_Meta": "The Great Filter and Type III sono due EP dei Mesarthim che vengono spesso associati.  Nessun altro nome venne in mente quando fu ora di trovarne uno.",
  "News_Flashpoint_5_3": "Revolution",
  "News_Flashpoint_5_3_Meta": "Questa versione è stata pubblicata poco prima del primo anniversario di Flashpoint e ritenemmo fosse davvero una rivoluzione. (Originariamente destinata ad essere chiamata 'Orbit', ma era un nome stupido per questo concetto.)",
  "News_Flashpoint_5_4": "Recombination",
  "News_Flashpoint_5_4_Meta": "In questa versione le animazioni furono spostate insieme ai giochi, che in precedenza erano in cartelle separate con client separati. 'Recombination' e '74%' sono anche il nome di due brani dell'album dei Mesarthim The Density Parameter.",
  "News_Flashpoint_5_4_1": "74%",
  "News_Flashpoint_5_4_1_Meta": "Una rapida serie di patch fatte contemporaneamente al caricamento di 5.4. Non è che Flashpoint 5.4 era stato completato solo al 74% quando lo abbiamo pubblicato.",
  "News_Flashpoint_5_5": "Iron & Copper",
  "News_Flashpoint_5_5_Meta": "BlueMaxima stava giocando un po' troppo a Deus Ex all'epoca.",
  "News_Flashpoint_6_0": "Alignment",
  "News_Flashpoint_6_0_Meta": "Un altra citazione dei Mesarthim!",
  "News_Flashpoint_6_1": "Preservationware",
  "News_Flashpoint_6_1_Meta": "Un gioco di parole con dei termini relativi a software comunemente utilizzati in tecnologia, come 'freeware' e 'shareware'.",
  "News_Flashpoint_6_2": "Moe's Great Escape",
  "News_Flashpoint_6_2_Meta": "Il membro dello staff DarkMoe curò una quantità veramente folle di giochi di fuga-dalla-stanza per questa versione.",
  "News_Flashpoint_6_3": "Stiamo parlando di Giochi Flash, Non di filosofia astratta",
  "News_Flashpoint_6_3_Meta": "Nome tratto da una brusca frase di nosamu, un membro dello staff.",
  "News_Old_Releases_Title": "Timeline retroattiva delle uscite",
  "News_Old_Releases_Description": "Siccome una rubrica di notizie esiste solo dal dicembre 2019, la maggior parte delle versioni fino a quel punto sono rimaste non catalogate. Questa sezione tratta quelle versioni mancanti.",
  "News_Is_Available": "è ora disponibile!",
  "News_Grab_Download": "Prendilo da {downloads page}",
  "News_Flashpoint_Update_October_2019": "L'aggiornamento dello stato di Flashpoint per Ottobre 2019 è ora disponibile su Medium. Dai un'occhiata {here}.",
  "News_Flashpoint_Update_November_2019": "L'aggiornamento dello stato di Flashpoint per Ottobre 2019 è ora disponibile su Medium. Dai un'occhiata {here}.",
  "News_Flashpoint_7_0": "Eight Thousand Hours",
  "News_Flashpoint_7_0_Meta": "Ottomila ore era più o meno il tempo che rimaneva a Flash prima della fine del supporto, quando la versione fu pubblicata.",
  "News_Flashpoint_7_1": "Stay on Target",
  "News_Flashpoint_7_1_Meta": "Per i nostri standard Flashpoint 7.0 fu un disastro. 7.1 fu una versione con una cospicua quantità di bugfix.",
  "News_Featured_Kotaku_Link": "Kotaku ha parlato di noi!",
  "News_Featured_Kotaku_Rest": "Questo è un'importante traguardo. Grazie per il supporto!",
  "News_Flashpoint_Update_March_2020": "L'aggiornamento dello stato di Flashpoint per Marzo 2020 è ora disponibile su Medium. Dai un'occhiata {here}.",
  "News_Flashpoint_Update_April_2020": "L'aggiornamento dello stato di Flashpoint per Aprile 2020 è ora disponibile su Medium. Dai un'occhiata {here}.",
  "News_Flashpoint_8_0": "301",
  "News_Flashpoint_8_0_Meta": "Questa versione vide la fine dell'utilizzo del software redirector, precedentemente usato per far funzionare il server. HTTP Code 301 fu 'spostato permanentemente', nel senso che non reindirizza pìù.",
  "News_Flashpoint_Update_June_2020": "Il mini-aggiornamento dello stato di Flashpoint per Giugno 2020 è ora disponibile su Medium. Dai un'occhiata {here}.",
  "News_Flashpoint_8_1": "Spirit of Adventure",
  "News_Flashpoint_8_1_Meta": "Il nome viene da un verso di un album degli Aether Realm (allora recente), Redneck Vikings from Hell. Nello specifico, il brano 'One Hollow Word'.",
  "News_Flashpoint_Update_August_2020": "L'aggiornamento dello stato di Flashpoint per Agosto 2020 è ora disponibile su Medium. Dai un'occhiata {here}.",
  "News_Flashpoint_8_2": "Approaching Planet Nine",
  "News_Flashpoint_8_2_Meta": "Una parola macedonia (tirata, lo concedo) composta da 'approaching version nine' e Planet Nine, l'EP dei Mesarthim.",
  "News_Flashpoint_9_0": "Glorious Sunset",
  "News_Flashpoint_9_0_Meta": "Chiamata così per Glorious Morning, la canzone meglio conosciuta per essere presente in Age of War. Questa fu l'ultima versione pubblicata prima della fine di Flash, da qui 'sunset' (tramonto).",
  "News_Flashpoint_Update_April_2021": "L'aggiornamento dello stato di Flashpoint per Aprile 2021 è ora disponibile su Medium. Dai un'occhiata {here}.",
  "News_Flashpoint_10_0": "Absence",
  "News_Flashpoint_10_0_Meta": "La prima versione pubblicata in un internet post-Flash, da qui il nome 'Absence' (assenza). È anche il nome dell'ultimo brano dell'EP dei Mesarthim 'Vacuum Solution'.",
  "News_Flashpoint_10_1": "Absence II",
  "News_Flashpoint_10_1_Meta": "Avanti, indovina.",
  "News_Flashpoint_11": "Oops, All Plugins!",
  "News_Flashpoint_11_Meta": "Una sorta di meme, perché con la versione 11 sono state aggiunte tre dozzine di nuove plugin.",
  "News_Flashpoint_11_1": "Operazione Cherry Blossom",
  "News_Flashpoint_11_1_Meta": "Un riferimento al gioco Muv-Luv (andate a comprarlo su Steam)."
}