{
  "Platforms_Title": "Piattaforme Supportate",
  "Platforms_Description1": "Flashpoint supporta giochi e animazioni creati per una varietà di plugin e standard di internet - non solo Flash. Questa pagina contiene una panoramica di ogni tecnologia, insieme al rispettivo numero di voci per ciascuna, presenti nella versione 11.",
  "Platforms_Description2": "Serve come un indice \"Chi? Quando? Cosa?\" e punto di partenza per ulteriori ricerche, non è una storia esauriente per ogni piattaforma. Facciamo del nostro meglio per presentare i fatti accuratamente, ma sono sempre possibili errori. Contattateci cortesemente con informazioni rilevanti per eventuali correzioni.",
  "Platforms_By": "da",
  "Platforms_3D_Groove_GX_Description": "Fondata nel 1998, The Groove Alliance sviluppò 3D Groove SX, un motore 3D per giochi basato su Shockwave. Nel 2002, si separò da Shockwave, fu messa in proprio e chiamata 3D Groove GX. Entrambe le varianti potevano essere usate per sviluppare giochi e programmi per desktop. Questo portò un successo alla compagnia, creando una grande base di utenza e portando alla creazione di diversi titoli importanti per programmi televisivi e altri grandi nomi. Dopo che l'euforia svanì, The Groove Alliance fu ricostituita come OTOY nel 2008, ma il sito 3D Groove rimase online fino al 2009. L'esatta causa della disfatta della compagnia originale è sconosciuta, ma fu confermato che ci furono disaccordi interni.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (nota prima come 3D Life Player, Virtools Player, e NeMo Web Player, da non confondersi con 3DVIA Studio/Beta Player o 3DVIA Composer Player) era una plugin per browser di Dassault Systèmes per la riproduzione di contenuti 3D creati in Virtools. Fu sviluppata per programmi 3D avanzati e pratici come allenamenti basati su computer, tour virtuali e beni immobili. 3DVIA Player fu anche usato per giochi di internet, e aveva fra i suoi principali utilizzatori lo studio Sarbakan del Quebec la Little Chicken Game Company di Amsterdam. L'ultimo aggiornamento, versione 5.0, fu pubblicata nel 2009. La pagina dei download rimase online negli anni a venire finché fu ritirata nel 2016. A quel momento, fu installata più di 30 milioni di volte.",
  "Platforms_AboutPeople_Description": "Ancora nessuna descrizione.",
  "Platforms_AboutTime_Description": "Ancora nessuna descrizione.",
  "Platforms_ActiveX_Controls_Description": "Pubblicata nel 1996 per Microsoft, ActiveX era un framework software che serviva come standard per incapsulare programmi come contenitori per l'uso in altri programmi non correlati, chiamati ActiveX Controls. Potevano essere incorporati (embed) in contenuti HTML, e controlli per l'uso singolo potevano essere creati specificatamente per Internet Explorer, per lo scopo di eseguire giochi sul web. Dopo il lancio di Edge nel 2015, il software fu ritenuto obsoleto e il suo uso per applicazioni web sembra essere cessato, relegandolo ad Internet Explorer 11 per il supporto software legacy.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Atmosphere Player cominciò il suo sviluppo nel 1996 come V30 da Rocket Science Games, fu poi trasferita ad Attitude Software e rinominata 3D Anarchy, e fu poi venduta ad Adobe nel 2000 e rinominata nel 2001 come Atmosphere. Atmosphere è una plugin web fatta per la visione di mondi 3D interattivi, in modo simile allo standard VRML, creati con Atmosphere Builder. Fu più che altro creata per gallerie multimediali virtuali, che potevano presentare immagini/audio/video e i modelli 3D stessi. Quando fu inizialmente creata come 3D Anarchy, il software era inizialmente ancora Beta quando Adobe acquistò la tecnologia per svilupparla ulteriormente, dopodiché passò i successivi tre anni in collaudo beta e l'ultima versione 1.0 della plugin fu pubblicata nel Febbraio del 2004. Nel Dicembre 2004 fu annunciato che Atmosphere sarebbe stata abbandonata, e il supporto cessò nel Gennaio 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (anche solo Flash, noto prima come Macromedia Shockwave Flash Player) è un lettore per animazioni vettoriali e grafiche, spesso con aggiunta interattività. Era usata come media per giochi web per la sua compressione efficace, basso prezzo, facilità di utilizzo e diffusione di utilizzo. Sviluppato nel 1995 ed inizialmente introdotto da FuturWave nel 1996, era capace di poco più di animazioni basilari e pulsanti per controllarle. Acquistando popolarità, funzioni più avanzate furono aggiunte al lettore. come il linguaggio ActionScript. Comunque, con la preoccupazione crescente riguardo ai suoi problemi per la sicurezza, e HTML5 la cui popolarità subì un'impennata fra gli sviluppatori web, Adobe annunciò la data \"End-of-Life\" per Flash: 31 Dicembre 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (anche noto come Shockwave, noto prima come Macromedia Shockwave Player o Shockwave Director Player) è un lettore per media interattivi pubblicato nel 1995. Costruito con una tecnologia in sviluppo 10 anni prima da MacroMind, divenne una plugin web solo dopo la sua acquisizione da parte di Macromedia. Al contrario di Flash, Shockwave supportava il linguaggio Lingo per script e C++ attraverso l'uso di Xtras, dando al giocatore una vasta scelta di funzioni incluso il 3D. Vide un largo utilizzo durante gli albori di internet e su giochi CD-ROM, e acquistò popolarità su larga scala. La piattaforma vide un significativo calo di popolarità dopo che Adobe acquistò Macromedia, in favore di Flash, che si stava rapidamente espandendo in termini di funzioni ed era allora di prorietà di Adobe anch'esso. Alla fine nel Febbraio del 2019, Adobe ne annunciò l'abbandono e terminò il supporto due mesi dopo.",
  "Platforms_Alambik_Plugin_Description": "La plugin Alambik è un web player per contenuti creati con Alambik, una piattaforma per sviluppatori. Pubblicata nel 2001, era capace di creare grafica 2D e 3D, vettori e molte altre applicazioni. Nel 2002, Alambik tenne un concorso a premi per celebrare la pubblicazione dello script di Alambik. Nel 2004, Alambik creò un nuovo sito per demo, ma dopo ciò la compagnia divenne silente e non pubblicò più nulla per la piattaforma, nè aggiornò la plugin.",
  "Platforms_Ambulant_Description": "Ambulant è un lettore per i file SMIL, realizzato da numerose persone che coordinano la CWI di Amsterdam, Paesi Bassi. Il nome sembra riferirsi all’“ambulazione”, un’altra parola per camminare; questo è ulteriormente supportato dal logo che sembra essere qualcuno che cammina. SMIL era una specifica fatta da W3C, il consorzio web internazionale, ma non ha guadagnato molta popolarità. Ambulante tentato di essere un giocatore open source che supporta tutti i file SMIL. Tuttavia, il desiderio di rendere tutte le parti open source ha impedito loro di supportare alcuni formati di media proprietari. Lo sviluppo è iniziato nell’aprile 2003 e la prima versione “AMBULANT/G” è stata rilasciata nel luglio di quell’anno., è stato rilasciato nel febbraio 2015, tuttavia il lavoro su una costruzione instabile di Ambulant 2. è continuato fino a luglio 2016, quando è stato fatto l'ultimo impegno per il loro repo Github. Gli sviluppatori di Ambulant sono ancora attivi su altri progetti.",
  "Platforms_AnimaFlex_Description": "AnimaFlex fu una plugin grafica per playback che poteva riprodurre animazioni con dimensioni di file ridotte, create con RubberWeb Composer, che poteva allungare e distorcere le immagini. Poteva cominciare a riprodurre le animazioni prima che l'intero file fosse scaricato e adeguarsi a connessioni internet più lente. Nonostante le promesse, RubberFlex stesso ebbe diversi altri prodotti, tutti che potevano esportare gif, in competizione con AnimaFlex, e lanciò persino FlexToGif che poteva convertire file da plugin a gif 2 giorni dopo la plugin. Dall'inizio del 1998, RubberWeb Composer cessò la distribuzione, lasciando AnimaFlex senza programma per l'authoring.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": "Harvard Graphics è stato un programma di presentazioni creato nel 1986 da Software Publishing Corporation (SPC) per i PC MS-DOS. Dopo la loro transizione a Windows nel 1991, non è riuscito a recuperare la quota di mercato che aveva e ha perso a PowerPoint. Nel 1996 Allegro New Media (rinominato Vizacom più tardi quell'anno) acquistò SPC e Serif. SPC ha creato ASAP WordPower, un programma per creare facilmente presentazioni, che potrebbe essere pubblicato sul web utilizzando il plugin ASAP WebShow. Il CPS si è fuso con Serif nel 1997. Nel 1998 il marchio Harvard è stato rivitalizzato con il programma di autori Harvard Graphics 98, e il plugin è stato sostituito con uno nuovo chiamato Harvard Graphics WebShow. Nel 2000 Presentazioni avanzate, la nuova versione del software di autore, esportata nello standard Flash invece del formato proprietario del plugin. Vizacom ha venduto Serif alla loro gestione originale nel 2001, che ha relegato la gamma Harvard al software legacy, essendo supportato e venduto fino a essere interrotto nel 2017.",
  "Platforms_Authorware_Web_Player_Description": "Authorware Web Player fu creato da Macromedia nel 1996 come una delle nuove funzioni di Authorware 3.5. Fu creato come modo per eseguire su internet programmi interattivi sviluppati con Macromedia Authorware. Al contrario di molte plugin web, lo scopo primario di Authorware era di promuovere l'e-learning, finendo per essere usato in imprese e in campo accademico come modo per assemblare materiale per l'apprendimento multimediale senza avere bisogno di essere esperti programmatori. La versione finale della plugin fu pubblicata nel 2004, prima dell'acquisizione di Macromedia da parte di Adobe nel 2005, dopodiché il suo sviluppo finì in stallo fino all'annuncio del suo abbandono nel 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Ancora nessuna descrizione.",
  "Platforms_AXEL_Player_Description": "AXEL Player era una plugin per contenuti interattivi 3D creata da MindAvenue nel 2002. Forniva un modo per modelli e animazioni per il programma di authoring web AXELedge e AXELpublisher, che convertiva file da altri software 3D come 3ds Max. Il software fu ben accolto dai critici, nonostante alcune limitazioni, una delle quali era l'assenza di molti utenti per la plugin. Nel 2005 MindAvenue fu acquistata da 20-20 Technologies, che si specializzò nel design di interni e software per lo svilluppo di arredi, e nel 2006 il loro sito divenne una pagina che reindirizzava a 20-20. Tutti i prodotti AXEL inclusa la plugin furono abbandonati.",
  "Platforms_BitPlayer_Description": "BitPlayer era un programma desktop basato sulla tecnologia Flash e Shockwave, creato nel 1999 dalla compagnia olandese BitMagic. Offriva cortometraggi quotidianamente, prodotti dalla compagnia stessa e dai loro clienti, ed erano accompagnati da pubblicità e quiz. Inizialmente valutata 6 milioni di dollari, rimase vittima del crash di dot-com seguendo i suoi advertisers e ne fu cessata la produzione nel Gennaio del 2001. Molto del suo contenuto è sopravvissuto come file SWF convertiti, nonostante funzioni extra offerte dal lettore personalizzato siano andate perdute.",
  "Platforms_Blender_Description": "Ancora nessuna descrizione.",
  "Platforms_Burster_Description": "Burster era un'implementazione creata nel 2010 di Blender Game Engine, creato 2000. Il progetto era un tentativo di far rivivere una plugin ufficiale lanciata con Blender, che fu abbandonata a causa di preoccupazioni relative alla sicurezza. Migliorò l'originale, avvantaggiandosi delle nuove versioni del programma, offrendo migliori prestazioni e grafica. L'ultima versione fu lanciata nel 2013 e dopo 3 anni senza aggiornamenti, Burster fu ufficialmente abbandonata nel 2016. Il motore per giochi stesso fu rimosso da Blender nel 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin era uno strumento per la produttività inventato da Logic Pulse nel 1996. Si trattava di una nuova funzione aggiunta alla versione 3.2 di Calendar Quick, un programma per desktop per calendari e tabelle orarie. Permetteva agli utenti di pubblicare questi ultimi su pagine internet usando la funzione di esportazione, che potevano essere condivise con altra gente e visualizzate con la plugin. Dopo aver riparato un bug Y2K nel 1999, il sito internet fu abbandonato senza ricevere ulteriori aggiornamenti ed andò offline nel 2001.",
  "Platforms_Cult3D_Description": "Cult3D era un visualizzatore web per contenuti 3D creato usando il programma authoring Cult3D Designer. Godè di moderato successo, con 6 milioni di utenti nel 2001 e diversi clienti importanti, inoltre disponeva di altre opzioni di importazione per i modelli 3D prese da altri programmi. L'ultima versione, pubblicata nel 2002, fu la 5.3 e l'ultimo aggiornamento alla plugin fu fatto nel 2004, quando la tecnologia fu venduta a Mental Images Gmbh. In seguito Nvidia acquistò Mental Images nel 2007, diventando la sussidiaria Nvidia Advanced Rendering Center. Nonostante il sito venne aggiornato, la plugin non ricevette nessun aggiornamento e a partire dal 2011 smise di essere consigliata come utile opzione, e la pagina dei download fu tenuta online per gli utenti che disponevano ancora di una licenza ma fu in seguito rimossa nel 2013.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion era una linea di programmi AR (augmented reality, realtà aumentata) che utilizzava videocamere per visualizzare oggetti 3D in tempo reale il cui sviluppo iniziò nel 1999 da parte di Total Immersion. Uno di questi programmi era D'Fusion @Home, pubblicato nel 2008 con una plugin nel 2009. Per essa furono create applicazioni usando il programma di authoring D'Fusion Studio e il suo scopo principale era il marketing e le esperienze brevi. Nel 2011 la tecnologia faticò a raggiungere un ampio utilizzo. Anche con l'implementazione del più accessibile Flash e con il fatto che il software per l'authoring diventò gratuito, il suo utilizzo fu sempre molto limitato. In seguito all'ascesa degli smartphones fu sviluppata TryLive, un'altra soluzione AR per la facile visualizzazione di anteprime di prodotti, come mobilio e ottica. Quest'ultima ebbe successo al contrario della linea D'Fusion, la quale non ricevette ulteriori aggiornamenti dopo il 2013. Nel 2015 la compagnia fu venduta ad ACEP, una compagnia di ottica.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Ancora nessuna descrizione.",
  "Platforms_DPGraph_Description": "Creata nel 1999 da David Parker, DPGraph (Dynamic Photorealistic Graphing) è un programma eseguibile con lo scopo di visualizzare grafici di pagine web. Possono essere animate e mostrare fino a 8 dimensioni, con controllo delle variabili. Funzionava scaricando un file in una pagina web che istruiva poi il browser ad eseguire il programma e presentare i grafici. Fu resa disponibile una versione completa a diversi istituti di apprendimento per l'uso in classi e studi per creare grafici, con l'aggiunta di un lettore gratuito per visualizzarli. Fu aggiornato l'ultima volta nel 2016 e nel 2019 la versione completa divenne gratuita per tutti.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) è stato un plugin di animazione rilasciato da Sharp nel 2001. Progettato con dispositivi mobili come telefoni e PDA in mente, è stato rilasciato per i modelli di telefono selezionati esclusivamente in Giappone e un plugin del browser. Ha avuto l'orgoglio per le sue piccole dimensioni di file e grafica vettoriale che si adattano a qualsiasi schermo mobile. La tecnologia è stata rilasciata al pubblico statunitense nel 2002 con il nome SharpMotionART. Né durato a lungo, come e-animator ha rilasciato il suo ultimo aggiornamento nel 2003 e SharpMotionART è stato interrotto nel 2004.",
  "Platforms_Envoy_Description": "Envoy era un formato di documenti sviluppato nel 1993 da Tumbleweed Software, creato stampandoli virtualmente in WordPerfect. Competeva con Adobe Acrobat e il suo formato PDF. WordPerfect Corporation fu venduta a Novell nel 1994; nella vendita era incluso Envoy, ma Tumbleweed continuò a lavorare con Novell, creando una plugin web nel 1995 per vedere file online. Novell vendette WordPerfect a Corel nel 1996, ma mantenne la proprietà di Envoy. Nel 1999, Novell smise di sviluppare Envoy e Corel abbandonò il supporto per Envoy a partire da WordPerfect 2000. Questo fermò la collaborazione iniziata fra Tumbleweed e Novell dopo l'acquisizione di Envoy avvenuta nel 1994 e il supporto alla plugin fu interrotto.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) è un plugin di animazione leggero sviluppato da Sharp nel 1997. Aveva diverse versioni del software di authoring in bundle con computer Sharp e per diversi demografici, quello principale è “EVA Animator”. Un più bambino amichevole “EVA Animator Kids”, con un sito web エバキッズクラブ (Club EVA Kids Club) è stato lanciato nel 2000. Questi sono stati interrotti nel 2007 e sostituiti con un livello intermedio “EVA Animator School II”. L'ultimo aggiornamento importante del plugin è venuto in 2002 con una correzione minore nel 2008, ma nonostante questo ha mantenuto una piccola comunità di utenti, fino a Sharp spegnere il sito principale nel 2016.",
  "Platforms_Flatland_Rover_Description": "Rover è una plugin 3D basata sul linguaggio 3DML sviluppato nel 1997 da Flatland. Gli utenti potevano creare \"Spots\" con il programma di authoring Spotnik, composti da \"Livelli\" contenenti \"Blocks\" per facilità di sviluppo, ed eseguirli con Rover, disponibili come plugin per browser e programma standalone. Lo sviluppo fu frequente fino al crash dot-com, quando la maggior parte della squadra si separò; l'ultimo aggiornamento fu pubblicato nel 2005, e il sito fu abbandonato prima di andare offline nel 2012. Michael Powers, uno dei precedenti sviluppatori, decise nel 2014 di ripristinare il sito, creare un archivio per il software e aggiornarlo per farlo funzionare con i sistemi moderni. L'applicazione standalone Rover fu rivisitata nel 2017, ma la plugin non ritornò.",
  "Platforms_Formula_One_Description": "Ancora nessuna descrizione.",
  "Platforms_Fractal_Viewer_Description": "Ancora nessuna descrizione.",
  "Platforms_FreeHand_Description": "FreeHand era una suite creativa di grafica vettoriale creata nel 1988 da Altsys Corporation. Macromedia comprò FreeHand nel 1994 e continuò a svilupparla. Nell'Ottobre 1996 fu lanciata FreeHand 7.0 con una plugin web, chiamata Shockwave per FreeHand. La plugin permise l'incorporamento e la visualizzazione in una pagina web delle immagini vettoriali create dal programma. Nel Novembre 1996 Macromedia acquistò FutureSplash, un'altra plugin web di grafica vettoriale, che fu rinominata Flash. Nel 1998 fu pubblicata FreeHand 8.0 ed era disponibile l'esportazione in Flash invece che nella plugin FreeHand. L'ultima versione del programma fu FreeHand MX, pubblicata nel 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "La plugin GoBit Games fu creata nel 2008 da GoBit, un piccolo studio indipendenete composto da ex impiegati PopCap. Il loro primo gioco, Burger Shop, fu pubblicato nell'Ottobre del 2007 e dopo grande richiesta ne fu fatto un demo su internet 4 mesi dopo usando l'allora nuova Games plugin. Passò un anno e il demo fu rielaborato come gioco promozionale per Eggo, pubblicato da Shockwave.com il primo Febbraio 2009. La plugin fu abbandonata poco dopo con la pubblicazione di Burger Shop 2 - il suo demo usava Flash invece - lasciando Burger Shop e la sua reskin come gli unici giochi mai creati per essa.",
  "Platforms_HotSauce_Description": "Meta Content Framework (MCF) era un formato per la strutturazione di metadata sviluppato da Apple Computer's Advanced Technology Group a partire dal 1995, nel 1996 Project X divenne una plugin sperimentale creata per visualizzarli su internet, in seguito rinominata HotSauce, che mostrava mappe di siti in uno spazio 3D. Alla fine del 1996, più di 200 siti web usavano HotSauce, arrivando poi ad essere più di 300; fu anche raggiunto un accordo con NetCarta per la creazione di una libreria di oltre 30000 siti visitabili usando la plugin. Benché lo standard MCF guadagnò diversi elogi, molti utenti non videro vantaggi in questo metodo di navigazione 3D ed il progetto finì fra i molti che furono cancellati quando Steve Jobs ritornò alla Apple nel 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage è uno standard per la riproduzione di documenti tramite web browser. Originariamente sviluppato da Tim Berners-Lee nei primi anni '90 (con radici che vanno indietro fino al 1980) HTML divenne il primo metodo per condividere informazioni attraverso internet, le sue capacità espanse da altri linguaggi come CSS e JavaScript. Fu proposto per la prima volta nel 1993, e ricevette successivi aggiornamenti con HTML2 nel 1995 e HTML3 e HTML4 entrambi nel 1997. L'ultimo aggiornamento per HTML4 fu nel 2000 e negli anni successivi i suoi linguaggi correlati furono largamente ignorati come piattaforme per giochi, animazioni e altri contenuti web, con gli sviluppatori che optavano per tecnologia basata su plugin invece, ma con l'evoluzione di internet e della tecnologia, le plugin iniziarono a diventare obsolete, per cui fu fatto lo sforzo di aggiornare lo standard e nel 2008 fu lanciato HTML5. Mentre Flash e altre plugin passarono di moda, HTML5 divenne lo standard consigliato e molti spostarono i loro progetti sulla famiglia HTML - o abbandonarono le plugin proprietary del tutto - e caricarono il loro contenuto su siti come YouTube. {Note: For brevity reasons, Flashpoint labels any entry that doesn't contain frameworks or plugin-enabled content as \"HTML\".}",
  "Platforms_HyperG_Description": "Hyper-G era un Sistema di Gestione dei Contenuti Web (Web Content Management System, WCMS) basato su Gopher e sviluppato dall'Istituto di Processamento dell'Informazione e dei Nuovi Media Supportati dal Web (IICM) dell'Università Graz della Tecnologia, in Austria nel 1995. Era un alternativa agli Iper-Link di internet e utilizzava browser che disponevano di Hyper-G, il quale poteva riprodurre modelli 3D di cartelle e file e anche altri modelli, il tutto con un visualizzatore incorporato. Siccome era basato sul sempre più obsoleto Gopher, il predecessore di internet, si evolse e divenne Hyperwave nel 1996, senza disporre delle capacità aggiuntive che i browser Hyper-G offrivano, come le funzioni 3D. La maggior parte dei suoi contenuti è ora perduta a causa di come i file venivano contenuti in Gopher.",
  "Platforms_Hypercosm_Player_Description": "Basata su una tecnologia in sviluppo fin dal 1989, Hypercosm è un lettore per contenuti 3D lanciato nel 1999. La compagnia fece un forte investimento che non fruttò, essendo una delle tante vittime del crash di dot-com, fallendo nel 2001. Comunque, la compagnia fu acquistata da ORBITEC, e grazie ad un contratto con la NASA, la compagnia riuscì a ritornare più o meno in attività, e continuò a lavorare su nuovi progetti fino a che fu ristrutturata nel 2012, quando fu fermata da ORBITEC finché un nuovo socio in affari non fosse stato interessato a lavorare con la tecnologia. Questo non accadde mai, causando la chiusura di Hypercosm nel 2016.",
  "Platforms_Illuminatus_Description": "Ancora nessuna descrizione.",
  "Platforms_iPix_Description": "Ancora nessuna descrizione.",
  "Platforms_Java_Plugin_Description": "Pubblicata insieme al linguaggio di programmazione Java come una delle sue funzioni, i Java Applets erano delle piccole finestre di programmi incorporati (embed) nelle pagine per fornire ulteriori funzioni interattive. Erano progettate per essere compatibili su diversi sistemi operativi e browser, e per essere più potenti dell'HTML standard. Rimase un'opzione utile per più di 10 anni, ma nel 2013 la tecnologia su cui si basavano gli Applet cominciò a non essere più supportata dai principali browser e molti di essi divennero inutilizzabili e obsoleti nel 2017 e rimossi da Java SE 11 nel 2018.",
  "Platforms_JCAMPDX_Description": "Ancora nessuna descrizione.",
  "Platforms_Lightning_Strike_Description": "Ancora nessuna descrizione.",
  "Platforms_LiveMath_Plugin_Description": "La plugin LiveMath è un'applicazione per la matematica interattiva, capace di creare una finestra contenente note, formule, grafici e altre funzioni matematiche che venivano incorporate (embed) in una pagina di internet. Originariamente lanciata come Theorist nel 1989 da Prescience Corporation e la plugin web vera e propria lanciata nel 1994, fu poi rinominata MathView nel 1997 dopo essere stata acquistata da Waterloo Maple prima di essere poi acquistata da MathMonkeys e rinominata LiveMath nel 1999. Nel 2014, a causa di crescenti problemi ed incompatibilità con i moderni browser, la plugin fu ritirata e sostituita da un visualizzatore a sé stante chiamato LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Ancora nessuna descrizione.",
  "Platforms_MHSV_Description": "Lanciata come versione alfa chiamata VSV ({V}irtual {S}pace {V}iewer) e poi rinominata MHSV ({M}ultimedia {H}ome {S}pace {V}iewer), questa era una plugin sviluppata da ParaGraph che permetteva la creazione di mondi interattivi 3D usando il programma di authoring VHSB ({V}irtual {H}ome {S}pace {B}uilder), che permetteva di creare mondi sia interattivi con MHSV che statici standard con VRML. Nel 1996 lo sviluppo dello standard VRML 2.0 aggiunse interattività e ParaGraph aggiornò VHSB per permettere la creazione di mondi VRML 2.0, ma ParaGraph decise di lavorare con Silicon Graphics ed il loro visualizzatore Cosmo VRML 2.0 player, adattarono VHSB per funzionare meglio con esso e abbandonando così MHSV. Silicon Graphics acquistò ParaGraph nel 1997 per creare Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Sviluppata da Microsoft nel 2007 in risposta a Flash e Java, Silverlight è uno strumento multimediale con lo scopo principale di trasmissione video, famoso per essere usato da Netflix. Versioni più recenti videro aggiunte più funzioni per altre applicazioni. Godè di un discreto margine di popolarità, con una quota di utilizzo del 64, 7% nel 2011. Comunque nel 2012, in seguito all'annuncio della fine di NPAPI, alla pubblicazione di Windows 8 e all'inizio dell'utilizzo di HTML5, Microsoft abbandonò il software e nel 2015 entrò nello stadio di fine supporto (End-of-Life) in concomitanza con la pubblicazione di Windows 10 ed infine abbandonata ufficialmente nell'Ottobre del 2021.",
  "Platforms_NoteWorthy_Composer_Description": "Ancora nessuna descrizione.",
  "Platforms_O2C_Player_Description": "O2c Player era parte della linea o2c (objects to see, oggetti da vedere) ed una plugin web 3D del 1999 che aveva lo scopo di mostrare oggetti e scene sviluppata dalla compagnia tedesca mb Software AG. La compagnia vendette la tecnologia 02c ad ELECO plc nel 2003, che nel 2005 sviluppò e lanciò la versione 2.0 del lettore o2c, garantendo performance di gran lunga migliori grazie all'accelerazione 3D, e fu definita più come uno strumento CAD per architetti. Fu aggiunto supporto per più browser ma senza nessun aggiornamento importante, solo riparazione di bug. Ad oggi 2021 la plugin è ancora disponibile per lo scaricamento ma Elcosoft si è diretta verso l'implementazione Unity WebGL della tecnologia.",
  "Platforms_Octree_View_Description": "In precedenza una plugin più vecchia chiamata PicTree Viewer o PicView e poi sviluppata nuovamente come una nuova plugin chiamata Fastview prima di essere rinominata nel 1999, Octree View è un visualizzatore di oggetti 3D basato sulla tecnologia Voxel, che fu in sviluppo almeno dal 1980, che fa uso di fotocamere speciali e scanner laser per creare immagini. La compagnia continuò a fare uso della loro tecnologia e della plugin ma nel 2007 il loro sito smise di essere aggiornato, senza che ci fu più nessuna attività.",
  "Platforms_Pixound_Description": "Pixound è stato un plugin per la musica artistica, lanciato nel 1996 come joint venture da Hologramophone Research e Frankfurt Balkind Partners. Ha agito come una tastiera MIDI che ha utilizzato i valori di colore delle immagini per produrre diverse note e altezze. Nel 2003 Hologramophone ha cambiato il suo nome in Techné Media. Entro il 2005, il plugin è stato abbandonato a favore di un'applicazione standalone per Mac OS X esclusivamente.",
  "Platforms_Play3D_DeepV_Description": "Play3D era una plugin 3D pubblicata nel 1996 da Heads Off, per poi essere rinominata e ripubblicata l'anno successivo come DeepV. Oltre a una manciata di esempi, la plugin fu poco utilizzata per tutta il tempo che fu attiva. Il sito dello sviluppatore andò offline nel 2001.",
  "Platforms_PointPlus_Description": "PointPlus era una plugin per l'incorporazione di presentazioni PowerPoint su internet sviluppata da Net-Scene nel Maggio del 1996 per Windows NT e 95. Si propose come alternativa al più complesso Macromedia Shockwave, per permettere ad utenti alle prime armi di usare lo standard PowerPoint. Da Novembre di quell'anno fu iniziato lo sviluppo di un visualizzatore Java compatibile per più piattaforme e che non richiedeva nessuna plugin. La plugin fu conservata come opzione per casi speciali, ma la linea di prodotti non ricevette più aggiornamenti a partire dal 1997. Il sito web fu chiuso agli inizi del 2001.",
  "Platforms_PopCap_Plugin_Description": "La plugin PopCap era una plugin per mostrare demo di gioco creati dagli sviluppatori di PopCap. All'inizio la compagnia utilizzava Java per i suoi demo di gioco online per via della sua accessibilità. Più tardi, tuttavia, lo sviluppo fu cambiò, verso una plugin propria di PopCap che era disponibile come un controllo ActiveX e una plugin Firefox tradizionale. Questo diede a PopCap il vantaggio di avere una propria piattaforma per la distribuzione dei demo. Tuttavia, il suo scarso utilizzo sia da parte dei clienti che da parte di PopCap stessa portò gli sviluppatori a passare al più popolare Flash nel 2007.",
  "Platforms_ProtoPlay_Description": "ProtoPlay era una plugin il cui scopo era di mostrare prototipi per far interagire i consumatori con i prodotti e simularne le proprietà. Pubblicata nel 1996, utilizzava il programma di authoring Altia Design per creare applicazioni che consistevano in sprite 2D con elementi interattivi. La plugin era di natura più utilitarista, e non fu attivamente pubblicizzata fino al tardo 2003, in precedenza esistendo per lo più come funzione disponibile se richiesta. Altia Design e la plugin furono aggiornate per migliorarne la funzionalità e nel 2007 fu pubblicato PhotoProto, un nuovo strumento che permetteva di usare Photshop per creare applicazioni per plugin. Nel 2009 Altia Inc. si concentrò sul progettare interfaccia per utenti, abbandonando il prototipo del software insieme a ProtoPlay.",
  "Platforms_Pulse_Player_Description": "Pulse Player era una plugin 3D inizialmente chiamata 3rd Degree il cui sviluppo risale al 1997, con uno scopo principale sulle animazioni. Fu pubblicata originariamente nel 1999 grazie a fondi donati da diversi membri esperti nel campo dei media su internet e fu utilizzata da diversi iportanti clienti. La plugin fu pubblicizzata come una piattaforma per creare media divertente e creativa e ottenne successo, ma all'inizio del 2001ci fu un cambiamento riguardo a ciò che la compagnia voleva ricercare e Player fu reinventato come strumento più serio, educativo e affaristico. Nel 2003 fu pubblicata la versione 5.2, l'ultima, poco dopo la quale il supporto cessò.",
  "Platforms_REBOL_Plugin_Description": "REBOL è un linguaggio di programmazione progettato in oltre 20 anni e pubblicato nel 1997. Nel 2004 è stato creato un prototipo sperimentale per una plugin web REBOL, insieme ad una pagina contenente diversi esempi. La plugin fu inizialmente, come ActiveX, esclusiva per Internet Explorer, ma nel 2006 fu rilasciata una versione per altri browser. Poco dopo ciò però, fu applicato un ultimo aggiornamento, in seguito al quale la plugin rimase un prototipo beta non sicuro da usare.",
  "Platforms_ShiVa_Web_Player_Description": "Creata da Stonetrip, e chiamato Ston3D Web Player prima del 2007, ShiVa Web Player era una plugin per contenuti web 3D per l'esecuzione di software creati con il motore 3D ShiVa. Ha permesso la creazione di scene 3D complesse, con effetti di luce e fisici, senza richiedere requisiti elevati riguardo al processore. Stonetrip venne rinominata nel 2013 come ShiVa Technologies SAS e si concentrò esclusivamente sul motore grafico. In seguito alla rimozione di NPAPI dalla maggior parte dei browser il supporto alla plugin diminuì; ciò causò la rimozione pure delle URL di diversi file core nel 2018, guastando la maggior parte dei giochi. Nel 2019 il download fu rimosso dal sito di ShiVa.",
  "Platforms_Show_It_Description": "Show It! era una plugin introdotta nel 1997 insieme a WordPerfect Suite 8 come una delle funzionalità di Corel Presentations 8, un rivale di PowerPoint. Durante l'esportazione con l'opzione Internet Publisher si potevano esportare le presentazioni sia come slideshow statico di immagini che come proiettore incorporato usando un file proprietary che funzionava proprio come il programma desktop originario conservando tutte le funzionalità, che necessitava della plugin. Il supportò continuò con WordPerfect Office 2000 e Presentations 9 ma dal 2001 il supportò alla plugin cessò, a cominciare da Presentations 10 in WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Ancora nessuna descrizione.",
  "Platforms_Squeak_Etoys_Description": "Squeak era una piattaforma open source lanciata nel 2001 per creare contenuti educativi e di intrattenimento. Gli utenti potevano creare piccoli programmi per bambini di tutte le età, da quelli per i più giovani, chiamati \"Etoys\", a \"Omniuser\" e \"Expert\". Fu rinominata Etoys nel 2008 e il suo target si spostò più verso i bambini più giovani. L'ultima versione della plugin fu Etoys, pubblicata nel 2012. Nel 2013 iniziò lo sviluppo di una versione JavaScript del programma in seguito a preoccupazione riguardo alla sicurezza, questi sostituì la plugin che fu abbandonata.",
  "Platforms_Superscape_Viscape_Description": "Lanciata nel 1996 dai pionieri del 3D Superscape con il supporto di Intel ed originariamente chiamati VisNet, Viscape era una plugin 3D che aveva il vantaggio dell'interattività con mondi, al contrario dei modelli statici di VRML 1.0. Godè di un breve periodo di popolarità, all'inizio non c'erano piani per supportare VRML, ma visto che VRML97 implementava interattività fu possibile un aggiornamento chiamato Viscape Universal pubblicato nel 1998 e fu aggiunto il supporto a VRML per rimanere rilevanti. Questo non fu sufficiente, la compagnia ebbe guai finanziari e associazione fallite, e i recensori che consideravano la plugin datata e pesante nonostante gli sforzi per farla rinascere. Benché l'ultimo aggiornamento fu fatto nel 2000, la sua tecnologia continuò ad essere utilizzata nella serie di Lego Creator di Superscape per l'anno seguente. Fu fatto un tentativo, chiamato Vislite, di aggiornare la plugin incorporandola in Applet Java, ma alla fine la compagnia si concentrò di nuovo sulla creazione di giochi mobili e raggiunse moderato successo prima di essere acquistata da Glu Mobile nel 2008.",
  "Platforms_Surround_Video_Description": "Ancora nessuna descrizione.",
  "Platforms_SVF_Viewer_Description": "Ancora nessuna descrizione.",
  "Platforms_Tcl_Plugin_Description": "Sviluppato da una piccola squadra e lanciata nel 1988, Tool Command Language (Tcl, si pronuncia \"tickle\", \"solletico) è un linguaggio di programmazione dinamico e open source. Nel 1994 Sun Microsystems invitò la squadra a sviluppare ulteriormente la tecnologia. Uno dei risultati di questa impresa nel 1996 fu una plugin che poteva eseguire applets Tcl (\"Tclets\") incorporata nelle pagine. Alla fine del 1997 lo sviluppo di Tcl fu ceduto ad una compagnia indipendente chiamata Scriptics, e fu di nuovo ceduto a Tcl Core Team nel 2000. Mentre lo sviluppo del linguaggio rimane attivo oggigiorno, il lavoro sulla plugin è rallentato molto anche se non è stato ufficialmente abbandonato. L'ultima versione, la 3.1.0, fu pubblicata nel 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer era una plugin multimediale del 1997 creata da Parable Corporation, che cambiò poi nome in ThingWorld nel 1998. Creava asset \"Things\" che potevano essere opzionalmente protette contro furti o manomissioni e avere un ID unico con crediti da distribuire su siti usando una semplice programmazione modulare per creare cose come immagini, animazioni e persino giochi interattivi creati usando il prgramma di authoring ThingMaker o convertendo file Shockwave Director tramite ThingConverter. Fu relativamente popolare, ottenne persino accordi con Microsoft e diverse altre società nel 1999 ma alla fine del 2000 la compagnia ridusse lo staff ed era in trattative con sconosciuti per una fusione per vendere la tecnologia. Il sito web chiuse nel 2002.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine era un motore di gioco multipiattaforma che puntava a rendere più accessibile lo sviluppo di giochi, ed è il software di sviluppo di giochi di terzi più popolare fra gli sviluppatori di tutto il mondo. Creato insieme a Unirt stessa ed implementato nella prima patch nel 2005, Unity Web Player era uno strumento per giocare ai giochi Unity su internet. Rimase una piattaforma popolare per giochi 3D, ma con la rimozione del supporto NPAPI nel 2016 la plugin fu abbandonata in favore di Unity WebGl.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap era uno strumento per la visualizzazione di mappe interattive incorporate in una pagina web. Era compatibile con diversi file mappa di diversi programmi di authoring, poteva mostrare informazioni dettagliate riguardo ai settori e ti permetteva di calcolare distanze. Dopo il suo lancio nel 1997 la tecnologia non fu più sviluppata e rimase la stessa finché la pagina non andò offline nel 2004.",
  "Platforms_Vitalize_Description": "Creato nel 1997 da Corel per la visualizzazione di contenuti realizzati con il programma di authoring multimediale Click&Create di loro creazione, Vitalize! era una plugin a bassa larghezza di banda per creare semplici giochi web concentrandosi su gioco, marketing e pubblicità. Distribuita con l’aiuto di Europress, fu orgogliosamente definita come “facile da imparare e usare al contrario di Java o Shockwave\". A un certo punto nel 1999 gli ex dipendenti di Corel lasciarono la compagnia per creare Clickteam, che continuò lo sviluppo della plugin nel 2000 con la versione 2.0. L’ultima versione, la 4.0, è stata pubblicata nel 2007/2008 ed è stata disponibile sul loro sito web fino al 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage è uno standard 3D open ed il primo creato per internet. Quando fu inizialmente specificato nel Novembre del 1994, il formato poteva solo rappresentare modelli statici senza interattività. Il problema fu risolto nel 1997 con la pubblicazione della versione 2.0, meglio conosciuta come VRML97. Nonostante non fu mai largamente utilizzata, divenne l'opzione più popolare per i contenuti 3D basati su internet fin dal suo lancio prima di essere sostituito da X3D (che era retrocompatibile con i mondi VRML). Siccome era un formato di file e non una vera e propria plugin, molte diverse implementazioni sono state fatte di VRML, spesso caratterizzate dalle loro proprie funzionalità non standard.",
  "Platforms_X3D_Description": "Ancora nessuna descrizione.",
  "Platforms_Xara_Plugin_Description": "La plugin Xara era un visualizzatore di grafica vettoriale che utilizzava un formato proprietary a bassa larghezza di banda. Inizialmente lanciata fu la versione beta ed una versione completa nel 1996 che era in grado di visualizzare file Flare creati con CORELXara su internet. Nel 1997 fu lanciata Xara Webster per avere specificatamente grafica web per la plugin. L'ultima versione pubblicata fu la 2.08a nel 1999. Nel 2000 Xara Webster fu sostituita da XaraX, la quale poteva esportare file Flash, un'altra plugin vettoriale, per cui il supporto per la loro versione proprietaria cessò relegandola all'archivio di software legacy.",
  "Platforms_Coming_Soon": "Prossimamente",
  "Platforms_Coming_Soon_Description": "Giochi e animazioni creati su queste piattaforme saranno disponibili con il prossimo aggiornamento.",
  "Platforms_Common_Ground_Description": "Ancora nessuna descrizione.",
  "Platforms_DjVu_Description": "Ancora nessuna descrizione.",
  "Platforms_Jamagic_Description": "Ancora nessuna descrizione.",
  "Platforms_Jutvision_Description": "Ancora nessuna descrizione.",
  "Platforms_mBed_Description": "Ancora nessuna descrizione.",
  "Platforms_MrSID_Description": "Ancora nessuna descrizione.",
  "Platforms_PanoramIX_Description": "Ancora nessuna descrizione.",
  "Platforms_Petz_Player_Description": "Ancora nessuna descrizione.",
  "Platforms_Sibelius_Scorch_Description": "Ancora nessuna descrizione.",
  "Platforms_Sizzler_Description": "Ancora nessuna descrizione.",
  "Platforms_Ulead_COOL_360_Description": "Ancora nessuna descrizione.",
  "Platforms_VReam_WIRL_Description": "Ancora nessuna descrizione."
}