{
  "Platforms_Title": "Piattaforme Supportate",
  "Platforms_Description1": "Flashpoint supporta giochi e animazioni creati per una varietà di plugin web e standard - non solo Flash. Questa pagina contiene una panoramica di ogni tecnologia, insieme alla loro voce conta alla versione 11.",
  "Platforms_Description2": "Serve come un indice \"Chi? Quando? Cosa?\" e punto di partenza per ulteriori ricerche, non è una storia esauriente per ogni piattaforma. Facciamo del nostro meglio per presentare i fatti accuratamente, ma sono sempre possibili errori. Contattateci cortesemente con informazioni rilevanti per eventuali correzioni.",
  "Platforms_By": "da",
  "Platforms_Entries": "Voci",
  "Platforms_Entry": "Voce",
  "Platforms_3D_Groove_GX_Description": "Fondata nel 1998, The Groove Alliance sviluppò 3D Groove SX, un motore 3D per giochi basato su Shockwave. Nel 2002, si separò da Shockwave, fu messa in proprio e chiamata 3D Groove GX. Entrambe le varianti potevano essere usate per sviluppare giochi e programmi per desktop. Questo portò un successo alla compagnia, creando una grande base di utenza e portando alla creazione di diversi titoli importanti per programmi televisivi e altri grandi nomi. Dopo che l'euforia svanì, The Groove Alliance fu ricostituita come OTOY nel 2008, ma il sito 3D Groove rimase online fino al 2009. L'esatta causa della disfatta della compagnia originale è sconosciuta, ma fu confermato che ci furono disaccordi interni.",
  "Platforms_3DVIA_Player_Description": "3DVIA Player (nota prima come 3D Life Player, Virtools Player, e NeMo Web Player, da non confondersi con 3DVIA Studio/Beta Player o 3DVIA Composer Player) era una plugin per browser di Dassault Systèmes per la riproduzione di contenuti 3D creati in Virtools. Fu sviluppata per programmi 3D avanzati e pratici come allenamenti basati su computer, tour virtuali e beni immobili. 3DVIA Player fu anche usato per giochi di internet, e aveva fra i suoi principali utilizzatori lo studio Sarbakan del Quebec la Little Chicken Game Company di Amsterdam. L'ultimo aggiornamento, versione 5.0, fu pubblicata nel 2009. La pagina dei download rimase online negli anni a venire finché fu ritirata nel 2016. A quel momento, fu installata più di 30 milioni di volte.",
  "Platforms_AboutPeople_Description": "Ancora nessuna descrizione.",
  "Platforms_AboutTime_Description": "Ancora nessuna descrizione.",
  "Platforms_ActiveX_Controls_Description": "Pubblicata nel 1996 per Microsoft, ActiveX era un framework software che serviva come standard per incapsulare programmi come contenitori per l'uso in altri programmi non correlati, chiamati ActiveX Controls. Potevano essere incorporati (embed) in contenuti HTML, e controlli per l'uso singolo potevano essere creati specificatamente per Internet Explorer, per lo scopo di eseguire giochi sul web. Dopo il lancio di Edge nel 2015, il software fu ritenuto obsoleto e il suo uso per applicazioni web sembra essere cessato, relegandolo ad Internet Explorer 11 per il supporto software legacy.",
  "Platforms_Adobe_Atmosphere_Player_Description": "Atmosphere Player cominciò il suo sviluppo nel 1996 come V30 da Rocket Science Games, fu poi trasferita ad Attitude Software e rinominata 3D Anarchy, e fu poi venduta ad Adobe nel 2000 e rinominata nel 2001 come Atmosphere. Atmosphere è una plugin web fatta per la visione di mondi 3D interattivi, in modo simile allo standard VRML, creati con Atmosphere Builder. Fu più che altro creata per gallerie multimediali virtuali, che potevano presentare immagini/audio/video e i modelli 3D stessi. Quando fu inizialmente creata come 3D Anarchy, il software era inizialmente ancora Beta quando Adobe acquistò la tecnologia per svilupparla ulteriormente, dopodiché passò i successivi tre anni in collaudo beta e l'ultima versione 1.0 della plugin fu pubblicata nel Febbraio del 2004. Nel Dicembre 2004 fu annunciato che Atmosphere sarebbe stata abbandonata, e il supporto cessò nel Gennaio 2005.",
  "Platforms_Adobe_Flash_Player_Description": "Adobe Flash Player (anche solo Flash, noto prima come Macromedia Shockwave Flash Player) è un lettore per animazioni vettoriali e grafiche, spesso con aggiunta interattività. Era usata come media per giochi web per la sua compressione efficace, basso prezzo, facilità di utilizzo e diffusione di utilizzo. Sviluppato nel 1995 ed inizialmente introdotto da FuturWave nel 1996, era capace di poco più di animazioni basilari e pulsanti per controllarle. Acquistando popolarità, funzioni più avanzate furono aggiunte al lettore. come il linguaggio ActionScript. Comunque, con la preoccupazione crescente riguardo ai suoi problemi per la sicurezza, e HTML5 la cui popolarità subì un'impennata fra gli sviluppatori web, Adobe annunciò la data \"End-of-Life\" per Flash: 31 Dicembre 2020.",
  "Platforms_Adobe_Shockwave_Player_Description": "Adobe Shockwave Player (anche noto come Shockwave, noto prima come Macromedia Shockwave Player o Shockwave Director Player) è un lettore per media interattivi pubblicato nel 1995. Costruito con una tecnologia in sviluppo 10 anni prima da MacroMind, divenne una plugin web solo dopo la sua acquisizione da parte di Macromedia. Al contrario di Flash, Shockwave supportava il linguaggio Lingo per script e C++ attraverso l'uso di Xtras, dando al giocatore una vasta scelta di funzioni incluso il 3D. Vide un largo utilizzo durante gli albori di internet e su giochi CD-ROM, e acquistò popolarità su larga scala. La piattaforma vide un significativo calo di popolarità dopo che Adobe acquistò Macromedia, in favore di Flash, che si stava rapidamente espandendo in termini di funzioni ed era allora di prorietà di Adobe anch'esso. Alla fine nel Febbraio del 2019, Adobe ne annunciò l'abbandono e terminò il supporto due mesi dopo.",
  "Platforms_Alambik_Plugin_Description": "La plugin Alambik è un web player per contenuti creati con Alambik, una piattaforma per sviluppatori. Pubblicata nel 2001, era capace di creare grafica 2D e 3D, vettori e molte altre applicazioni. Nel 2002, Alambik tenne un concorso a premi per celebrare la pubblicazione dello script di Alambik. Nel 2004, Alambik creò un nuovo sito per demo, ma dopo ciò la compagnia divenne silente e non pubblicò più nulla per la piattaforma, nè aggiornò la plugin.",
  "Platforms_Ambulant_Description": "Ambulant è un lettore per i file SMIL, realizzato da numerose persone che coordinano la CWI di Amsterdam, Paesi Bassi. Il nome sembra riferirsi all’“ambulazione”, un’altra parola per camminare; questo è ulteriormente supportato dal logo che sembra essere qualcuno che cammina. SMIL era una specifica fatta da W3C, il consorzio web internazionale, ma non ha guadagnato molta popolarità. Ambulante tentato di essere un giocatore open source che supporta tutti i file SMIL. Tuttavia, il desiderio di rendere tutte le parti open source ha impedito loro di supportare alcuni formati di media proprietari. Lo sviluppo è iniziato nell’aprile 2003 e la prima versione “AMBULANT/G” è stata rilasciata nel luglio di quell’anno., è stato rilasciato nel febbraio 2015, tuttavia il lavoro su una costruzione instabile di Ambulant 2. è continuato fino a luglio 2016, quando è stato fatto l'ultimo impegno per il loro repo Github. Gli sviluppatori di Ambulant sono ancora attivi su altri progetti.",
  "Platforms_AnimaFlex_Description": "AnimaFlex fu una plugin grafica per playback che poteva riprodurre animazioni con dimensioni di file ridotte, create con RubberWeb Composer, che poteva allungare e distorcere le immagini. Poteva cominciare a riprodurre le animazioni prima che l'intero file fosse scaricato e adeguarsi a connessioni internet più lente. Nonostante le promesse, RubberFlex stesso ebbe diversi altri prodotti, tutti che potevano esportare gif, in competizione con AnimaFlex, e lanciò persino FlexToGif che poteva convertire file da plugin a gif 2 giorni dopo la plugin. Dall'inizio del 1998, RubberWeb Composer cessò la distribuzione, lasciando AnimaFlex senza programma per l'authoring.",
  "Platforms_ASAP_Webshow_Harvard_Graphics_WebShow_Description": " Harvard Graphics è stato un programma di presentazioni creato nel 1986 da Software Publishing Corporation (SPC) per i PC MS-DOS. Dopo la loro transizione a Windows nel 1991, non è riuscito a recuperare la quota di mercato che aveva e ha perso a PowerPoint. Nel 1996 Allegro New Media (rinominato Vizacom più tardi quell'anno) acquistò SPC e Serif. SPC ha creato ASAP WordPower, un programma per creare facilmente presentazioni, che potrebbe essere pubblicato sul web utilizzando il plugin ASAP WebShow. Il CPS si è fuso con Serif nel 1997. Nel 1998 il marchio Harvard è stato rivitalizzato con il programma di autori Harvard Graphics 98, e il plugin è stato sostituito con uno nuovo chiamato Harvard Graphics WebShow. Nel 2000 Presentazioni avanzate, la nuova versione del software di autore, esportata nello standard Flash invece del formato proprietario del plugin. Vizacom ha venduto Serif alla loro gestione originale nel 2001, che ha relegato la gamma Harvard al software legacy, essendo supportato e venduto fino a essere interrotto nel 2017.",
  "Platforms_Authorware_Web_Player_Description": "Authorware Web Player fu creato da Macromedia nel 1996 come una delle nuove funzioni di Authorware 3.5. Fu creato come modo per eseguire su internet programmi interattivi sviluppati con Macromedia Authorware. Al contrario di molte plugin web, lo scopo primario di Authorware era di promuovere l'e-learning, finendo per essere usato in imprese e in campo accademico come modo per assemblare materiale per l'apprendimento multimediale senza avere bisogno di essere esperti programmatori. La versione finale della plugin fu pubblicata nel 2004, prima dell'acquisizione di Macromedia da parte di Adobe nel 2005, dopodiché il suo sviluppo finì in stallo fino all'annuncio del suo abbandono nel 2007.",
  "Platforms_Autodesk_MapGuide_Description": "Ancora nessuna descrizione.",
  "Platforms_AXEL_Player_Description": "AXEL Player era una plugin per contenuti interattivi 3D creata da MindAvenue nel 2002. Forniva un modo per modelli e animazioni per il programma di authoring web AXELedge e AXELpublisher, che convertiva file da altri software 3D come 3ds Max. Il software fu ben accolto dai critici, nonostante alcune limitazioni, una delle quali era l'assenza di molti utenti per la plugin. Nel 2005 MindAvenue fu acquistata da 20-20 Technologies, che si specializzò nel design di interni e software per lo svilluppo di arredi, e nel 2006 il loro sito divenne una pagina che reindirizzava a 20-20. Tutti i prodotti AXEL inclusa la plugin furono abbandonati.",
  "Platforms_BitPlayer_Description": "BitPlayer era un programma desktop basato sulla tecnologia Flash e Shockwave, creato nel 1999 dalla compagnia olandese BitMagic. Offriva cortometraggi quotidianamente, prodotti dalla compagnia stessa e dai loro clienti, ed erano accompagnati da pubblicità e quiz. Inizialmente valutata 6 milioni di dollari, rimase vittima del crash di dot-com seguendo i suoi advertisers e ne fu cessata la produzione nel Gennaio del 2001. Molto del suo contenuto è sopravvissuto come file SWF convertiti, nonostante funzioni extra offerte dal lettore personalizzato siano andate perdute.",
  "Platforms_Blender_Description": "Ancora nessuna descrizione.",
  "Platforms_Burster_Description": "Burster era un'implementazione creata nel 2010 di Blender Game Engine, creato 2000. Il progetto era un tentativo di far rivivere una plugin ufficiale lanciata con Blender, che fu abbandonata a causa di preoccupazioni relative alla sicurezza. Migliorò l'originale, avvantaggiandosi delle nuove versioni del programma, offrendo migliori prestazioni e grafica. L'ultima versione fu lanciata nel 2013 e dopo 3 anni senza aggiornamenti, Burster fu ufficialmente abbandonata nel 2016. Il motore per giochi stesso fu rimosso da Blender nel 2018.",
  "Platforms_Calendar_Quick_Plugin_Description": "Calendar Quick Plugin è uno strumento di produttività realizzato da Logic Pulse nel 1996. Era una nuova funzionalità aggiunta alla versione 3.2 di Calendar Quick, un calendario & programma di applicazione desktop. Consente agli utenti di pubblicarli utilizzando la funzione di esportazione in pagine internet che potrebbero essere collegate ad altre persone e visualizzate con il plugin. Dopo aver risolto un bug Y2K nel 1999, il sito web è stato lasciato abbandonato senza ulteriori aggiornamenti, e è andato giù nel 2001.",
  "Platforms_Cult3D_Description": "Cult3D era un visualizzatore web per contenuti 3D creato usando il programma authoring Cult3D Designer. Godè di moderato successo, con 6 milioni di utenti nel 2001 e diversi clienti importanti, inoltre disponeva di altre opzioni di importazione per i modelli 3D prese da altri programmi. L'ultima versione, pubblicata nel 2002, fu la 5.3 e l'ultimo aggiornamento alla plugin fu fatto nel 2004, quando la tecnologia fu venduta a Mental Images Gmbh. In seguito Nvidia acquistò Mental Images nel 2007, diventando la sussidiaria Nvidia Advanced Rendering Center. Nonostante il sito venne aggiornato, la plugin non ricevette nessun aggiornamento e a partire dal 2011 smise di essere consigliata come utile opzione, e la pagina dei download fu tenuta online per gli utenti che disponevano ancora di una licenza ma fu in seguito rimossa nel 2013.",
  "Platforms_DFusion_Home_Web_PlugIn_Description": "D'Fusion era una linea di programmi AR (realtà aumentata) che ha iniziato lo sviluppo nel 1999 da Total Immersion che ha fatto uso di videocamere per visualizzare oggetti 3D in tempo reale. Uno di questi programmi era D'Fusion @Home, rilasciato nel 2008, con un plugin più tardi nel 2009. Le applicazioni per esso sono state create utilizzando il programma di autore, D'Fusion Studio, e il suo obiettivo principale era il marketing e brevi esperienze. Entro il 2011, la tecnologia ha lottato per raggiungere l'adozione diffusa. Anche con l'implementazione Flash più accessibile e il software di autore diventando libero, la sua adozione era ancora molto limitata. A seguito dell'aumento degli smartphone, TryLive è stato sviluppato come un'altra soluzione basata su AR per visualizzare facilmente prodotti come mobili e eyewear, che ha avuto successo a differenza della linea D'Fusion che non ha ricevuto ulteriori aggiornamenti dopo il 2013. Nel 2015 la società è stata venduta ad ACEP, una società di occhiali.",
  "Platforms_DeltaPoint_WebAnimator_Description": "Ancora nessuna descrizione.",
  "Platforms_DPGraph_Description": "Creato nel 1999 da David Parker, DPGraph (Dynamic Photorealistic Graphing) è un programma eseguibile dedicato alla visualizzazione di grafici da pagine web. Possono animare e mostrare fino a 8 dimensioni, con controllo delle variabili. Ha funzionato scaricando un file in una pagina web che direbbe al browser di eseguire il programma e renderizzare i grafici. Una versione completa è stata concessa in licenza a diverse istituzioni di apprendimento per l'uso in aule e studiare per creare grafici, così come un giocatore gratuito per vederli. È stata aggiornata l'ultima volta nel 2016, e nel 2019 la versione completa di DPGraph è diventata libera da usare da chiunque.",
  "Platforms_E_Animator_SharpMotionART_Description": "E-アニメータ (e-animator) è stato un plugin di animazione rilasciato da Sharp nel 2001. Progettato con dispositivi mobili come telefoni e PDA in mente, è stato rilasciato per i modelli di telefono selezionati esclusivamente in Giappone e un plugin del browser. Ha avuto l'orgoglio per le sue piccole dimensioni di file e grafica vettoriale che si adattano a qualsiasi schermo mobile. La tecnologia è stata rilasciata al pubblico statunitense nel 2002 con il nome SharpMotionART. Né durato a lungo, come e-animator ha rilasciato il suo ultimo aggiornamento nel 2003 e SharpMotionART è stato interrotto nel 2004.",
  "Platforms_Envoy_Description": "Envoy era un formato di documento sviluppato nel 1993 da Tumbleweed Software, creato virtualmente stampandoli in WordPerfect. Era un concorrente di Adobe Acrobat e il suo formato PDF. WordPerfect Corporation è stata venduta a Novell nel 1994, che comprendeva Envoy, ma Tumbleweed ha continuato a lavorare con Novell, creando un plugin web nel 1995 per visualizzare i file online. Novell ha venduto WordPerfect a Corel nel 1996, ma ha mantenuto la proprietà di Invio. Nel 1999, Novell aveva smesso di sviluppare Envoy, e Corel ha abbandonato il supporto per l'Envoy da WordPerfect 2000. Questo ha concluso la collaborazione Tumbleweed aveva con Novell dopo l'acquisizione 1994 di Envoy, e il supporto per il plugin è stato abbandonato.",
  "Platforms_EVA_Description": "EVA ({E}xtended {V}ector {A}nimation) è un plugin di animazione leggero sviluppato da Sharp nel 1997. Aveva diverse versioni del software di authoring in bundle con computer Sharp e per diversi demografici, quello principale è “EVA Animator”. Un più bambino amichevole “EVA Animator Kids”, con un sito web エバキッズクラブ (Club EVA Kids Club) è stato lanciato nel 2000. Questi sono stati interrotti nel 2007 e sostituiti con un livello intermedio “EVA Animator School II”. L'ultimo aggiornamento importante del plugin è venuto in 2002 con una correzione minore nel 2008, ma nonostante questo ha mantenuto una piccola comunità di utenti, fino a Sharp spegnere il sito principale nel 2016.",
  "Platforms_Flatland_Rover_Description": "Rover è un plugin 3D basato sul linguaggio 3DML sviluppato nel 1997 da Flatland. Gli utenti potrebbero creare “Spots” con il programma di authoring Spotnik, fatto di “Livelli” contenente “Blocchi” per facilità di sviluppo, ed eseguirli con Rover, disponibile come plugin del browser e un programma standalone. Lo sviluppo è stato vivace fino al crash dot-com, quando la maggior parte della squadra si è sciolta, con l'ultimo aggiornamento rilasciato nel 2005, e il sito web viene abbandonato prima di scendere nel 2012. Uno degli ex sviluppatori, Michael Powers, ha deciso nel 2014 di rilanciare il sito web, creare un archivio del software e per aggiornarlo per funzionare su sistemi moderni. L'app Rover standalone è stato rivisto nel 2017, ma il plugin non tornò.",
  "Platforms_Formula_One_Description": "Ancora nessuna descrizione.",
  "Platforms_Fractal_Viewer_Description": "Ancora nessuna descrizione.",
  "Platforms_FreeHand_Description": "FreeHand è stata una suite creativa di grafica vettoriale del 1988 creata da Altsys Corporation. Macromedia comprò FreeHand nel 1994 e continuò a svilupparlo. Nell'ottobre 1996, FreeHand 7. è stato lanciato con un plugin per il web, chiamato Shockwave per FreeHand. Il plugin ha permesso alle immagini vettoriali create dal programma di essere incorporate e visualizzate in una pagina web. Nel novembre 1996, Macromedia ha acquistato FutureSplash, un altro plugin web di grafica vettoriale, che è stato rinominato Flash. FreeHand 8. è stato rilasciato nel 1998, ed ora esportato in Flash, invece del plugin FreeHand. L'ultima nuova versione del programma, FreeHand MX, è stata rilasciata nel 2003.",
  "Platforms_GoBit_Games_Plugin_Description": "La plugin GoBit Games fu creata nel 2008 da GoBit, un piccolo studio indipendenete composto da ex impiegati PopCap. Il loro primo gioco, Burger Shop, fu pubblicato nell'Ottobre del 2007 e dopo grande richiesta ne fu fatto un demo su internet 4 mesi dopo usando l'allora nuova Games plugin. Passò un anno e il demo fu rielaborato come gioco promozionale per Eggo, pubblicato da Shockwave.com il primo Febbraio 2009. La plugin fu abbandonata poco dopo con la pubblicazione di Burger Shop 2 - il suo demo usava Flash invece - lasciando Burger Shop e la sua reskin come gli unici giochi mai creati per essa.",
  "Platforms_HotSauce_Description": "Un Meta Content Framework (MCF) è stato un formato di strutturazione dei metadati sviluppato da Apple Computer's Advanced Technology Group a partire dal 1995, e nel 1996 Progetto X sarebbe diventato un plugin sperimentale creato per visualizzarli su internet, poi chiamato HotSauce, che ha presentato sitemaps in uno spazio 3D. Alla fine del 1996, 200+ siti web hanno utilizzato HotSauce, in seguito aumentando a 300+, ed è stato raggiunto un accordo con NetCarta per creare una biblioteca di oltre 30. 00 siti web per navigare utilizzando il plugin. Anche se lo standard MCF ha guadagnato qualche lode, la maggior parte degli utenti non ha visto un vantaggio per questo metodo di navigazione 3D, e il progetto è finito come uno dei molti annullati quando Steve Jobs è tornato a Apple nel 1997.",
  "Platforms_HTML_HTML5_Description": "{H}yper{T}ext {M}arkup {L}anguage è uno standard per la riproduzione di documenti tramite web browser. Originariamente sviluppato da Tim Berners-Lee nei primi anni '90 (con radici che vanno indietro fino al 1980) HTML divenne il primo metodo per condividere informazioni attraverso internet, le sue capacità espanse da altri linguaggi come CSS e JavaScript. Fu proposto per la prima volta nel 1993, e ricevette successivi aggiornamenti con HTML2 nel 1995 e HTML3 e HTML4 entrambi nel 1997. L'ultimo aggiornamento per HTML4 fu nel 2000 e negli anni successivi i suoi linguaggi correlati furono largamente ignorati come piattaforme per giochi, animazioni e altri contenuti web, con gli sviluppatori che optavano per tecnologia basata su plugin invece, ma con l'evoluzione di internet e della tecnologia, le plugin iniziarono a diventare obsolete, per cui fu fatto lo sforzo di aggiornare lo standard e nel 2008 fu lanciato HTML5. Mentre Flash e altre plugin passarono di moda, HTML5 divenne lo standard consigliato e molti spostarono i loro progetti sulla famiglia HTML - o abbandonarono le plugin proprietary del tutto - e caricarono il loro contenuto su siti come YouTube. {Note: For brevity reasons, Flashpoint labels any entry that doesn't contain frameworks or plugin-enabled content as \"HTML\".}",
  "Platforms_HyperG_Description": "Hyper-G era un Sistema di Gestione dei Contenuti Web (Web Content Management System, WCMS) basato su Gopher e sviluppato dall'Istituto di Processamento dell'Informazione e dei Nuovi Media Supportati dal Web (IICM) dell'Università Graz della Tecnologia, in Austria nel 1995. Era un alternativa agli Iper-Link di internet e utilizzava browser che disponevano di Hyper-G, il quale poteva riprodurre modelli 3D di cartelle e file e anche altri modelli, il tutto con un visualizzatore incorporato. Siccome era basato sul sempre più obsoleto Gopher, il predecessore di internet, si evolse e divenne Hyperwave nel 1996, senza disporre delle capacità aggiuntive che i browser Hyper-G offrivano, come le funzioni 3D. La maggior parte dei suoi contenuti è ora perduta a causa di come i file venivano contenuti in Gopher.",
  "Platforms_Hypercosm_Player_Description": "Basata su una tecnologia in sviluppo fin dal 1989, Hypercosm è un lettore per contenuti 3D lanciato nel 1999. La compagnia fece un forte investimento che non fruttò, essendo una delle tante vittime del crash di dot-com, fallendo nel 2001. Comunque, la compagnia fu acquistata da ORBITEC, e grazie ad un contratto con la NASA, la compagnia riuscì a ritornare più o meno in attività, e continuò a lavorare su nuovi progetti fino a che fu ristrutturata nel 2012, quando fu fermata da ORBITEC finché un nuovo socio in affari non fosse stato interessato a lavorare con la tecnologia. Questo non accadde mai, causando la chiusura di Hypercosm nel 2016.",
  "Platforms_Illuminatus_Description": "Ancora nessuna descrizione.",
  "Platforms_iPix_Description": "Ancora nessuna descrizione.",
  "Platforms_Java_Plugin_Description": "Pubblicata insieme al linguaggio di programmazione Java come una delle sue funzioni, i Java Applets erano delle piccole finestre di programmi incorporati (embed) nelle pagine per fornire ulteriori funzioni interattive. Erano progettate per essere compatibili su diversi sistemi operativi e browser, e per essere più potenti dell'HTML standard. Rimase un'opzione utile per più di 10 anni, ma nel 2013 la tecnologia su cui si basavano gli Applet cominciò a non essere più supportata dai principali browser e molti di essi divennero inutilizzabili e obsoleti nel 2017 e rimossi da Java SE 11 nel 2018.",
  "Platforms_JCAMPDX_Description": "Ancora nessuna descrizione.",
  "Platforms_Lightning_Strike_Description": "Ancora nessuna descrizione.",
  "Platforms_LiveMath_Plugin_Description": "La plugin LiveMath è un'applicazione per la matematica interattiva, capace di creare una finestra contenente note, formule, grafici e altre funzioni matematiche che venivano incorporate (embed) in una pagina di internet. Originariamente lanciata come Theorist nel 1989 da Prescience Corporation e la plugin web vera e propria lanciata nel 1994, fu poi rinominata MathView nel 1997 dopo essere stata acquistata da Waterloo Maple prima di essere poi acquistata da MathMonkeys e rinominata LiveMath nel 1999. Nel 2014, a causa di crescenti problemi ed incompatibilità con i moderni browser, la plugin fu ritirata e sostituita da un visualizzatore a sé stante chiamato LiveMath Viewer.",
  "Platforms_Live_Picture_Viewer_Description": "Ancora nessuna descrizione.",
  "Platforms_MHSV_Description": "Lanciato come alfa chiamato VSV ({V}irtual {S}passo {V}iewer) e successivamente rinominato in MHSV ({M}ultimedia {H}ome {S}ritmo {V}iewer), è stato un plugin sviluppato da ParaGraph che ha permesso di creare mondi 3D interattivi utilizzando il programma di creazione VHSB ({V}irtual {H}ome {S}ritmo {B}Uilder), che potrebbe creare sia mondi MHSV interattivi che mondi VRML statici standard. Nel 1996, lo sviluppo della VRML 2.0 standard aggiunto interattività, e ParaGraph aggiornato VHSB per consentire la creazione di VRML 2. mondi, ma ParaGraph ha deciso di lavorare con Silicon Graphics e il loro spettatore Cosmo VRML 2. giocatore, adattando VHSB per lavorare meglio, abbandonando MHSV nel processo. Silicon Graphics ha acquisito ParaGraph nel 1997 per creare Cosmo Software.",
  "Platforms_Microsoft_Silverlight_Description": "Sviluppata da Microsoft nel 2007 in risposta a Flash e Java, Silverlight è uno strumento multimediale con lo scopo principale di trasmissione video, famoso per essere usato da Netflix. Versioni più recenti videro aggiunte più funzioni per altre applicazioni. Godè di un discreto margine di popolarità, con una quota di utilizzo del 64, 7% nel 2011. Comunque nel 2012, in seguito all'annuncio della fine di NPAPI, alla pubblicazione di Windows 8 e all'inizio dell'utilizzo di HTML5, Microsoft abbandonò il software e nel 2015 entrò nello stadio di fine supporto (End-of-Life) in concomitanza con la pubblicazione di Windows 10 ed infine abbandonata ufficialmente nell'Ottobre del 2021.",
  "Platforms_NoteWorthy_Composer_Description": "Ancora nessuna descrizione.",
  "Platforms_O2C_Player_Description": "Parte della linea o2c (oggetti da vedere), l'o2c Player è stato un 1999 web 3D plugin per mostrare oggetti e scene, sviluppato dalla società tedesca mb Software AG. La società ha venduto la tecnologia o2c a ELECO plc nel 2003, che ha sviluppato e lanciato nel 2005 versione 2. del giocatore o2c, portando prestazioni molto migliori con accelerazione 3D, ed è stato marchiato di più come uno strumento CAD per gli architetti. Il supporto per altri browser è stato aggiunto, ma non sono stati fatti importanti aggiornamenti ad esso, consistenti principalmente di correzioni di bug. A partire dal 2021 il plugin è ancora disponibile per il download, ma Elcosoft si è spostato su un'implementazione Unity WebGL della tecnologia.",
  "Platforms_Octree_View_Description": "In precedenza una plugin più vecchia chiamata PicTree Viewer o PicView e poi sviluppata nuovamente come una nuova plugin chiamata Fastview prima di essere rinominata nel 1999, Octree View è un visualizzatore di oggetti 3D basato sulla tecnologia Voxel, che fu in sviluppo almeno dal 1980, che fa uso di fotocamere speciali e scanner laser per creare immagini. La compagnia continuò a fare uso della loro tecnologia e della plugin ma nel 2007 il loro sito smise di essere aggiornato, senza che ci fu più nessuna attività.",
  "Platforms_Pixound_Description": "Pixound è stato un plugin per la musica artistica, lanciato nel 1996 come joint venture da Hologramophone Research e Frankfurt Balkind Partners. Ha agito come una tastiera MIDI che ha utilizzato i valori di colore delle immagini per produrre diverse note e altezze. Nel 2003 Hologramophone ha cambiato il suo nome in Techné Media. Entro il 2005, il plugin è stato abbandonato a favore di un'applicazione standalone per Mac OS X esclusivamente.",
  "Platforms_Play3D_DeepV_Description": "Play3D era una plugin 3D pubblicata nel 1996 da Heads Off, per poi essere rinominata e ripubblicata l'anno successivo come DeepV. Oltre a una manciata di esempi, la plugin fu poco utilizzata per tutta il tempo che fu attiva. Il sito dello sviluppatore andò offline nel 2001.",
  "Platforms_PointPlus_Description": "PointPlus era un plugin per l'incorporazione di presentazioni PowerPoint sul web, sviluppato da Net-Scene ha rilasciato nel maggio del 1996 per Windows NT e 95. Si è posizionato come alternativa al più complesso Macromedia Shockwave, per gli utenti entry level di utilizzare lo standard PowerPoint. Da novembre, un visualizzatore Java era stato sviluppato che era compatibile cross-piattaforma e non ha richiesto alcun plugin. È stata mantenuta come opzione per i casi specializzati, ma la linea di prodotti ha smesso di ricevere aggiornamenti nel 1997.",
  "Platforms_PopCap_Plugin_Description": "La plugin PopCap era una plugin per mostrare demo di gioco creati dagli sviluppatori di PopCap. All'inizio la compagnia utilizzava Java per i suoi demo di gioco online per via della sua accessibilità. Più tardi, tuttavia, lo sviluppo fu cambiò, verso una plugin propria di PopCap che era disponibile come un controllo ActiveX e una plugin Firefox tradizionale. Questo diede a PopCap il vantaggio di avere una propria piattaforma per la distribuzione dei demo. Tuttavia, il suo scarso utilizzo sia da parte dei clienti che da parte di PopCap stessa portò gli sviluppatori a passare al più popolare Flash nel 2007.",
  "Platforms_ProtoPlay_Description": "ProtoPlay era un plugin destinato a mostrare i prototipi per l'interazione dei consumatori con i prodotti e una simulazione delle loro caratteristiche. Rilasciato nel 1996, si è avvalso del programma Altia Design per creare applicazioni, composto da sprite 2D con elementi interattivi. Il plugin era più utilitarista in natura, e non è stato attivamente pubblicizzato a partire dalla fine del 2003, più esistente come una caratteristica disponibile, se necessario. Altia Design e il plugin hanno continuato ad aggiornare per migliorare le funzionalità, e nel 2007 è stato rilasciato un nuovo strumento che ha permesso a Photoshop di creare applicazioni plugin chiamate PhotoProto. Nel 2009, Altia Inc. ha spostato la sua attenzione alla progettazione di interfacce utenti, lasciando dietro l'aspetto prototipazione del software, e ProtoPlay con esso.",
  "Platforms_Pulse_Player_Description": "Iniziando lo sviluppo nel 1997 con il nome 3° Gradi, Pulse Player era un plugin 3D con un focus sull'animazione. È stato rilasciato per la prima volta nel 1999 con finanziamenti e sostegno da parte di diversi membri esperti nel settore dei media Internet, ed è stato utilizzato da diversi clienti notevoli. Il plugin è stato commercializzato come una piattaforma di media divertente e creativa, e sembrava avere successo, ma all'inizio del 2001 vi è stato un cambiamento in ciò che la società voleva perseguire, rebranding il Giocatore come un business più serio e strumento educativo. Nel 2003, 5.2 è stata lanciata l'ultima versione, e poco dopo che il supporto è stato tagliato.",
  "Platforms_REBOL_Plugin_Description": "REBOL è un linguaggio di programmazione progettato in oltre 20 anni e pubblicato nel 1997. Nel 2004 è stato creato un prototipo sperimentale per una plugin web REBOL, insieme ad una pagina contenente diversi esempi. La plugin fu inizialmente, come ActiveX, esclusiva per Internet Explorer, ma nel 2006 fu rilasciata una versione per altri browser. Poco dopo ciò però, fu applicato un ultimo aggiornamento, in seguito al quale la plugin rimase un prototipo beta non sicuro da usare.",
  "Platforms_ShiVa_Web_Player_Description": "Creato da Stonetrip, e chiamato Ston3D Web Player prima del 2007, ShiVa Web Player era un plugin di contenuti web 3D per l'esecuzione di software fatto nel motore 3D ShiVa. Ha permesso scene 3D complesse con illuminazione e fisica pur avendo esigenze di elaborazione basse. Stonetrip in seguito si ribattezzò nel 2013 in ShiVa Technologies SAS e si concentrò esclusivamente sul motore. Con la rimozione di NPAPI dalla maggior parte dei browser, il supporto per il plugin è diminuito, portando agli URL di diversi file core in calo nel 2018 e rompendo la maggior parte dei giochi, e nel 2019 il suo download è stato rimosso dal sito web di ShiVa.",
  "Platforms_Show_It_Description": "Show It! è stato un plugin introdotto nel 1997 con WordPerfect Suite 8 come una delle caratteristiche di Corel Presentations 8, un concorrente di PowerPoint. Quando esportano con l'opzione Internet Publisher, potrebbero esportare le presentazioni come una presentazione statica di immagine, o come proiettore incorporato utilizzando un file proprietario che funzionava proprio come l'app desktop originale, preservando tutte le funzionalità, che avevano bisogno del plugin. Ha continuato ad essere supportato in WordPerfect Office 2000 con Presentazioni 9, ma entro il 2001, il supporto per l'opzione plugin è stato eliminato da Presentazioni 10 in WordPerfect Office 2002.",
  "Platforms_SmoothMove_Panorama_Description": "Ancora nessuna descrizione.",
  "Platforms_Squeak_Etoys_Description": "Squeak è stata una piattaforma open source, lanciata nel 2001, per la creazione di contenuti educativi e di intrattenimento. Gli utenti potrebbero creare piccole applicazioni destinate a bambini di diverse fasce di età, dai più piccoli, chiamati \"Etoys\", a \"Omniuser\" e a \"Esperto\". E 'stato rinominato Etoys nel 2008 e spostato di più verso i bambini più piccoli. Etoys 5 è stata l'ultima versione del plugin, rilasciato nel 2012. Lo sviluppo su una versione JavaScript del programma è iniziato nel 2013 dopo preoccupazioni di sicurezza, lasciando il plugin abbandonato e sostituito da esso.",
  "Platforms_Superscape_Viscape_Description": "Lanciato nel 1996 da primi pionieri 3D Superscape con supporto da Intel, e originariamente chiamato VisNet, Viscape era un plugin 3D che aveva il vantaggio distinto di interattività con i mondi, a differenza dei modelli statici di VRML 1.0. Ha goduto di un breve periodo di popolarità, e in un primo momento non c'erano piani per sostenere VRML, ma con VRML97 implementare l'interattività, un aggiornamento chiamato Viscape Universal è stato rilasciato nel 1998, aggiungendo il supporto VRML per rimanere rilevante. Ciò si è rivelato insufficiente, con difficoltà finanziarie e partenariati falliti, e i revisori che chiamano il plugin datato e ingombrante nonostante i loro sforzi in una rinascita. Anche se l'ultimo aggiornamento è stato rilasciato nel 2000, la sua tecnologia ha continuato ad essere utilizzato nella serie Lego Creator Superscape per l'anno successivo. È stato fatto un tentativo di aggiornarlo incorporando il plugin all'interno di Java Applets, chiamato Vislite, ma alla fine l'azienda poi si è concentrata sullo sviluppo dei giochi mobili e ha raggiunto un discreto successo prima di essere acquistata da Glu Mobile nel 2008.",
  "Platforms_Surround_Video_Description": "Ancora nessuna descrizione.",
  "Platforms_SVF_Viewer_Description": "Ancora nessuna descrizione.",
  "Platforms_Tcl_Plugin_Description": "Sviluppato da un piccolo team e lanciato nel 1988, Tool Command Language (Tcl, pronunciato “tickle”) è un linguaggio di programmazione dinamico open source. Nel 1994, Sun Microsystems ha portato il team a sviluppare ulteriormente la tecnologia. Uno dei risultati di questa avventura è stato un plugin 1996 che potrebbe eseguire applet Tcl (“Tclets”) incorporato in pagine. Alla fine del 1997, lo sviluppo di Tcls è stato spunato fuori a una società indipendente chiamata Scriptics, e si spunciò ancora una volta in Tcl Core Team nel 2000. Mentre lo sviluppo del linguaggio rimane vivace fino ad oggi, il lavoro sul plugin ha rallentato a una striscia nonostante non sia ufficialmente interrotto. L'ultima versione, 3.1.0, è stata pubblicata nel 2006.",
  "Platforms_ThingViewer_Description": "ThingViewer è stato un plugin multimediale 1997 fatto da Parable Corporation, che in seguito ha cambiato i nomi in ThingWorld nel 1998. Ha fatto “Things”, attività che potrebbero essere opzionalmente protette contro il furto o la manomissione e hanno un ID unico con credito da condividere intorno ai siti web, utilizzando una semplice programmazione modulare, per creare cose come immagini, animazioni e anche giochi interattivi, realizzati utilizzando il programma di creazione ThingMaker o convertendo i file di Shockwave Director utilizzando ThingConverter. E 'stato relativamente popolare, anche ottenere accordi con Microsoft in e diversi altri nel 1999, ma alla fine del 2000, la società ha ridotto il personale ed è stato in colloqui con una parte sconosciuta per una fusione per vendere la tecnologia. Il sito web è stato chiuso nel 2002.",
  "Platforms_Unity_Web_Player_Description": "Unity Engine è un motore di gioco multipiattaforma che ha lo scopo di rendere lo sviluppo del gioco più accessibile, ed è il software di sviluppo di giochi di terze parti più popolare tra gli sviluppatori in tutto il mondo. Creato accanto a Unity stessa e implementato nella prima patch nel 2005, Unity Web Player è stato uno strumento per giocare ai giochi Unity sul web. È rimasto una piattaforma popolare per i giochi 3D, ma con la rimozione del supporto NPAPI nel 2016, il plugin è stato eliminato a favore di Unity WebGL.",
  "Platforms_Visual_WebMap_Description": "Visual WebMap era uno strumento per visualizzare le mappe interattive integrate in una pagina web. E 'stato compatibile con diversi file di mappa da diversi programmi di autore, potrebbe visualizzare informazioni dettagliate sui settori e consente di fare misurazioni. Dopo il suo lancio nel 1997, non sono stati fatti più sviluppi con la tecnologia, rimanendo lo stesso fino a quando la pagina è scesa nel 2004.",
  "Platforms_Vitalize_Description": "Creato nel 1997 da Corel per la visualizzazione di contenuti realizzati con il loro Click&Create programma di autori multimediali, Vitalize! era un plugin a bassa larghezza di banda dedicato a semplici giochi web con un'enfasi sul gioco, marketing e pubblicità. Distribuito con l’aiuto di Europress, è stato orgoglioso di essere “facile da imparare e usare a differenza di Java o Shockwave. A volte nel 1999 gli ex dipendenti di Corel hanno lasciato la creazione di Clickteam, che ha poi assunto lo sviluppo nel 2000 con la versione 2.. L’ultima versione 4.0 è stata rilasciata nel 2007/2008 ed è stata disponibile sul loro sito web fino al 2012.",
  "Platforms_VRML_Description": "{V}irtual {R}eality {M}odeling {L}anguage è uno standard 3D aperto e il primo creato per il web. Quando è stato inizialmente specificato nel novembre 1994, il formato poteva rappresentare solo modelli statici senza interattività. Questo problema è stato risolto nel 1997, quando è stata pubblicata la versione 2.0, meglio conosciuta come VRML97. Nonostante non vedano mai l'uso tradizionale, sarebbe diventato l'opzione più popolare per internet-based 3D al suo lancio prima di essere sostituito nel 2001 da X3D (che era indietro compatibile con i mondi VRML). Come era un formato di file e non un plugin in sé, molte diverse implementazioni sono state fatte di VRML, spesso aggiungendo le loro caratteristiche non standard.",
  "Platforms_X3D_Description": "Ancora nessuna descrizione.",
  "Platforms_Xara_Plugin_Description": "Il plugin Xara era un visualizzatore di grafica vettoriale, usando un formato proprietario a bassa larghezza di banda. Ha lanciato una beta e successivamente versione completa nel 1996, essendo in grado di visualizzare i file Flare realizzati con CORELXara sul web. Più tardi nel 1997 Xara Webster è stato lanciato per rendere specificamente la grafica web per il plugin. Nel 1999, 2.08a è stata l'ultima versione rilasciata. Nel 2000, Xara Webster è stato sostituito da XaraX che potrebbe esportare in Flash, un altro plugin vettoriale, così il supporto per la loro opzione proprietaria è stato abbandonato, ed è stato relegato all'archivio software legacy.",
  "Platforms_Coming_Soon": "Prossimamente",
  "Platforms_Coming_Soon_Description": "Giochi e animazioni creati su queste piattaforme saranno disponibili con il prossimo aggiornamento.",
  "Platforms_Common_Ground_Description": "Ancora nessuna descrizione.",
  "Platforms_DjVu_Description": "Ancora nessuna descrizione.",
  "Platforms_Jamagic_Description": "Ancora nessuna descrizione.",
  "Platforms_Jutvision_Description": "Ancora nessuna descrizione.",
  "Platforms_mBed_Description": "Ancora nessuna descrizione.",
  "Platforms_MrSID_Description": "Ancora nessuna descrizione.",
  "Platforms_PanoramIX_Description": "Ancora nessuna descrizione.",
  "Platforms_Petz_Player_Description": "Ancora nessuna descrizione.",
  "Platforms_Sibelius_Scorch_Description": "Ancora nessuna descrizione.",
  "Platforms_Sizzler_Description": "Ancora nessuna descrizione.",
  "Platforms_Ulead_COOL_360_Description": "Ancora nessuna descrizione.",
  "Platforms_VReam_WIRL_Description": "Ancora nessuna descrizione."
}