{
  "Source_Title": "Codice Sorgente",
  "Source_Desc": "The software that powers Flashpoint is free and open-source, obviously excluding most of the supported browser plugins/technologies (we can't do much about that). Applications and utilities developed by project contributors can be found at our {GitHub team page} and at our {GitLab}.",
  "Source_Developed_Projects_Title": "Projects Developed by Flashpoint",
  "Source_Developed_Projects_Desc": "The following projects are released under the MIT license:",
  "Source_Flashpoint_Launcher_Desc": "{Flashpoint Launcher}, un launcher estensibile, con base Electron ispirato a LaunchBox.",
  "Source_Flashpoint_Proxy_Desc": "{Flashpoint Proxy}, una libreria che consente la comunicazione tra un browser/proiettore e un internet simulato di Flashpoint.",
  "Source_Flashpoint_Secure_Player_Desc": "{Flashpoint Secure Player}, un'applicazione avanzata che consente la riproduzione di contenuti basati su plugin senza apportare modifiche permanenti al registro di sistema di Windows.",
  "Source_Flashpoint_VM_Desc": "{flashpointvm}, an Apache-configured Linux disk image that securely serves the contents of ZIP archives.",
  "Source_Flashpoint_OldCPUSimulator_Desc": "{OldCPUSimulator}, uno strumento che esegue applicazioni con velocità di clock simulate.",
  "Source_Utilized_Projects_Title": "Projects Utilized by Flashpoint",
  "Source_Utilized_Projects_Desc": "The following projects are included directly within the Flashpoint download:",
  "Source_Apache_Desc": "{Apache HTTP Server}, un web server rilasciato sotto la licenza Apache-2.0.",
  "Source_Basilisk_Desc": "{Basilisk}, un browser web rilasciato sotto la licenza MPL-2.0. Flashpoint utilizza una build personalizzata a 32 bit con un proprio branding, che può essere trovato {here}.",
  "Source_Chromium_Desc": "{Chromium}, un browser web rilasciato sotto varie licenze open-source.",
  "Source_PHP_Desc": "{PHP}, un linguaggio di scripting web rilasciato sotto la licenza PHP.",
  "Source_QEMU_Desc": "{QEMU}, a machine emulator released under the GPL-2.0-only license."
}