{
  "Source_Title": "Codice Sorgente",
  "Source_Desc": "Il software che alimenta Flashpoint è gratuito e open-source, ovviamente escludendo la maggior parte dei plugin / tecnologie del browser supportati (non possiamo fare molto a riguardo). Applicazioni e utility sviluppate dai collaboratori di progetto possono essere trovate al nostro {GitHub team page} e al nostro {GitLab}.",
  "Source_Developed_Projects_Title": "Progetti sviluppati da Flashpoint",
  "Source_Developed_Projects_Desc": "I seguenti progetti sono pubblicati con la licenza MIT:",
  "Source_Flashpoint_Launcher_Desc": "{Flashpoint Launcher}, un launcher estensibile, con base Electron ispirato a LaunchBox.",
  "Source_Flashpoint_Proxy_Desc": "{Flashpoint Proxy}, una libreria che consente la comunicazione tra un browser/proiettore e un internet simulato di Flashpoint.",
  "Source_Flashpoint_Secure_Player_Desc": "{Flashpoint Secure Player}, un'applicazione avanzata che consente la riproduzione di contenuti basati su plugin senza apportare modifiche permanenti al registro di sistema di Windows.",
  "Source_Flashpoint_VM_Desc": "{flashpointvm}, un'immagine disco Linux configurata Apache-che serve in modo sicuro i contenuti degli archivi ZIP.",
  "Source_Flashpoint_OldCPUSimulator_Desc": "{OldCPUSimulator}, uno strumento che esegue applicazioni con velocità di clock simulate.",
  "Source_Utilized_Projects_Title": "Progetti utilizzati da Flashpoint",
  "Source_Utilized_Projects_Desc": "I seguenti progetti sono inclusi direttamente nel download di Flashpoint:",
  "Source_Apache_Desc": "{Apache HTTP Server}, un web server rilasciato sotto la licenza Apache-2.0.",
  "Source_Basilisk_Desc": "{Basilisk}, un browser web rilasciato sotto la licenza MPL-2.0. Flashpoint utilizza una build personalizzata a 32 bit con un proprio branding, che può essere trovato {here}.",
  "Source_Chromium_Desc": "{Chromium}, un browser web rilasciato sotto varie licenze open-source.",
  "Source_PHP_Desc": "{PHP}, un linguaggio di scripting web rilasciato sotto la licenza PHP.",
  "Source_QEMU_Desc": "{QEMU}, un emulatore di macchine rilasciato sotto la licenza GPL-2.0."
}