{
  "FAQ_Title": "Gyakran Ismételt Kérdések",
  "FAQ_Question1": "Ki/micsoda BlueMaxima?",
  "FAQ_Answer1": "BlueMaxima, or Ben Latimore is the Aussie who started Flashpoint and handles the master copies. No business or organization is involved with Flashpoint - it is a wholly community-run project.",
  "FAQ_Question2": "Milyen operációs rendszereket támogattok?",
  "FAQ_Answer2": "Flashpoint supports Windows 7 SP1 and newer (excluding stock Windows 8). MacOS and Linux versions are also available; however, they require extra steps to install and can only run a handful of the most popular browser technologies.",
  "FAQ_Question3": "Does Flashpoint pose any security concerns?",
  "FAQ_Answer3": "Not that we know of. The entirety of our application suite (minus Infinity's game-downloading tech) can't connect to the open internet; any registry changes made by Flashpoint Secure Player are removed once the game is closed; all incoming curations are passed through a PC with competent and up-to-date antivirus software; and most importantly, the launcher and all of Flashpoint's inner workings are open-source and can be found {here}. We've done our best to ensure the collection is as safe as it can be, but despite our efforts, certain antiviruses such as Avast and AVG tend to detect important components as being dangerous. If you're affected by this issue, {read this page} for troubleshooting instructions.",
  "FAQ_Question4": "Hány játék /animáció van összesen?",
  "FAQ_Answer4": "As of Flashpoint 11, we have over 130,000 games and 20,000 animations. You can search the collection without use of the launcher {here}. Alternatively, you can view the respective lists {here} and {here}.",
  "FAQ_Question5": "What platforms does the collection offer?",
  "FAQ_Answer5": "We support games and animations running on every platform listed at the {Supported Platforms} page.",
  "FAQ_Question6": "Hol vannak a Nitrome játékok?",
  "FAQ_Answer6": "Nitrome udvariasan megkért minket hogy távolítsuk el a tartalmukat a gyűjteményből. Ha szeretnél a játékaikkal játszani, azt tedd a {weboldalukon} és ha Flash nem egy opció, kövesd a növekvő {HTML5-kompatibilis katalógusukat}. {Flashpoint nem támogat bárminemű zaklatást a Nitrome döntését illetően.}",
  "FAQ_Question7": "How can I request a game/animation?",
  "FAQ_Answer7": "You can make a request by first reading {this article} all the way through, then following the links at the bottom.",
  "FAQ_Question8": "Can I add a game/animation myself?",
  "FAQ_Answer8": "Yes. Follow the instructions listed in the {curation tutorial} to set up your curator audition. Once it's accepted, you can submit as many more curations as you desire.",
  "FAQ_Question9": "I want to contribute in some other way (coding, testing, etc). How can I help?",
  "FAQ_Answer9": "Join our {Discord server} for more details. The majority of our work & communication happens there.",
  "FAQ_Question10": "A Flashpoint nyílt forráskodú?",
  "FAQ_Answer10": "Igen..is. A források a saját-készítésű technológiánkhoz, mint pl a launcherhez mind elérhetők a {GitHub-on}. A források a többi szoftverhez amit mellékelünk a Flashpoint-el a saját weboldalukon érhetőek el (nem módosítjuk egyetlen szoftvernek sem a forráskódját amit mellékelünk). A webpluginok binárisai nem nyílt forráskodúak de ha azok lennének, akkor most nem itt lennénk első helyen.",
  "FAQ_Question11": "Használhatom a logót saját célra/ elérhető Creative Commons licensz alatt?",
  "FAQ_Answer11": "Yes - the logo falls under the {CC-BY 4.0} license. For attribution, you may optionally credit Seirade and BlueMaxima's Flashpoint. Source files can be found {here}.",
  "FAQ_Question12": "Hol járulhatok hozzá a projekthez?",
  "FAQ_Answer12": "Out of respect for the artists and developers whose works can be found in Flashpoint, we try to avoid soliciting donations. While we previously ran {a fundraiser} to cover server costs, we have no plans to launch another one in the future.",
  "FAQ_Question13": "A Flashpoint nem működik megfelelően!",
  "FAQ_Answer13": "Kövesd a hibaelhárító lépéseket, amik az {útmutatóban} vannak részletezve. Ha még ezután is problémákba ütközöl, kérj segítséget a Discord szerverünkön.",
  "FAQ_Question14": "I want a game/animation removed from Flashpoint for one reason or another.",
  "FAQ_Answer14": "Alert us, either via our Discord or {directly by email}. We'll probably try to convince you to let us keep your game in for historical sake, but we aren't unreasonable.",
  "FAQ_Question15": "Van még egy kérdésem.",
  "FAQ_Answer15": "Consult our {extended FAQ}. If your question isn't answered there, join our Discord."
}