{
  "Discord_Title": "Discord",
  "Discord_Intro": "Please read the rules before joining our Discord server (they can also be viewed in {#rules-and-faq} once you're in):",
  "Discord_Rule1": "Abide by Discord’s rules, and ours: {https://discord.com/terms} / {https://discord.com/guidelines}",
  "Discord_Rule2": "Treat everyone with respect. Absolutely no harassment, witch hunting, sexism, racism, or hate speech will be tolerated. User profiles that violate this rule will be asked to be changed by staff.",
  "Discord_Rule3": "Stay on topic and keep discussions relevant to the channel. Always read the channel description if you aren't fully sure of its purpose. If a staff member asks you to move the conversation, please do so.",
  "Discord_Rule4": "Distribution of content that is currently being sold or has previously been removed from Flashpoint is not allowed.",
  "Discord_Rule5": "{Never} contact developers or artists about preserving web content for Flashpoint without staff consent. This especially includes claiming to be representing or acting on behalf of Flashpoint Archive. {{This is an immediately bannable offense.}}",
  "Discord_Rule6": "Do {not} DM or mention staff for troubleshooting issues with Flashpoint. Please read {#faq} if you have questions, use {#help}, or contact a member with the {@Helper} role.",
  "Discord_Rule7": "Promotion of yourself or affiliated parties through Discord invites, YouTube links, money-making ventures, or the like is prohibited unless it's within the context of Flashpoint or related to digital preservation. This includes DMing other server members.",
  "Discord_Rule8": "NSFW content and discussion outside the appropriate channels is prohibited.",
  "Discord_Rule9": "Politically charged or religious discussions have no place here. Take it somewhere else.",
  "Discord_Rule10": "Discussion regarding the archival of content depicting hate speech, politics, and religion is exempt from rules 2 and 8.",
  "Discord_Rule11": "If you see something against the rules or something that makes you feel unsafe, let staff know via role mention or private DM.",
  "Discord_Agreed": "I've read the rules and I want to join the server!"
}