{
  "Downloads_Title": "Downloads",
  "Downloads_Para1": "To find out what's changed since the beginning of time, see the {changelog}. Warning: it's big.",
  "Downloads_Para2": "{CONTENT DISCLAIMER:} As a museum of internet culture, the Flashpoint archive offers an extremely broad range of content - portions of which may be illegal depending on your jurisdiction. If it is an issue that the software provides access to this content, you can wipe the offending entries from your local database file by deleting the respective tag groups through the launcher's Config tab.",
  "Downloads_Software_Title": "Software Downloads",
  "Downloads_Software_Download": "Download Installer",
  "Downloads_Software_Size": "{Size:} {} (size of actual Flashpoint installation varies)",
  "Downloads_Software_Requirements": "{System Requirements:} Windows 7 SP1 or higher (limited {Mac} and {Linux} support is also available)",
  "Downloads_Software_Hash": "{SHA-256:} {{}}",
  "Downloads_Software_Para1": "The software that powers the Flashpoint archive is portable and {{built with open-source software}} (excluding the plugins themselves, which are mostly abandonware). It can operate without having the archive available locally by downloading content from our servers on-demand. The individual components comprising Flashpoint's software suite can also be updated automatically via a built-in updater.",
  "Downloads_Software_Para2": "Also available to project contributors is {Flashpoint Core}, a specially-tailored software package that contains example entries and helpful curation tools; you can download it {here}. To learn how to contribute to the archive using Flashpoint Core, read the {curation tutorial}.",
  "Downloads_Software_Para3": "{NOTE:} Some antiviruses, particularly Avast, will detect certain important files as a virus and prevent some games from working. If you are affected, {follow these instructions} to create an exception for Flashpoint. For more information about any potential security concerns from using the Flashpoint software, see {this FAQ entry}.",
  "Downloads_Archive_Title": "Archive Downloads",
  "Downloads_Archive_Para1": "New packages of the archive are generated automatically every few months, with both torrent and direct downloads available at the Flashpoint Database {here}.",
  "Downloads_Archive_Para2": "Downloading the archive is not required for the Flashpoint software to work!",
  "Downloads_Footer": "If you have any questions or concerns that aren't addressed here, consult the {FAQ} or ask in the {Discord}."
}